[{"img": "https://images.deepai.org/news-links/b4fc15a09c0d4ca7a6c82495315600b8/gartner-predictions-every-you-think-you-know-about-d.jpg", "title": "Gartner Predictions: Every You Think You Know About Data Could Be Wrong...", "url": "https://deepai.org/posts/gartner-predictions-every-you-think-you-know-about-data-could-be-wrong", "date": 1593343800.0, "zh": "高德纳预测：每一个你认为你知道的数据都可能是错误的。。。", "origin_url": "https://www.forbes.com/sites/ciocentral/2020/06/28/gartner-predictions-every-you-think-you-know-about-data-could-be-wrong/", "id": "112cbcfcd3fef0bbb96c74e88028b067", "day": "2020-06-28", "is_new": true, "is_can_visited": true, "text": "Jun 28, 2020,03:32pm EDT\nGartner Predictions: Everything You Think You Know About Data Could Be Wrong...\nBruno AzizaContributor\nCIO NetworkContributor Group\nEnterprise & Cloud\n\nThis past week, Gartner issued a list of their 100 data analytics predictions through 2024. \n\nIf you subscribe to the idea that data, analytics and artificial intelligence will define the next era of technology innovation (I do), you might want to read through the list and align your strategy accordingly.\n\nThere is a lot to pick from their top 100 predictions. You’ll likely find surprising insights that apply to your life and work. \n\nIn this piece, I’m highlighting a couple themes that I think are universally relevant.  I’d love to hear your thoughts.\n\nWHAT'S NEXT?\n\nGETTY\n\nYou Don’t Decide Anymore\n\nMost Popular In: Enterprise & Cloud\nIs Work-From-Home Productivity A Mirage?\nThe Most Innovative Companies Of 2020 According To BCG\nThe Future Of Work Now: The Computer-Assisted Translator And Lilt\n\nJust a few years ago, I wrote about the automation of decision making in our daily shopping decisions.  I asked: “what if our weekly groceries were delivered to us automatically based on the information we’re willing to share with retailers about our schedule, eating habits and preferences?”  After all, we’re used to Netflix (NASDAQ: NFLX) recommending movies based on our viewing habits.  What if that extended to our physical world?!\n\nIn this year’s predictions, Gartner implies that we might be getting closer to that reality: “by 2025, the top 10 retailers globally will leverage AI to facilitate prescriptive product recommendations, transactions and forward deployment of inventory for immediate delivery to consumers”.\n\nThe idea that Artificial Intelligence (AI) might not only aid our decision making process but that it would in fact enact decisions on our behalf might be scary for some.  However, countless examples of this trend are already present in our daily lives.  \n\nI feel so strongly about this truth that, just a few months ago, I told a reporter that “A.I.” (the acronym used for “Artificial Intelligence”) should also be used to describe the benefits we get from Artificial Intelligence: “A.I. doesn’t just stand for “Artificial Intelligence”. It also stands for “Applied and Invisible”\n\nDon’t believe me?  Try this simple exercise: \n\nPick up your phone and start a text\nType a sentence but don’t insert spaces within words (for example: ‘whatdoyou’)\nHit the spacebar.\n\nNotice how your phone inserted spaces in the correct places?  Your phone detected your error and corrected it as you typed.  It decided for you.  \n\nThis occurs around us every day.  Multiple times a day.  Almost invisibly.  In plain sight.  And it’s just the beginning.  According to Gartner: “By 2024, 80% of newly created documents and correspondence will contain recycled content and content inserted through autocompletion”\n\nThere is a massive difference between a phone completing your texts and a retailer automatically delivering goods to your doorstep.  However, my simple autocompletion example points to what I believe are important vectors for AI value realization: Application and Invisibility.  \n\nArtificial Intelligence (AI) is most useful when it is “Applied” and “Invisible”. And humans make choices (sometimes unconsciously) to accept AI into their life based on the value and the risk they perceive the service provides.\n\nThe Future\n\nGETTY\n\nBack to my retail example.  If you’ve ever used Zappos, you might have benefited from their return policy: customers can easily order multiple shoe sizes or types and return what they don’t like for free.  When I asked Zappos founder (who happens to live in my neighborhood) what was hard about starting his company, he pointed to the fact that, when he started it (over 20 years ago), investors didn’t believe that customers would behave that way.  As it turns out, they did.  That model worked so well that 10 years later, Zappos sold to Amazon for close to $1B.\n\nThe company seems to have worked out a pretty successful business model despite what investors believed would be tough barriers to overcome: the cost of shipping physical goods and consumers' habits.\n\nWhat if Zappos now sent you shoes based on what it knows about your habits? Would you find that intrusive or would you elect to pay for such a service?  \n\nAs it turns out, such a service already exists and many are already paying for it.  Take a look at Stitch Fix (NASDAQ: SFIX), an online personal styling subscription service that uses recommendation algorithms and data science to decide what clothing items to deliver to you based on size, budget and style. The company went public 3 years ago, has a valuation north of $2B and has a business model that predicated on the idea that algorithms can choose for you.  The future is already here but not everyone is aware of it. Yet.\n\nWhat does this mean for you?\n\nWhen assessing technology like Artificial Intelligence, focus on how “invisibly applicable” it is (or will be).  Focus on how effortlessly and conveniently value is delivered.  Businesses that thrive on using A.I. don’t do so because of the predictions of investors (see Zappos’ example).  They succeed because consumers choose to evolve habits based on the value that technology brings to their lives.  Value is best realized when it is applied to a specific problem and it is experienced effortlessly or invisibly (see the phone auto-correct example above).  Finally, by the time you predict a technology trend, it might already be there (see StitchFix story above): don’t miss the technology trends that are hidden in plain sight.\n\nOne More Thing\n\nIf the above feels too scary, rest assured: massive change won’t occur as abruptly as you might fear. Indeed, Gartner predicts that despite the fact that “augmented analytics technology will be ubiquitous” by 2022, “only 10% of analysts will use its full potential”.\n\nAnd the research firm goes on to explain that, through next year, “80% of line of business (LOB) leaders will override business decisions made by AI”.\n\nThe reality though is that change is coming and that it will ultimately change the way we live and work.  According to Gartner, “69% of what a manager currently does will be automated by 2024, requiring a complete overhaul of the role of the manager”.\n\nFor more insights like the above, join me every Monday as I discuss the top Data, AI and Analytics trends of the week on youtube, spotify and medium.\n\nFollow me on Twitter or LinkedIn. Check out my website. \nBruno Aziza\n\nBruno Aziza is a technology entrepreneur. He has focused on scaling businesses and turning them into global leaders. Bruno has helped lead startups, medium and\n\n…\n\n Read More\nSite Feedback\nTips\nCorrections\nReprints & Permissions\nTerms\nPrivacy\n© 2020 Forbes Media LLC. All Rights Reserved.\nAdChoices", "images": ["https://blogs-images.forbes.com/assets/images/avatars/blog-1215_136_c884f15e651fff91093a07726b81dbcc.jpg", "https://specials-images.forbesimg.com/imageserve/5ef8ed1e6cd39700069cfba6/960x0.jpg?fit=scale", "https://specials-images.forbesimg.com/imageserve/5ef8eeb32a9c9c000697eeac/960x0.jpg?fit=scale", "https://blogs-images.forbes.com/ciocentral/files/2016/08/Bruno-Aziza_avatar_1471885907.jpg"]}, {"img": "https://images.deepai.org/news-links/e25d28928ec84a7884888fe6ceb4f510/the-next-wave-of-ai-disruption-millennial-and-genera.jpg", "title": "The Next Wave Of AI Disruption: Millennial And Generation Z Entrepreneurial Pioneers", "url": "https://deepai.org/posts/the-next-wave-of-ai-disruption-millennial-and-generation-z-entrepreneurial-pioneers", "date": 1593323550.0, "zh": "下一波人工智能颠覆：千禧一代和Z代创业先驱", "origin_url": "https://www.forbes.com/sites/neilsahota/2020/06/28/the-next-wave-of-ai-disruption-millennial-and-generation-z-entrepreneurial-pioneers/", "id": "0d1ec82f883a54df2c4a97ae88a31e52", "day": "2020-06-28", "is_new": true, "is_can_visited": true, "text": "Jun 28, 2020,10:00am EDT\nThe Next Wave Of AI Disruption: Millennial And Generation Z Entrepreneurial Pioneers\nNeil SahotaContributor\nAI\nNeil Sahota is a globally sought after speaker and business advisor.\n\nhuman and robot hand with virtual earth hologram\n\nLEV DOLGACHOV\n\nIn a world of rapid change, artificial intelligence (AI) currently fuels most of this growth so it is no surprise that the next wave of great startups is based in AI solutions. With events like Covid-19, there is increased focus on solutions that tap into the extraordinary capabilities from AI. Something else unique is also happening. Generation Z (Gen Z) and the young millennial entrepreneurs are leading the way. \n\n\n\n\nWhere are these innovators starting? One area where they are tapping into is a field everyone has had high hopes over the past few decades: robotics. The robotics industry has always dreamed of robots becoming more than autonomous machines to tackle hard or tedious tasks. Consider, the cognition required in activities relating to warehouse packaging or agriculture There are some mundane things that can be done by a robot with a little intelligence. Healthcare, manufacturing, and retail face similar challenges. With the advent of AI powered robots, the Gen Z and young millennial entrepreneurs are launching startups to complete these increasingly complex physical tasks.\n\n\n\n\nfarm robots\n\nDEPOSIT PHOTOS\n\nOne such startup is Farmwise. With the onset of Covid-19, the critical importance of food and its supply chain (and the risk of having workers physically present to complete the needed tasks) is a solid opportunity for some robot help. With startups such as Farmwise, seasonal forecasting models can boost production, and robots automate much of the farming previously done by tractors. Founded in 2016, these new entrepreneurs were a group of machine learning experts from MIT, Stanford, and Columbia. They created robots that can weed a field of crops large enough to feed 400,000 people per robot. Thomas Palomares, the CTO, describes the challenge of attacking agriculture with AI as “combining multiple domains of expertise such as machine learning, robotics, and mechanical engineering.” Farmwise leverages machine learning when a robot searches for the center of each crop, a prerequisite for high-precision weeding. Through this identification, the robots can more efficiently remove weeds which, in turn, improves crop yields and reduced the need for chemical pesticides. It is a double win.\n\nMost Popular In: AI\nGoogle’s “Zoom Killer” Adds New Video Conferencing Features\n15 Companies That Are Saving The World From Covid-19\nAndroid Phones May Soon Show You When A Business Is Calling You - And Why\n\n\n\n\nBeyond a specific task (like pulling weeds), other AI robot startups tackle an even more general problem: how to create a general AI platform that can benefit multiple use cases in virtually any industry? Covariant, an AI startup co-founded in 2017 by AI researchers at UC Berkeley, enables robots to see and reason as independent beings. This allows the robots to adapt to any customer environment across multiple industries requiring automation of physical logistics. The Covariant team trains its robots with general, human abilities, such as 3D perception and physical object manipulation. Overall, it can handle over 10,000 different items with 99 percent accuracy and pick up these objects, even if it has never seen before. Covariant’s market strategy is to expand into industries where robot automation can offload logistic challenges such as inventory management and order fulfillment in spaces such as food, healthcare, manufacturing, and retail.\n\n\n\n\nTurning to the planet, the benefit of reducing carbon pollution is a key component in the fight against climate change. One of the most effective tools discovered so far is renewable energy. Gen Z and young millennial entrepreneurs are turning to AI for assistance in improving energy efficiency, accessibility, and integration into the central energy grid. However, renewable energy is not without it is challenges. Perhaps the most prominent issue is the unpredictability of the weather. Wind and solar are the fasted growing sources of renewable energy, and both rely heavily on the weather for power generation. Although there are technological advancements to predict weather forecasting, there are still unpredictable changes in climate that can impact the flow of energy. As the demand for renewable energy continues to grow, many young entrepreneurs have focused on leveraging AI to overcome these issues and improve renewable energy productivity. \n\n\n\n\nStarted in Oakland, Powerscout has focused their efforts for accelerating the adoption of solar power for home usage. Helping to reduce costs with consumer acquisition. Powerscout uses its solar calculator to function as a Facebook Messenger chatbot to calculate solar savings estimates for its consumers. Their AI-based chatbot helps potential customers determine if installing solar panels is beneficial for their home. It also collects data (from several sources) to estimate associated installation costs of installation and the anticipated expected savings from its usage. This data not only aids the company in optimizing their existing services but also allows them to expand into new consumer markets. \n\n\n\n\nVirtual Assistant; Personal PA Services\n\nOLIVIER LE MOAL\n\nMillennial and Generation Z entrepreneurs are also making their impact on the “holy grail” of AI: the digital assistant who can help us with anything. Over the years, many digital assistant applications, like Siri and Alexa, have been useful for small tasks for like getting weather information, driving directions, event reminders, or help switching off the lights. Having been the original digital assistant, Apple’s Siri is renowned for its machine learning system, which runs on algorithms to recognize and execute users’ requests. Other virtual assistants, such as Amazon’s Alexa and the Google Assistant, have expanded to address more external capabilities, such integration with smart home technology to activate lights, air conditioning, or other electronically enabled devices on demand.\n\n\n\n\nBuilding upon this foundation of virtual assistants, many young entrepreneurs are taking innovation to the next level by leveraging AI to handle more complex tasks. One new startup, Wing AI, has utilized a hybrid of AI and human operation (a combination not often unseen in digital assistants) that can carry out any requests for its user, such as running errands, planning a three-day vacation, or ordering food. Started by recent college graduates, these entrepreneurs realized that mundane concierge were a ripe opportunity but involved a lot of complexity and variability. To handle this challenge, Wing uses AI to process a user request and employs human augmentation to recognize nuances and patterns within a request that a pure AI-based solution may not be able to identify. By combining AI and human operations, these entrepreneurs have been able to handle much more variable and complicated requests. \n\n\n\n\nClimbing the staircase of innovation\n\nRA2STUDIO\n\nMany Gen Z and young millennial entrepreneurs have unlocked new potential and innovative startups using AI. Their fresh perspective plus passion-driven goals, like social good, given them an incredible well of opportunities with AI. These young entrepreneurs are the next wave of innovation and disruption as they pioneer the growth of AI powered solutions.\n\nFollow me on Twitter or LinkedIn. Check out my website or some of my other work here. \nNeil Sahota\n\nNeil Sahota (萨冠军) is an IBM Master Inventor, United Nations (UN) Artificial Intelligence (AI) Advisor, Professor at UC Irvine, and author of the book: Own the A.I.\n\n…\n\n Read More\nSite Feedback\nTips\nCorrections\nReprints & Permissions\nTerms\nPrivacy\n© 2020 Forbes Media LLC. All Rights Reserved.\nAdChoices", "images": ["https://blogs-images.forbes.com/cognitiveworld/files/2018/09/Neil-Sahota_avatar_1537141098.png", "https://specials-images.forbesimg.com/imageserve/5ef7df2eec1b8800066f1233/960x0.jpg?fit=scale", "https://specials-images.forbesimg.com/imageserve/5ef7df65baffa30006164b3b/960x0.jpg?fit=scale", "https://specials-images.forbesimg.com/imageserve/5ef7dfbb6cd39700069cf448/960x0.jpg?fit=scale", "https://specials-images.forbesimg.com/imageserve/5ef7dff72a9c9c000697e687/960x0.jpg?fit=scale"]}, {"img": "https://images.deepai.org/news-links/630d67e4abf540f589d481f69602f68e/artificial-intelligence-experts-are-making-over-1-mi.jpg", "title": "Artificial intelligence experts are making over $1 million a year. Here's how to start", "url": "https://deepai.org/posts/artificial-intelligence-experts-are-making-over-1-million-a-year-here-s-how-to-start", "date": 1593320175.0, "zh": "人工智能专家的年收入超过100万美元。下面是如何开始", "origin_url": "https://thenextweb.com/offers/2020/06/28/artificial-intelligence-experts-are-making-over-1-million-a-year-heres-how-to-start/", "id": "79edfa5a498eb125c5f9288e6a2e4ad7", "day": "2020-06-28", "is_new": true, "is_can_visited": true, "text": "News\nEvents ▾\nBusiness ▾\nAMAs\nSpaces\nTerms & Conditions\nAbout\nAdvertise\nJobs\nContact\nLATEST\nHARD FORK\nPLUGGED\nREADME\nGROWTH QUARTERS\nDon't fall behind our tech future - Join TNW Couch Conferences ➔\nArtificial intelligence experts are making over $1 million a year. Here’s how to start\n\nby TNW DEALS — in OFFERS\n\n49\nSHARES\n\nTLDR: The Ultimate Artificial Intelligence Scientist Certification Bundle is your ticket to understanding — and maybe even working with — AI and machine learning systems.\n\nArtificial intelligence has seeped into literally every facet of human life — and examples are in front of us every day. Like how AI advances just led to a new way to test your eyesight that doesn’t involve the old eye chart. Or how the U.S. House of Representatives thinks military artificial intelligence programs are so important that they should be overseen by the deputy Secretary of Defense. Or how Carnegie Mellon University is putting $5 million toward how AI can mitigate the COVID-19 outbreak. And that all happened in the space of 24 hours this month.\n\nTNW online events\n\nOur Couch Conferences bring together industry experts to discuss what’s next\n\nREGISTER NOW\n\nThere’s a reason why AI and machine learning experts are earning seven-figure salaries (yep, $1 million) and now, you can lay the groundwork to join the AI explosion with the training in The Ultimate Artificial Intelligence Scientist Certification Bundle ($34.99, over 90 percent off from NTW Deals).\n\nThis collection of four courses offered by Super Data Science covers nearly 80 hours of content, offering inquisitive learners a 360-degree view of the advances happening in artificial intelligence and machine learning right now, as well as how that technology can be applied in virtually any field. And the training is definitely a hit, registering almost 200,000 positive reviews from over 1 million former students.\n\nAs the cornerstone of AI and machine learning, students start with a deep dive in Python A-Z, offering a full introduction to this elegantly simple, yet ultra-versatile programming language. As learners get a hold on how to code in Python, they’ll also face real world challenges to reinforce the training.\n\nNext, courses in Machine Learning A-Z and Deep Learning A-Z explore how that coding is used to help the processing of large data sets to literally help machines interpret, reason and actually make critical decisions all by themselves. Training here also gets hands-on with the construction of machine learning models and projects that highlight the difficulty of getting AI right and the problems those professionals often face.\n\nFinally, the Tensorflow 2.0: A Complete Guide on the Brand New Tensorflow goes in for an ultra-specific look at a critical industry tool for making machine learning work. Here, learners build models and even fashion their own neural networks that facilitate how machines understand and act on all that data correctly.\n\nEach course in this package is a $200 value on its own, but you can get all this AI background training now for just $34.99.\n\nPrices are subject to change.\n\nCelebrate Pride 2020 with us this month!\n\nWhy is queer representation so important? What's it like being trans in tech? How do I participate virtually? You can find all our Pride 2020 coverage here.\n\nSHARE ON FACEBOOK (0)\nSHARE ON TWITTER (45)\nEVENTS ABOUT ADVERTISE JOBS CONTACT\n© 2006–2020 The Next Web B.V. Made with ♥ in Amsterdam. Powered by", "images": ["https://cdn0.tnwcdn.com/wp-content/themes/cyberdelia/assets/img/tnw.svg", "https://cdn0.tnwcdn.com/wp-content/themes/cyberdelia/assets/img/misc/transform-counter.svg", "https://cdn0.tnwcdn.com/wp-content/blogs.dir/1/files/2020/06/sale_29690_primary_image_wide-796x398.jpg", "https://cdn0.tnwcdn.com/wp-content/themes/cyberdelia/assets/img/stackpath.svg", "https://cdn0.tnwcdn.com/wp-content/themes/cyberdelia/assets/img/icon-twitter.svg", "https://cdn0.tnwcdn.com/wp-content/themes/cyberdelia/assets/img/icon-facebook.svg", "https://cdn0.tnwcdn.com/wp-content/themes/cyberdelia/assets/img/tnw-red.svg"]}, {"img": "https://images.deepai.org/news-links/db5a93b7a07346bbbbf9a3265d990dbb/artificial-intelligence-ai-in-education-market-2020-.jpg", "title": "Artificial Intelligence (AI) in Education Market 2020 â€“ 2025 analysis examined in new Artificial ...", "url": "https://deepai.org/posts/artificial-intelligence-ai-in-education-market-2020-aeur-2025-analysis-examined-in-new-artificial", "date": 1593357975.0, "zh": "教育市场中的人工智能（AI）2020–2025年新人工智能研究。。。", "origin_url": "https://www.cuereport.com/artificial-intelligence-ai-in-education-market-11434", "id": "c55b64c5f2fa41b9eb9b8c482433aade", "day": "2020-06-28", "is_new": true, "is_can_visited": false, "text": null, "images": null}]