[{"img": "https://images.deepai.org/news-links/a11f1d2beeee4b5b83e07444f740ed14/australian-government-sinks-au-19-million-into-ai-he.jpg", "title": "Australian government sinks AU$19 million into AI health research projects", "url": "https://deepai.org/posts/australian-government-sinks-au-19-million-into-ai-health-research-projects", "date": 1593362700.0, "zh": "澳大利亚政府投入1900万澳元用于人工智能健康研究项目", "origin_url": "https://www.zdnet.com/article/australian-government-sinks-au19-million-into-ai-health-research-projects/", "id": "13b30f6fbfb4b79d6ddf0adf725342e1", "day": "2020-06-29", "is_new": true, "is_can_visited": true, "text": "\t\n\t\nMENU\n\t\nUS\nAustralian government sinks AU$19 million into AI health research projects\n\nThe funding will be divvied up between five research projects.\n\nBy Aimee Chanthadavong | June 29, 2020 -- 00:46 GMT (17:46 PDT) | Topic: Innovation\n\nThe Australian government has announced it will invest AU$19 million over three years into artificial intelligence-based health research projects designed to prevent, diagnose, and treat a range of health conditions.\n\nThere are five projects in total that will receive funding as part of this announcement.\n\nThe Centre for Eye Research Australia and the University of New South Wales (UNSW) will each receive nearly AU$5 million for their research projects.\n\nThe Centre for Eye Research Australia has developed an AI system to detect eye and cardiovascular diseases, while UNSW is focused on using AI to understand and improve the treatment of mental health, including stress, anxiety, and depression.\n\nAnother AU$7 million is being put towards two projects developed by the University of Sydney (USyd). One is about translating AI networks to support clinical work in neuro diseases.\n\nThe second USyd-led project is focused on using machine learning to improve youth mental health, with the aim to ultimately shorten trial periods where some are provided with non-optimal treatments for their conditions.\n\n\"This project will use AI to test and quantify the impacts of youth mental health interventions and as a result support the development of an ethical clinical decision-support tool that identifies how to target assessment and interventions to optimise outcomes for individuals presenting for mental health care,\" Minister for Health Greg Hunt said.\n\n\"AI will be used to understand which interventions, or components of therapies provide the vital, active ingredients, and why they are more effective for some patients and not others.\"\n\nSee also: AI is helping get medical research into the hands of doctors and patients (TechRepublic)\n\nThe remaining fund of just over AU$2 million will be shared with St Vincent's Institute of Medical Research that is using AI to potentially change breast cancer screening.\n\nElsewhere, the Victorian government has made a AU$1.5 million contribution to help Boab AI and Artesian establish an accelerator and investment fund for AI scaleups.\n\n\"This funding will help to position Victoria as a leading destination for AI technology within the Asia Pacific region, attracting and developing the best talent, investment and AI expertise,\" Minister for Innovation, Medical Research and the Digital Economy Jaala Pulford said.\n\nSet to be rolled out by the end of the year, the new accelerator program will establish an AI internship program and run AI-focused events.\n\nAdditionally, the Victorian government said Artesian will invest a minimum of AU$8 million of private sector capital in 32 AI scaleups, with a minimum of AU$300,000 for each scaleup that graduates from the Boab AI program.\n\nArtesian will also establish and raise a new venture capital fund with a target of AU$50 million to provide ongoing investment support for AI scaleups.\n\nOver at Western Australia, the state government has splashed out on a new AU$1.5 million medical cardiovascular x-ray system that has been installed at the Royal Perth Hospital (RPH).\n\nThe Western Australian government said the Artis Icono system will allow cardiologists make faster decisions more accurately during critical procedures, including implants for the treatment of heart attacks, pacemaker, and other device implants used for cardiac procedures. The system is also touted to allow patients to receive accurate results faster.\n\n\"It is essential to ensure our hospitals are using modern and effective technology to complete important tests and procedures and review in a timely manner because it improves patient outcomes,\" health minister Roger Cook said.\n\n\"Royal Perth Hospital is the only site in Western Australia to have installed the Artis Icono system which will bring significant benefits to many patients across our state.\"\n\nRELATED COVERAGE\nAI and the coronavirus fight: How artificial intelligence is taking on COVID-19\nAustralia's NIB on digitally fuelled healthcare in a post-coronavirus world\nLa Trobe University uses AI to bring mental health care to cancer patients\nMonash University researchers use AI technology to examine hospital readmissions\nHealthDirect Australia keeping tabs on directory data quality using federated platform\nRELATED TOPICS: AUSTRALIA CXO DIGITAL TRANSFORMATION TECH INDUSTRYSMART CITIES CLOUD\n\nBy Aimee Chanthadavong | June 29, 2020 -- 00:46 GMT (17:46 PDT) | Topic: Innovation\n\nSHOW COMMENTS\nMORE FROM AIMEE CHANTHADAVONG\n\nData Centers\n\nLeading Edge Data Centres puts AU$20 million towards Newcastle data centre campus\n\nBanking\n\nSuncorp Group rejigs operating model to fast-track digital and data transformation\n\nE-Commerce\n\nAmazon to build its first robotic and largest fulfilment centre in Australia\n\nHardware\n\nDTA adds audio visual and smart devices to hardware marketplace panel category list\n\nNEWSLETTERS\nRELATED STORIES\n1 of 3\n\nTwo commercial satellite ground stations go live in Alice Springs\n\nFunded by Indigenous Business Australia, the development is touted as the first of its kind on Aboriginal owned land.\n\nAU$8m fleet of shark-spotting drones and drumlines for the NSW coastline\n\nThe 'shark management' strategy will include the deployment of drones at 34 beaches and 35 SMART drumlines in locations deemed as high-risk.\n\nAustralia's Consumer Data Right: Here's everything you need to know\n\nFrom July 1, customers can request their bank to share their data for deposit and transaction accounts and credit and debit cards. Here's an in-depth look at the Consumer Data Right. ...\n\nZDNet\nCONNECT WITH US\n\n© 2020 CBS Interactive. All rights reserved. Privacy Policy | Cookies | Ad Choice | Advertise | Terms of Use | Mobile User Agreement\n\nVisit other CBS Interactive sites:\nSelect Site\nCBS Cares\nCBS Films\nCBS Radio\nCBS.com\nCBSInteractive\nCBSNews.com\nCBSSports.com\nChowhound\nCNET\nCollege Networks\nGameSpot\nLast.fm\nMaxPreps\nMetacritic.com\nMoneywatch\nmySimon\nSearch.com\nShowtime\nTechRepublic\nThe Insider\nTV.com\nUrbanBaby.com\nZDNet\nTopics\nGalleries\nVideos\nSponsored Narratives\nCA Privacy/Info We Collect\nCA Do Not Sell My Info\nNewsletters\nSite Assistance\nZDNet Academy\nTechRepublic Forums", "images": ["https://zdnet3.cbsistatic.com/hub/i/r/2014/02/17/fc9a5bf1-1174-11e4-9732-00505685119a/thumbnail/40x40/0cbfd49d5606aa5536ed8914168d4ec1/aimee-chanthadavong.jpg", "https://www.zdnet.com/article/australian-government-sinks-au19-million-into-ai-health-research-projects/"]}, {"img": "https://images.deepai.org/news-links/77482a08f4ee42b4834d7a28f6099148/pytorch-lstm-text-generation-tutorial-7139951353-thu.jpg", "title": "PyTorch LSTM: Text Generation Tutorial", "url": "https://deepai.org/posts/pytorch-lstm-text-generation-tutorial-7139951353", "date": 1593425192.0, "zh": "PyTorch LSTM：文本生成教程", "origin_url": "https://closeheat.com/blog/pytorch-lstm-text-generation-tutorial", "id": "adfa7d09a91f784816f119dfb05c9c8b", "day": "2020-06-29", "is_new": true, "is_can_visited": false, "text": null, "images": null}, {"img": "https://images.deepai.org/news-links/e153258bcc6e406c867732aa73dcbf23/cracks-in-the-great-firewall-china-s-incompetent-cov.jpg", "title": "Cracks in the 'Great Firewall': China's incompetent COVID-19 response", "url": "https://deepai.org/posts/cracks-in-the-great-firewall-china-s-incompetent-covid-19-response", "date": 1593429712.0, "zh": "“防火墙”的裂缝：中国无能的COVID-19反应", "origin_url": "https://thehill.com/opinion/international/504503-cracks-in-the-great-firewall-chinas-incompetent-covid-19-response", "id": "0c673dd9d024b9c32a51829497ce7a59", "day": "2020-06-29", "is_new": true, "is_can_visited": false, "text": null, "images": null}, {"img": "https://images.deepai.org/news-links/57597aa0206843ccba263cd314d4e101/the-future-of-work-now-the-computer-assisted-transla.jpg", "title": "The Future Of Work Now: The Computer-Assisted Translator And Lilt", "url": "https://deepai.org/posts/the-future-of-work-now-the-computer-assisted-translator-and-lilt", "date": 1593418050.0, "zh": "工作的未来：计算机辅助翻译和Lilt", "origin_url": "https://www.forbes.com/sites/tomdavenport/2020/06/29/the-future-of-work-now-the-computer-assisted-translator-and-lilt/", "id": "f73d1a91c06b5b3fd766b655a27d253d", "day": "2020-06-29", "is_new": true, "is_can_visited": false, "text": null, "images": null}, {"img": "https://images.deepai.org/news-links/bce9d587c8ef4f2bafe0e203e7abc1a3/five-steps-to-developing-a-data-science-culture-thum.jpg", "title": "Five Steps To Developing A Data Science Culture", "url": "https://deepai.org/posts/five-steps-to-developing-a-data-science-culture", "date": 1593399807.0, "zh": "发展数据科学文化的五个步骤", "origin_url": "https://www.forbes.com/sites/forbestechcouncil/2020/06/29/five-steps-to-developing-a-data-science-culture/", "id": "8ffed2d2352994cf92e3d57baf0fe4e3", "day": "2020-06-29", "is_new": true, "is_can_visited": true, "text": "Jun 29, 2020,07:00am EDT\nFive Steps To Developing A Data Science Culture\nPraveen MandalForbes Councils Member\nForbes Technology CouncilCOUNCIL POST| Paid Program\nInnovation\n\nCEO of 2predict, a data science services company. CTO of Volta Charging, an EV charging station company. MIT Connection Science Fellow.\n\nGETTY\n\nYou’ve developed a platform that’s gaining significant customer traction and enabling you to collect vast amounts of transaction and user data. Word gets out about your software, you acquire more users and feature requests start rolling in. As you develop and deliver those new features, you engage more users and collect even more data!\n\nThere’s tremendous value in that data, but limited thinking may be limiting your ability to mine it for the insights you need to further improve your product or even develop new ones that better meet the needs of your user base. Perhaps you’ve only gotten as far as creating simple plots and histograms around events, fault detection and other simple rules-based alerting and reporting. You know there’s so much more you can do with all that data — but how?\n\nThe good news is that advanced machine learning techniques are helping organizations unlock value from user data that, until recently, yielded only limited insights. Here are five actionable steps to take to nurture a data science culture and derive more value from your data:\n\nStep 1: Embrace intellectual humility\n\nYou can’t get out of basic mode if you don’t embrace the “unknown unknowns” — the often-cited Donald Rumsfeld quote on not knowing what you don’t know. In other words, it’s OK to not know everything. Acknowledge that you don’t know everything, and trust that the data can help you figure out what might be of value.\n\nIn the age of big data, artificial intelligence (AI) and easy access to powerful computing resources, there’s no need to place artificial limits because of one’s bias. This bias can lead to non-representative datasets, poorly engineered features and/or algorithmic outputs that can produce highly misleading, sometimes catastrophic results.\n\nStep 2: Learn from experts to develop a sound strategy \n\nA typical engineering organization is not designed nor adept at data science; rather, it’s built for creating and executing on product roadmaps. By contrast, data science involves research and experimentation. Key aspects of a sound strategy include:\n\nData collection, acquisition and roadmap creation \nMachine learning training pipeline \nTesting and verification methodologies \nA model roadmap\nA resourcing plan\n\nLeading these activities requires a specialized skill set beyond product management, and you may need to leverage third-party expertise. They understand best practices and have real-world experience in solving data science challenges — and they can minimize risk and frustration. \n\nOnce you have an understanding of the dos and don’ts, you can decide whether or not to continue with third-party expertise or start bringing the skill sets in-house. You may want to leverage your trusted partner for interviewing the lead data scientist and the first few hires.\n\nStep 3: Embrace experimentation\n\nOur ability to collect all kinds of data, coupled with advances in machine learning and the availability of powerful computing resources, creates a perfect storm for advanced data modeling. Supervised and unsupervised machine learning techniques are being used with increasing frequency to help provide interesting insights and foresight. \n\nImagine a scenario in which you have no idea what your dataset is good for. A machine learning engineer can experiment with using various hierarchical clustering techniques to see if any interesting patterns emerge. Once they uncover patterns, they can use the clusters to develop supervised learning models and make predictions based on labeled data within the clusters. This can be done with no previous knowledge or hypothesis about the dataset’s potential value. \n\nIf the results are not satisfactory, you can either continue to refine the models and/or figure out what gaps you might have in your datasets that are yielding these results — a “data gap” analysis, if you will. This can help you augment your data acquisition strategy and create better training datasets through an iterative process that leads to better model accuracy over time. \n\nStep 4: Adopt 'productization' as a forcing function\n\nAs your confidence grows around your “experiment,” you can begin to move the proofs-of-concept into engineering mode. Consider “productizing” your project for either an internal or external customer to encourage getting out of research mode and ultimately help make meaningful decisions that drive quality, velocity or quantifiable business metrics such as revenue, ROI or IRR hurdle rates.\n\nSome examples of productized models can include:\n\nIntegration into the current (internal) workflow\nIntegration into an internal-facing tool that is used for decision making\nIntegration of the model into an external-facing tool or product sold to customers\n\nProductization involves features development, which requires quality assurance (QA), A/B testing, support, bug fixes and so on. Consider developing a holistic productization strategy and roadmap to align teams across the organization and encourage support for the project.\n\nIt’s worth noting that model testing can be difficult and requires a special skill set beyond the stereotypical product QA engineers. The simplest method is a black-box approach in which QA engineers use datasets that the models were not trained on to check the input-to-output space mapping; that is, given these particular never-seen input datasets, how accurate is the output?\n\nStep 5: Think long-term\n\nJust as it is with developing new products, developing a new machine learning model that delivers increasingly meaningful insights and foresight from your data requires ongoing refinement; it is an iterative process where a combination of improving datasets along with algorithmic and model refinements can lead to very satisfactory performance.\n\nData science can be a powerful and transformative arsenal to your business. A culture that supports the experimenting nature of data scientists is not easy for many organizations to embrace and support. Having a longer-term vision, developing an understanding and being purposeful on the strategy can have a significant impact on decision-making velocity and quality and provide significant competitive advantage.\n\nForbes Technology Council is an invitation-only community for world-class CIOs, CTOs and technology executives. Do I qualify?\n\nFollow me on LinkedIn. Check out my website. \nPraveen Mandal\n\nCEO of 2predict, a data science services company. CTO of Volta Charging, an EV charging station company. MIT Connection Science Fellow. Read Praveen Mandal's full\n\n…\n\n Read More\nSite Feedback\nTips\nCorrections\nReprints & Permissions\nTerms\nPrivacy\n© 2020 Forbes Media LLC. All Rights Reserved.\nAdChoices", "images": ["https://blogs-images.forbes.com/assets/images/avatars/blog-3949_400_6d18078e84d93600baaf18165a1394f8.jpg", "https://specials-images.forbesimg.com/imageserve/1171740108/960x0.jpg?fit=scale", "https://thumbor.forbes.com/thumbor/400x0/smart/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F5ef64c2187f4cc0006df11c2%2F960x0.jpg%3FcropX1%3D0%26cropX2%3D480%26cropY1%3D0%26cropY2%3D480"]}, {"img": "https://images.deepai.org/news-links/f836d68961dd4c95be011d730af8168e/team-dramatically-reduces-image-analysis-times-using.jpg", "title": "Team dramatically reduces image analysis times using deep learning, other approaches", "url": "https://deepai.org/posts/team-dramatically-reduces-image-analysis-times-using-deep-learning-other-approaches", "date": 1593426150.0, "zh": "团队使用深度学习和其他方法显著减少图像分析时间", "origin_url": "https://www.eurekalert.org/pub_releases/2020-06/mbl-tdr062920.php", "id": "9cdf7c5a9d4399d286fa45d924d65b05", "day": "2020-06-29", "is_new": true, "is_can_visited": false, "text": null, "images": null}, {"img": "https://images.deepai.org/news-links/6f649010a2fa4c3f88ef84eae81fbdde/this-new-radar-lets-cars-see-around-corners-thumb.jpg", "title": "This new radar lets cars see around corners", "url": "https://deepai.org/posts/this-new-radar-lets-cars-see-around-corners", "date": 1593410625.0, "zh": "这种新的雷达能让汽车看到拐角处", "origin_url": "https://thenextweb.com/shift/2020/06/29/new-radiowave-based-radar-lets-cars-see-round-corners-safety-mercedes/", "id": "53efbb68fd936c02415de19586597e8d", "day": "2020-06-29", "is_new": true, "is_can_visited": true, "text": "News\nEvents ▾\nBusiness ▾\nAMAs\nSpaces\nTerms & Conditions\nAbout\nAdvertise\nJobs\nContact\nLATEST\nHARD FORK\nPLUGGED\nREADME\nGROWTH QUARTERS\nDon't fall behind our tech future - Join TNW Couch Conferences ➔\nThis new radar lets cars see around corners\n\nby MATTHEW BEEDHAM — in SHIFT\n\n14\nSHARES\n\nResearchers at a US university have developed a new kind of radar which — when equipped with some AI wizardry — can help cars see round corners.\n\nPrinceton university engineers have created a type of Doppler radar, typically used to catch speeding cars, that bounces radio waves off stationary objects to effectively “see” around corners. Coupled with algorithms that interpret how the radiowaves reflect off secondary objects, the radar can interpret moving objects that are out of human view.\n\nIt kinda works like those SONAR systems they used to search for the Loch Ness monster (she’s real ok).\n\n[Read: McDonald’s will add EV chargers to hundreds of its UK restaurants — and I’m lovin’ it]\n\nCredit: Princeton University Engineering\nOn the radar screen (left) there is an object (orange squares) approaching from the left. The regular camera view shows that they are obscured by some commercial buildings.\nCredit: Princeton University Engineering\nThe cyclist is now visible to the regular camera (and the driver), the orange blocks are now also plainly visible. The cyclist was tracked as they rode out from behind the containers.\n\n“This will enable cars to see occluded objects that today’s LiDAR and camera sensors cannot record, for example, allowing a self-driving vehicle to see around a dangerous intersection” said Researcher and Assistant Professor of Computer Science, Felix Heide.\n\nAt the moment, the system is only capable of sensing cyclists and pedestrians, but researchers say it could be developed to detect moving cars too.\n\nWhat’s more, the sensors are quite cheap when compared to the likes of LiDAR, so it could be introduced to a whole host of cars and scale as a system quite quickly.\n\nCredit: Princeton University Computer Imaging Lab\nMercedes-Benz appear to have provided the vehicles for testing the new radar systems. Will we see this on the next generation of vehicles? Who knows… but the researchers think so.\nTNW Couch Conferences\n\nJoin industry leaders to define new strategies for an uncertain future\n\nREGISTER NOW\n\nInterestingly, the academic paper accompanying the news has Nicolas Schiener of Mercedes-Benz AG listed as a co-author. It seems that the German automaker provided the vehicles for testing and developing the technology. There’s no mention if Mercs of the future will be the first to get this tech, but I wouldn’t rule it out. Mercedes-Benz has a long history in its S-class of using futuristic tech for safety, such as night vision cameras.\n\nIt seems this sensor arrangement will be used like blind spot warning systems that alert drivers when there is a potential hazard approaching from somewhere that they can’t see. Thinking of it this way, it’s totally realistic to believe that this could soon be an additional safety feature on cars of tomorrow.\n\nCelebrate Pride 2020 with us this month!\n\nWhy is queer representation so important? What's it like being trans in tech? How do I participate virtually? You can find all our Pride 2020 coverage here.\n\nINSIGHTSRADARALGORITHMLIDARSENSORCOMPUTER SCIENCEMERCEDES-BENZAUTOMOTIVE INDUSTRYSAFETY\nSHARE ON FACEBOOK (0)\nSHARE ON TWITTER (13)\nEVENTS ABOUT ADVERTISE JOBS CONTACT\n© 2006–2020 The Next Web B.V. Made with ♥ in Amsterdam. Powered by", "images": ["https://cdn0.tnwcdn.com/wp-content/themes/cyberdelia/assets/img/tnw.svg", "https://cdn0.tnwcdn.com/wp-content/themes/cyberdelia/assets/img/misc/transform-counter.svg", "https://cdn0.tnwcdn.com/wp-content/blogs.dir/1/files/2020/06/mercedes-princeton-doppler-radar-corners-radiowaves-safety-feature-ai-car-future-796x448.jpg", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://cdn0.tnwcdn.com/wp-content/themes/cyberdelia/assets/img/stackpath.svg", "https://cdn0.tnwcdn.com/wp-content/themes/cyberdelia/assets/img/icon-twitter.svg", "https://cdn0.tnwcdn.com/wp-content/themes/cyberdelia/assets/img/icon-facebook.svg", "https://cdn0.tnwcdn.com/wp-content/themes/cyberdelia/assets/img/tnw-red.svg"]}, {"img": "https://images.deepai.org/publication-preview/the-heterogeneity-hypothesis-finding-layer-wise-dissimilated-network-architecture-page-14-thumb.jpg", "title": "The Heterogeneity Hypothesis: Finding Layer-Wise Dissimilated Network Architecture", "url": "https://deepai.org/publication/the-heterogeneity-hypothesis-finding-layer-wise-dissimilated-network-architecture", "date": 1593424766.0, "zh": "异质性假设：寻找分层异化网络体系结构", "origin_url": "http://arxiv.org/pdf/2006.16242v1", "id": "5b86885972754bdcaa9174784d7464bc", "day": "2020-06-29", "is_new": true, "is_can_visited": true, "text": "", "images": []}]