[{"img": "https://images.deepai.org/publication-preview/a-novel-graph-based-clustering-approach-to-document-topic-modeling-page-1-thumb.jpg", "title": "A Novel Graph Based Clustering Approach to Document Topic Modeling", "url": "https://deepai.org/publication/a-novel-graph-based-clustering-approach-to-document-topic-modeling", "date": 1593630970.0, "origin_url": "https://api.deepai.org/publication-download-pdf/a-novel-graph-based-clustering-approach-to-document-topic-modeling", "zh": "一种新的基于图的聚类文档主题建模方法", "is_can_visited": false, "text": null, "images": null, "id": "258da38c1f5b058b5503e86dd5e6c4ae", "day": "2020-07-02", "is_new": true}, {"img": "https://images.deepai.org/guide/best-machine-learning-and-data-thumb-4963.jpg", "title": "Best Machine Learning and Data Science Books 2020", "url": "https://deepai.org/guide/best-machine-learning-and-data-science-books", "date": 1593625202.0, "origin_url": "https://deepai.org/guide/best-machine-learning-and-data-science-books", "zh": "2020年最佳机器学习和数据科学书籍", "is_can_visited": true, "text": "RESEARCHERS\nDEVELOPERS\n⋯\nLOGIN\nSIGNUP\nBest Machine Learning and Data Science Books 2020\nZahin Rahman\n0 share comments\n\n﻿The world’s most valuable resource is now data! That’s how far The Economist went in relaying the value of data as a commodity, claiming it has now even surpassed the traditional monopoly of oil. Indeed and LinkedIn have consistently ranked Machine Learning Engineers and Data Scientists as some of the hottest professions in the last few years and predict that the demand trend will only continue to grow well into the decade.\n\n\n\n\n\nLearning and mastering machine learning and data science can be overwhelming on the technical side. There are countless books, online courses, and graduate degrees that are offering this knowledge with varying breadth and depth – so, where do you start?\n\n \n\nThrough the rest of the article, we’ll review some of the most popular books for data science and machine learning for various levels of expertise and understanding, both on technical topics as well as non technical ones. The books below are listed in no particular order and cover a large spectrum of the machine learning and data science fields. Some of these books will require familiarity with some coding languages, mathematical concepts or even prior machine learning experience, but we’ll be sure to mention it if that’s the case.\n\n\n\n\nSuperintelligence: Paths, Dangers, Strategies\n\n\n\n\nAuthor(s):\n\n\t\n\nNick Bostrom\n\n\n\n\nPrice Range (USD):\n\n\t\n\n$21.50 (Hardcover)  Buy on Amazon.com\n\n\n\n\nNumber of Reviews:\n\n\t\n\n909\n\n\n\n\nAverage Review Rating (out of 5)\n\n\t\n\n4.1\n\n\n\n\nCategories\n\n\t\n\nFuture of AI; Moral Implications of AI; AI Philosophy; AI and Society\n\n\n\n\nPrerequisites:\n\n\t\n\nN/A\n\n\n\n\nBook Abstract:\n\n\t\n\n“Superintelligence asks the questions: What happens when machines surpass humans in general intelligence? Will artificial agents save or destroy us? Nick Bostrom lays the foundation for understanding the future of humanity and intelligent life. \n\nThe human brain has some capabilities that the brains of other animals lack. It is to these distinctive capabilities that our species owes its dominant position. Other animals have stronger muscles or sharper claws, but we have cleverer brains. If machine brains one day come to surpass human brains in general intelligence, then this new superintelligence could become very powerful. As the fate of the gorillas now depends more on us humans than on the gorillas themselves, so the fate of our species then would come to depend on the actions of the machine superintelligence. \n\nBut we have one advantage: we get to make the first move. Will it be possible to construct a seed AI or otherwise to engineer initial conditions so as to make an intelligence explosion survivable? How could one achieve a controlled detonation? \n\nThis profoundly ambitious and original book picks its way carefully through a vast tract of forbiddingly difficult intellectual terrain. Yet the writing is so lucid that it somehow makes it all seem easy. \n\nAfter an utterly engrossing journey that takes us to the frontiers of thinking about the human condition and the future of intelligent life, we find in Nick Bostrom's work nothing less than a reconceptualization of the essential task of our time.”\n\n \n\nNick Bostrom, in this book, artfully leverages his background in computational neuroscience and Artificial Intelligence (AI) with his inherent philosophical thinking to provide an unprecedented analysis of the future with AI. \n\nBostrom imagines how we can create an AI far superior than we could have imagined and what risks it entails in terms of the world and societal power dynamics, while delving into how things can potentially go wrong and if superintelligence can replace us as the dominant lifeform on Earth. He talks about steering the future course through uncharted territory and navigating this still unknown terrain. The mere projection of such potentially grim scenarios forces us to begin considering solutions for them and the author looks at several such solutions.\n\nThis book is definitely written from a philosophical standpoint and a great insight into the world we are headed towards and the policies, regulations and thought leadership that is required for a harmonious co-existence.  \n\nThe book was recommended by Bill Gates and Elon Musk as worth reading.\n\n\n\n\nDeep Learning with Python\n\n\n\n\nAuthor(s):\n\n\t\n\nFrancois Chollet\n\n\n\n\nPrice Range (USD):\n\n\t\n\n$30.49-33.71 (Paperback)  Buy on Amazon.com\n\n\n\n\nNumber of Reviews:\n\n\t\n\n412\n\n\n\n\nAverage Review Rating (out of 5)\n\n\t\n\n4.5\n\n\n\n\nCategories\n\n\t\n\nDeep Learning; Keras; Python; Neural Networks\n\n\n\n\nPrerequisites:\n\n\t\n\nDeep Learning Theory Basics (Recommended); Python (Basic)\n\n\n\n\nBook Abstract:\n\n\t\n\n“Deep Learning with Python introduces the field of deep learning using the Python language and the powerful Keras library. Written by Keras creator and Google AI researcher François Chollet, this book builds your understanding through intuitive explanations and practical examples.”\n\n\n\n\nIn this book, Francois Chollet covers practical deep learning implementation with the Keras library, which is a high-level API and considered a much better entry point for coders to deep learning than TensorFlow, for example, based on complexity. The text strikes a relatively good balance between covering basic foundational concepts with topics and considerations for the advanced practitioners and researchers. \n\nMathematical concepts are explained using code snippets and the book is well suited for anyone with basic Python coding experience. \n\nThe first part of the book provides a general fundamental understanding and mathematical building blocks of both machine learning and deep learning. However, you will likely need another book for a more in-depth look into the theoretical side of Deep Learning such as “Deep Learning (Adaptive Computation and Machine Learning series)” by Ian, Yoshua and Aaron, which is the next book discussed. \n\nThe second part of the book introduces different practical applications of deep learning networks including Computer vision with convolutional neural networks (CNNs), natural language processing and transactional data (time series) with recurrent neural networks (RNNs) and generating texts and images using variational autoencoders (VANs) as well as generative adversarial networks (GANs). A recurring theme within deep learning is the problem of overfitting and the book addresses a range of solution techniques as well.\n\nAlthough all the examples are implemented using Keras, the topics are covered in general perspective and knowledge can be used with other similar high-level frameworks with relative ease.\n\nDeep Learning (Adaptive Computation and Machine Learning series)\n\n\n\n\nAuthor(s):\n\n\t\n\nIan Goodfellow, Yoshua Bengio, Aaron Courville\n\n\n\n\nPrice Range (USD):\n\n\t\n\n$68.50-69.25 (Paperback)   Buy on Amazon.com\n\n\n\n\nNumber of Reviews:\n\n\t\n\n759\n\n\n\n\nAverage Review Rating (out of 5)\n\n\t\n\n4.1\n\n\n\n\nCategories\n\n\t\n\nDeep Learning; Neural Networks; Convolutional Neural Networks (CNN)\n\n\n\n\nPrerequisites:\n\n\t\n\nMachine Learning (Intermediate)\n\n\n\n\nBook Abstract:\n\n\t\n\n“Deep learning is a form of machine learning that enables computers to learn from experience and understand the world in terms of a hierarchy of concepts. Because the computer gathers knowledge from experience, there is no need for a human computer operator to formally specify all the knowledge that the computer needs. The hierarchy of concepts allows the computer to learn complicated concepts by building them out of simpler ones; a graph of these hierarchies would be many layers deep. This book introduces a broad range of topics in deep learning. \n\nThe text offers mathematical and conceptual background, covering relevant concepts in linear algebra, probability theory and information theory, numerical computation, and machine learning. It describes deep learning techniques used by practitioners in industry, including deep feedforward networks, regularization, optimization algorithms, convolutional networks, sequence modeling, and practical methodology; and it surveys such applications as natural language processing, speech recognition, computer vision, online recommendation systems, bioinformatics, and video games. Finally, the book offers research perspectives, covering such theoretical topics as linear factor models, autoencoders, representation learning, structured probabilistic models, Monte Carlo methods, the partition function, approximate inference, and deep generative models. \n\nDeep Learning can be used by undergraduate or graduate students planning careers in either industry or research, and by software engineers who want to begin using deep learning in their products or platforms. A website offers supplementary material for both readers and instructors.”\n\n\n\n\nWritten by luminaries in the field such as Yoshua Bengio, considered as one of the world’s leading experts in AI and a pioneer in deep learning, this book is a rigorous and up to date reference of deep learning algorithms that is virtually self-contained.\n\nThe book has a good balance of mathematics (advanced statistics, linear algebra, numerical optimization), applications, and research topics. The applications section is definitely the meat of the book and the research topics will mostly be of interest to fellow machine learning researchers.\n\nDo note that this is a rather theoretical book and great for readers to gain intuition behind many of the concepts underpinning deep learning techniques taken for granted. Someone without any prior knowledge of machine learning probably would benefit from studying other introductory machine learning texts before tackling this one. Without a solid background, or at least a deep interest, in mathematics and practical hands-on experience with machine learning, this might end up being somewhat of a dense and challenging read. \n\n\n\nThe Book of Why: The New Science of Cause and Effect\n\n\n\n\nAuthor(s):\n\n\t\n\nJudea Pearl, Dana Mackenzie\n\n\n\n\nPrice Range (USD):\n\n\t\n\n$13.29 (Paperback)Buy on Amazon.com\n\n\n\n\nNumber of Reviews:\n\n\t\n\n343\n\n\n\n\nAverage Review Rating (out of 5)\n\n\t\n\n4.3\n\n\n\n\nCategories\n\n\t\n\nAI; Causality; Data Science; Machine Learning\n\n\n\n\nPrerequisites:\n\n\t\n\nN/A\n\n\n\n\nBook Abstract:\n\n\t\n\n“Start asking the big questions and learn how the study of causality revolutionized science and the world.\n\n \n\nCause and effect: it's at the center of scientific inquiry, and yet for decades scientists had no way of answering simple questions, such as whether smoking causes cancer. In The Book of Why, Judea Pearl and Dana Mackenzie show how Pearl's work on causality has broken through this stalemate, unleashing a revolution in our knowledge of the world. Anyone who wants to understand how science, the human mind, or artificial intelligence works needs The Book of Why.”\n\n\n\n\nThe Book of Why is about Causality and discusses how it is different than Big Data and Correlation. Judea Pearl, the main author, argues that data and pattern recognition can only get you so far in understanding complex patterns, and that the more crucial piece is building transparent models on how the data was collected and produced in the first place. Pearl expects that leveraging causal reasoning could provide machines with human-level intelligence. \n\nTerms and concepts that are explored in the book include causality, correlation, mediation, transportability, counterfactuality, among others. Causality, in the context of how Pearl describes it, is around data transparency in understanding why a certain conclusion is reached. He provides many examples along the book on how just data correlation alone fails because of a lack of upstream transparency. The concepts are certainly more on the abstract side and complex with many intermingled ideas and thoughts, but it does caution around relying solely on data to predict future events. \n\nHands-On Machine Learning with Scikit-Learn, Keras, and TensorFlow: Concepts, Tools, and Techniques to Build Intelligent Systems\n\n\n\n\nAuthor(s):\n\n\t\n\nAurélien Géron\n\n\n\n\nPrice Range (USD):\n\n\t\n\n$43.99-48.07 (Paperback)    Buy on Amazon.com\n\n\n\n\nNumber of Reviews:\n\n\t\n\n416\n\n\n\n\nAverage Review Rating (out of 5)\n\n\t\n\n4.7\n\n\n\n\nCategories\n\n\t\n\nMachine Learning; Deep Learning; Deep Neural Networks (DNN); Convolutional Neural Networks (CNN); Recurrent Neural Networks (RNN)\n\n\n\n\nPrerequisites:\n\n\t\n\nPython (Basic – Intermediate); Basic Statistics\n\n\n\n\nBook Abstract:\n\n\t\n\n“Through a series of recent breakthroughs, deep learning has boosted the entire field of machine learning. Now, even programmers who know close to nothing about this technology can use simple, efficient tools to implement programs capable of learning from data. This practical book shows you how.\n\nBy using concrete examples, minimal theory, and two production-ready Python frameworks—Scikit-Learn and TensorFlow—author Aurélien Géron helps you gain an intuitive understanding of the concepts and tools for building intelligent systems. You’ll learn a range of techniques, starting with simple linear regression and progressing to deep neural networks. With exercises in each chapter to help you apply what you’ve learned, all you need is programming experience to get started.\n\nExplore the machine learning landscape, particularly neural nets\n\nUse Scikit-Learn to track an example machine-learning project end-to-end\n\nExplore several training models, including support vector machines, decision trees, random forests, and ensemble methods\n\nUse the TensorFlow library to build and train neural nets\n\nDive into neural net architectures, including convolutional nets, recurrent nets, and deep reinforcement learning\n\nLearn techniques for training and scaling deep neural nets”\n\n\n\n\nIf you are comfortable with coding in Python and are looking for a quick introduction to both classical machine and deep learning techniques in Python from an experienced practitioner, this is a book well suited just for that. Hands-on Machine Learning is a great surface-level introduction to a vast array of machine learning and deep learning models, including their implementation in Scikit-Learn, Keras and Tensorflow (2.0). The book is comprehensive, written in a friendly tone, and contains a large set of excellent exercises, making it a great introduction to the knowledge areas as well as a useful reference text. The book also manages to strike a good balance between covering classical machine learning and deep learning, and the right amount of theory accompanied by references.\n\nAI Superpowers: China, Silicon Valley, and the New World Order\n\n\n\n\nAuthor(s):\n\n\t\n\nKai-Fu Lee\n\n\n\n\nPrice Range (USD):\n\n\t\n\n$14.28 (Hardcover)Buy on Amazon.com\n\n\n\n\nNumber of Reviews:\n\n\t\n\n618\n\n\n\n\nAverage Review Rating (out of 5)\n\n\t\n\n4.4\n\n\n\n\nCategories\n\n\t\n\nAI\n\n\n\n\nPrerequisites:\n\n\t\n\nN/A\n\n\n\n\nBook Abstract:\n\n\t\n\n“Dr. Kai-Fu Lee—one of the world’s most respected experts on AI and China—reveals that China has suddenly caught up to the US at an astonishingly rapid and unexpected pace.  \n\nIn AI Superpowers, Kai-fu Lee argues powerfully that because of these unprecedented developments in AI, dramatic changes will be happening much sooner than many of us expected. Indeed, as the US-Sino AI competition begins to heat up, Lee urges the US and China to both accept and to embrace the great responsibilities that come with significant technological power. Most experts already say that AI will have a devastating impact on blue-collar jobs. But Lee predicts that Chinese and American AI will have a strong impact on white-collar jobs as well. Is universal basic income the solution? In Lee’s opinion, probably not.  But he provides a clear description of which jobs will be affected and how soon, which jobs can be enhanced with AI, and most importantly, how we can provide solutions to some of the most profound changes in human history that are coming soon.”\n\n\n\n\nThis book is a potential eye opener for those of us unfamiliar with the wide-ranging capabilities and imminent impact of AI. Lee contrasts the Chinese’s work in AI with that in the US. While Chinese AI is based on technologies developed in the US, Chinese companies are now developing their own strategic direction. Lee suggests a future which is not only filled with promise, but also fraught with social challenges, making a strong case that AI will soon determine the relative economic power of nations. \n\nIn this book, Lee explains with striking clarity China is quickly becoming the AI superpower, having the perfect combination of: an indomitable entrepreneurial spirit; supportive government policies; well-trained AI scientists; and more data than any other country in the world. \n\nThe book is an apt recommendation to anyone who wants an understanding of the first principles of AI, why it is so powerful and why we should be concerned about it from a political and societal standpoint. However, AI Superpowers doesn’t really delve into the solutions side of things such as law, regulations, and moral responsibilities.  \n\nAn Introduction to Statistical Learning: with Applications in R (Springer Texts in Statistics)\n\n\n\n\nAuthor(s):\n\n\t\n\nGareth James, Daniela Witten, Trevor Hastie, Robert Tibshirani\n\n\n\n\nPrice Range (USD):\n\n\t\n\n$53.82 (Hardcover)  Buy on Amazon.com\n\n\n\n\nNumber of Reviews:\n\n\t\n\n550\n\n\n\n\nAverage Review Rating (out of 5)\n\n\t\n\n4.7\n\n\n\n\nCategories\n\n\t\n\nStatistics; Machine Learning; R\n\n\n\n\nPrerequisites:\n\n\t\n\nBasic Statistics (preferred)\n\n\n\n\nBook Abstract:\n\n\t\n\n“An Introduction to Statistical Learning provides an accessible overview of the field of statistical learning, an essential toolset for making sense of the vast and complex data sets that have emerged in fields ranging from biology to finance to marketing to astrophysics in the past twenty years. This book presents some of the most important modeling and prediction techniques, along with relevant applications. Topics include linear regression, classification, resampling methods, shrinkage approaches, tree-based methods, support vector machines, clustering, and more. Color graphics and real-world examples are used to illustrate the methods presented. Since the goal of this textbook is to facilitate the use of these statistical learning techniques by practitioners in science, industry, and other fields, each chapter contains a tutorial on implementing the analyses and methods presented in R, an extremely popular open source statistical software platform.\n\nTwo of the authors co-wrote The Elements of Statistical Learning (Hastie, Tibshirani and Friedman, 2nd edition 2009), a popular reference book for statistics and machine learning researchers. An Introduction to Statistical Learning covers many of the same topics, but at a level accessible to a much broader audience. This book is targeted at statisticians and non-statisticians alike who wish to use cutting-edge statistical learning techniques to analyze their data. The text assumes only a previous course in linear regression and no knowledge of matrix algebra.”\n\n \n\n \n\nAn Introduction to Statistical Learningfocusses on all foundational topics systematically, assuming no prior knowledge from the readers, other than very basic statistics. Therefore, if you consider yourself a newbie, this book will help you approach data science easily.\n\nThe core statistical ideas of model optimization such as bias-variance tradeoffs are deeply discussed and revisited through multiple example problems. Chapter are like small case studies, developing progressively in complexity, each starting off with a research question, hypothesized models and data descriptions, followed by the data analysis and modelling with the code in R demonstrated with sufficient detail. No prior knowledge of R is required - the included R exercises are particularly helpful for beginners to learn R.\n\nDeep Medicine: How Artificial Intelligence Can Make Healthcare Human Again\n\n\n\n\nAuthor(s):\n\n\t\n\nEric Topol\n\n\n\n\nPrice Range (USD):\n\n\t\n\n$11.42-14.69 (Hardcover)  Buy on Amazon.com\n\n\n\n\nNumber of Reviews:\n\n\t\n\n143\n\n\n\n\nAverage Review Rating (out of 5)\n\n\t\n\n4.4\n\n\n\n\nCategories\n\n\t\n\nHealthcare; AI\n\n\n\n\nPrerequisites:\n\n\t\n\nN/A\n\n\n\n\nBook Abstract:\n\n\t\n\n“One of America's top doctors reveals how AI will empower physicians and revolutionize patient care Medicine has become inhuman, to disastrous effect. The doctor-patient relationship--the heart of medicine--is broken: doctors are too distracted and overwhelmed to truly connect with their patients, and medical errors and misdiagnoses abound. In Deep Medicine, leading physician Eric Topol reveals how artificial intelligence can help. AI has the potential to transform everything doctors do, from notetaking and medical scans to diagnosis and treatment, greatly cutting down the cost of medicine and reducing human mortality. By freeing physicians from the tasks that interfere with human connection, AI will create space for the real healing that takes place between a doctor who can listen and a patient who needs to be heard.\n\nInnovative, provocative, and hopeful, Deep Medicine shows us how the awesome power of AI can make medicine better, for all the humans involved.”\n\n \n\n\n\n\nDeep Medicine: How Artificial Intelligence can Make Healthcare Human Again provides a quick overview of AI, in what sectors it is being used, and then proceeds to discuss its application within the different branches of healthcare, including drug discovery, omics, diagnosis from radiography, virtual medicine (telemedicine, chatbots), nutrition, and mental health. Topol brings forth the argument that incorporating AI in executing these mundane and repetitive tasks that generally have solid boundaries of scope, will eventually free up doctors to focus on value-added human-to-human interactions with their patients that machines, no matter how sophisticated, are unlikely capable of duplicating. This book is potentially a great read for not only healthcare workers but also policy makers interested in driving change in the industry. \n\n\n\n\nLife 3.0: Being Human in the Age of Artificial Intelligence\n\n\n\n\nAuthor(s):\n\n\t\n\nMax Tegmark\n\n\n\n\nPrice Range (USD):\n\n\t\n\n$15.03-15.86 (Hardcover)  Buy on Amazon.com\n\n\n\n\nNumber of Reviews:\n\n\t\n\n832\n\n\n\n\nAverage Review Rating (out of 5)\n\n\t\n\n4.3\n\n\n\n\nCategories\n\n\t\n\nAI\n\n\n\n\nPrerequisites:\n\n\t\n\nN/A\n\n\n\n\nBook Abstract:\n\n\t\n\n“How will Artificial Intelligence affect crime, war, justice, jobs, society and our very sense of being human? The rise of AI has the potential to transform our future more than any other technology—and there’s nobody better qualified or situated to explore that future than Max Tegmark, an MIT professor who’s helped mainstream research on how to keep AI beneficial.\n \nHow can we grow our prosperity through automation without leaving people lacking income or purpose? What career advice should we give today’s kids? How can we make future AI systems more robust, so that they do what we want without crashing, malfunctioning or getting hacked? Should we fear an arms race in lethal autonomous weapons? Will machines eventually outsmart us at all tasks, replacing humans on the job market and perhaps altogether? Will AI help life flourish like never before or give us more power than we can handle?\n \nWhat sort of future do you want? This book empowers you to join what may be the most important conversation of our time. It doesn’t shy away from the full range of viewpoints or from the most controversial issues—from superintelligence to meaning, consciousness and the ultimate physical limits on life in the cosmos.”\n\n \n\n\n\n\nIn Life 3.0, Max Tegmark describes the present, future, and distant future possibilities about the impacts of AI accompanied by a discussion on the popular controversies, myths and misconceptions associated with AI, before moving on to a discussion on what we really mean by “intelligence”. \n\nOverall, Tegmark remains optimistic, stating that technology is responsible for nearly all the improvements in the quality of life since the stone age and it will only continue on that path. At the same time, he convincingly illustrates the necessity for further evaluation of our goals as a society and plans for AI’s integration into our lives—one that can be the most important conversation of our times.\n\nThe author breaks down complex concepts with simple comparisons and manages to keep things, and steer clear of exaggerations, with in-depth breakdown of every possible scenario AI might take, both promising as well as grim ones. Regardless of your field of study or profession, the book really makes you ponder what “values” you want machines and AI to have. \n\nIntroduction to Machine Learning with Python: A Guide for Data Scientists\n\n\n\n\nAuthor(s):\n\n\t\n\nAndreas C Muller, Sarah Guido\n\n\n\n\nPrice Range (USD):\n\n\t\n\n$49.89 (Paperback)  Buy on Amazon.com\n\n\n\n\nNumber of Reviews:\n\n\t\n\n157\n\n\n\n\nAverage Review Rating (out of 5)\n\n\t\n\n4.2\n\n\n\n\nCategories\n\n\t\n\nMachine Learning; NLP; Python; Artificial Neural Networks (ANN)\n\n\n\n\nPrerequisites:\n\n\t\n\nPython (Basic)\n\n\n\n\nBook Abstract:\n\n\t\n\n“Machine learning has become an integral part of many commercial applications and research projects, but this field is not exclusive to large companies with extensive research teams. If you use Python, even as a beginner, this book will teach you practical ways to build your own machine learning solutions. With all the data available today, machine learning applications are limited only by your imagination.\n\nYou’ll learn the steps necessary to create a successful machine-learning application with Python and the scikit-learn library. Authors Andreas Müller and Sarah Guido focus on the practical aspects of using machine learning algorithms, rather than the math behind them. Familiarity with the NumPy and matplotlib libraries will help you get even more from this book.\n\nWith this book, you’ll learn:\n\nFundamental concepts and applications of machine learning\n\nAdvantages and shortcomings of widely used machine learning algorithms\n\nHow to represent data processed by machine learning, including which data aspects to focus on\n\nAdvanced methods for model evaluation and parameter tuning\n\nThe concept of pipelines for chaining models and encapsulating your workflow\n\nMethods for working with text data, including text-specific processing techniques\n\nSuggestions for improving your machine learning and data science skills”\n\n\n\n\nFor individuals familiar with Python who are eager to apply it in genuine Machine Learning applications, this book can definitely lay a solid foundation on the mainstream Machine Learning algorithms. It focusses mostly on Scikit-learn packages with some exposure to numpy, pandas and matplotlib. Additionally, some elements of clustering, feature engineering (PCA), and model performance evaluation metrics are discussed in detail as well, rounding off all the different segments of a typical machine learning pipeline. Deep learning topics such as Artificial Neural Networks (ANN) are covered in brevity, with the focus being in core machine learning.  \n\n\n\n\nArtificial Intelligence in Finance: A Python-Based Guide\n\n\n\n\nAuthor(s):\n\n\t\n\nYves Hilpisch\n\n\n\n\nPrice Range (USD):\n\n\t\n\n$79.99 (Paperback)  Buy on Amazon.com\n\n\n\n\nNumber of Reviews:\n\n\t\n\nN/A\n\n\n\n\nAverage Review Rating (out of 5)\n\n\t\n\nN/A\n\n\n\n\nCategories\n\n\t\n\nFinance; Python; Machine Learning; Deep Learning; Reinforcement Learning \n\n\n\n\nPrerequisites:\n\n\t\n\n\n\nBook Abstract:\n\n\t\n\n“Many industries have been revolutionized by the widespread adoption of AI and machine learning. The programmatic availability of historical and real-time financial data in combination with techniques from AI and machine learning will also change the financial industry in a fundamental way. This practical book explains how to use AI and machine learning to discover statistical inefficiencies in financial markets and exploit them through algorithmic trading.\n\nAuthor Yves Hilpisch shows practitioners, students, and academics in both finance and data science how machine and deep learning algorithms can be applied to finance. Thanks to lots of self-contained Python examples, you’ll be able to replicate all results and figures presented in the book.\n\nExamine how data is reshaping finance from a theory-driven to a data-driven discipline\n\nUnderstand the major possibilities, consequences, and resulting requirements of AI-first finance\n\nGet up to speed on the tools, skills, and major use cases to apply AI in finance yourself\n\nApply neural networks and reinforcement learning to discover statistical inefficiencies in financial markets\n\nDelve into the concepts of the technological singularity and the financial singularity”\n\n\n\n\nFinance is a huge application area for Machine Learning. For example, one of the more traditional applications lies stock price prediction with time series and transactional data. Artificial Intelligence in Finance is an unreleased book as of yet, with pre-orders being accepted leading upto its expected release in Q4 2020. There isn’t much published information or reviews on the book, but it definitely addresses a market gap for a good reference book for AI applications in Finance. \n\nGrokking Algorithms: An illustrated guide for programmers and other curious people\n\n\n\n\nAuthor(s):\n\n\t\n\nAditya Bhargava\n\n\n\n\nPrice Range (USD):\n\n\t\n\n$38.74-39.38 (Paperback)  Buy on Amazon.com\n\n\n\n\nNumber of Reviews:\n\n\t\n\n246\n\n\n\n\nAverage Review Rating (out of 5)\n\n\t\n\n4.6\n\n\n\n\nCategories\n\n\t\n\nData Structures; Algorithms; Machine Learning\n\n\n\n\nPrerequisites:\n\n\t\n\n\n\nBook Abstract:\n\n\t\n\n“Summary:\n\nGrokking Algorithms is a fully illustrated, friendly guide that teaches you how to apply common algorithms to the practical problems you face every day as a programmer. You'll start with sorting and searching and, as you build up your skills in thinking algorithmically, you'll tackle more complex concerns such as data compression and artificial intelligence. Each carefully presented example includes helpful diagrams and fully annotated code samples in Python.\n\n\nLearning about algorithms doesn't have to be boring! Get a sneak peek at the fun, illustrated, and friendly examples you'll find in Grokking Algorithms on Manning Publications' YouTube channel.\n\nContinue your journey into the world of algorithms with Algorithms in Motion, a practical, hands-on video course available exclusively at Manning.com (www.manning.com/livevideo/algorithms-in-motion).\n\nPurchase of the print book includes a free eBook in PDF, Kindle, and ePub formats from Manning Publications.\n\n\n\nAbout the Technology:\n\nAn algorithm is nothing more than a step-by-step procedure for solving a problem. The algorithms you'll use most often as a programmer have already been discovered, tested, and proven. If you want to understand them but refuse to slog through dense multipage proofs, this is the book for you. This fully illustrated and engaging guide makes it easy to learn how to use the most important algorithms effectively in your own programs.\n\nAbout the Book:\n\nGrokking Algorithms is a friendly take on this core computer science topic. In it, you'll learn how to apply common algorithms to the practical programming problems you face every day. You'll start with tasks like sorting and searching. As you build up your skills, you'll tackle more complex problems like data compression and artificial intelligence. Each carefully presented example includes helpful diagrams and fully annotated code samples in Python. By the end of this book, you will have mastered widely applicable algorithms as well as how and when to use them.\n\nWhat's Inside:\n\n\n\nCovers search, sort, and graph algorithms\n\nOver 400 pictures with detailed walkthroughs\n\nPerformance trade-offs between algorithms\n\nPython-based code samples\n\n\nAbout the Reader:\n\nThis easy-to-read, picture-heavy introduction is suitable for self-taught programmers, engineers, or anyone who wants to brush up on algorithms.\n\nAbout the Author:\n\nAditya Bhargava is a Software Engineer with a dual background in Computer Science and Fine Arts. He blogs on programming at adit.io”\n\n\n\n\nWhat makes this book stand out is its visual approach to teaching algorithms. With the plethora of illustrations in the book, this book is a must-read for ones who have a visual learning method and want to learn coding. This book is geared towards beginner-level programmers and individuals without a background in Computer Science and advanced Software Engineers or individuals with a degree in Computer Science and well versed in algorithms probably will likely find this book too high level. \n\nThe focus of the book is definitely data structures and algorithms, more so than machine learning specifically. Although it doesn’t cover all the data structure and algorithms you generally see within Computer Science, but the ones it does cover, it does so very well!\n\nData structure and algorithms is definitely a very interesting knowledge area, especially at the higher level topics, but can quickly grow to be complex and hard to visualize, especially if not explained very well - and that is where this book stands out.\n\nHands-On Machine Learning with Scikit-Learn and TensorFlow: Concepts, Tools, and Techniques to Build Intelligent Systems\n\n\n\n\nAuthor(s):\n\n\t\n\nAurélien Géron\n\n\n\n\nPrice Range (USD):\n\n\t\n\n$25.27-36.10 (Paperback)  Buy on Amazon.com\n\n\n\n\nNumber of Reviews:\n\n\t\n\n786\n\n\n\n\nAverage Review Rating (out of 5)\n\n\t\n\n4.5\n\n\n\n\nCategories\n\n\t\n\nMachine Learning; Deep Learning; Deep Neural Networks (DNN); Convolutional Neural Networks (CNN); Recurrent Neural Networks (RNN)\n\n\n\n\nPrerequisites:\n\n\t\n\nPython (Basic – Intermediate); Basic Statistics\n\n\n\n\nBook Abstract:\n\n\t\n\n“Through a series of recent breakthroughs, deep learning has boosted the entire field of machine learning. Now, even programmers who know close to nothing about this technology can use simple, efficient tools to implement programs capable of learning from data. This practical book shows you how.\n\nBy using concrete examples, minimal theory, and two production-ready Python frameworks— Scikit-learn and TensorFlow—author Aurélien Géron helps you gain an intuitive understanding of the concepts and tools for building intelligent systems. You’ll learn a range of techniques, starting with simple linear regression and progressing to deep neural networks. With exercises in each chapter to help you apply what you’ve learned, all you need is programming experience to get started.\n\nExplore the machine learning landscape, particularly neural nets\n\nUse scikit-learn to track an example machine-learning project end-to-end\n\nExplore several training models, including support vector machines, decision trees, random forests, and ensemble methods\n\nUse the TensorFlow library to build and train neural nets\n\nDive into neural net architectures, including convolutional nets, recurrent nets, and deep reinforcement learning\n\nLearn techniques for training and scaling deep neural nets\n\nApply practical code examples without acquiring excessive machine learning theory or algorithm details”\n\n\n\n\nIn the first few pages of the book, Géron provides an overview of Machine Learning (ML) systems, the main challenges around ML models, and perspectives on testing and validation of models.\n\nThis is followed by a few hands-on, end-to-end ML projects implemented with Scikit-learn libraries. Through the chapters, the author provides guidance on how you should approach framing a given problem, selecting the performance evaluation measure(s), extracting the data, performing exploratory data analysis and visualization, preparing and cleaning the data, selecting and training the model, tuning the model hyperparameters, and concluding with topics on launching, monitoring, and maintaining the system.\n\nMultiple ML models are discussed, including, but not limited to, linear and logistic regressions, Support Vector Machines (SVMs), decision trees, ensemble methods (GBM, random forest), as well as feature engineering topics such as dimensionality reduction using Principal Component Analysis (PCA).\n\nConceptual introduction to neural nets is also included in the book in the form of Multi-Level Perceptron (MLP), Deep Neural Network (DNN), Convolutional Neural Networks (CNNs) and Recurrent Neural Networks (RNN’s) with Tensorflow.\n\nHands-On Machine Learning with Scikit-Learn and TensorFlow is better suited for the advanced novices. The book provides good practical tips and hints to help you to build good instincts as a data scientist. It is best if you are already comfortable with coding in Python; and without a background in statistics, you could be prone to making poor choices once you start modelling the problems. \n\nLeave a comment...\n\n\n\n\nPOST COMMENT\n\nComments\n\nThere are no comments yet.", "images": ["https://deepai.org/static/images/logo.png", "https://deepai.org/static/images/heart.png", "https://deepai.org/static/images/heart-red.png", "https://deepai.org/static/images/share.png", "https://deepai.org/static/images/comment.png", "https://deepai.org/static/images/mail_inverted.png", "https://images.deepai.org/job-posting/artificial-intelligence-and-ma-thumb-212.jpg", "https://images.deepai.org/job-posting/technical-architect-computer-v-thumb-9342.jpg", "https://images.deepai.org/job-posting/it-data-engineer-thumb-9288.jpg", "https://images.deepai.org/job-posting/data-architect-thumb-5971.jpg", "https://images.deepai.org/job-posting/data-analyst-thumb-6685.jpg", "https://images.deepai.org/job-posting/data-analyst-thumb-9050.jpg", "https://images.deepai.org/job-posting/data-analyst-thumb-385.jpg", "https://deepai.org/static/images/google-icon.png", "https://deepai.org/static/images/github-icon.png", "https://deepai.org/static/images/twitter-icon.png", "https://deepai.org/static/images/linkedin-icon.png", "https://deepai.org/static/images/twitter-icon-medium.png", "https://deepai.org/static/images/linkedin-icon-medium.png", "https://deepai.org/static/images/facebook-icon.png"], "id": "561a2dc33a70f2f698fef6ec428896f3", "day": "2020-07-02", "is_new": true}, {"img": "/static/images/publication-placeholder-icon.png", "title": "Not All Unlabeled Data are Equal: Learning to Weight Data in Semi-supervised Learning", "url": "https://deepai.org/publication/not-all-unlabeled-data-are-equal-learning-to-weight-data-in-semi-supervised-learning", "date": 1593683945.0, "origin_url": "http://arxiv.org/pdf/2007.01293v1", "zh": "并非所有未标记的数据都是相等的：半监督学习中的加权学习", "is_can_visited": false, "text": null, "images": null, "id": "91f6a2d24fa4c084ee15afaa6075c077", "day": "2020-07-02", "is_new": true}, {"img": "https://images.deepai.org/publication-preview/provably-efficient-neural-estimation-of-structural-equation-model-an-adversarial-approach-page-1-thumb.jpg", "title": "Provably Efficient Neural Estimation of Structural Equation Model: An Adversarial Approach", "url": "https://deepai.org/publication/provably-efficient-neural-estimation-of-structural-equation-model-an-adversarial-approach", "date": 1593683747.0, "origin_url": "http://arxiv.org/pdf/2007.01290v1", "zh": "结构方程模型的可证有效神经估计：一种对抗性方法", "is_can_visited": false, "text": null, "images": null, "id": "89448e5f9234c73e3a5fa44a64793d0f", "day": "2020-07-02", "is_new": true}, {"img": "https://images.deepai.org/publication-preview/deep-single-image-manipulation-page-2-thumb.jpg", "title": "Deep Single Image Manipulation", "url": "https://deepai.org/publication/deep-single-image-manipulation", "date": 1593683727.0, "origin_url": "http://arxiv.org/pdf/2007.01289v1", "zh": "深层单图像处理", "is_can_visited": false, "text": null, "images": null, "id": "ce213d35c039a3708bcdf35faa04ae0c", "day": "2020-07-02", "is_new": true}, {"img": "https://images.deepai.org/publication-preview/robust-ambiguity-for-contact-tracing-page-1-thumb.jpg", "title": "Robust ambiguity for contact tracing", "url": "https://deepai.org/publication/robust-ambiguity-for-contact-tracing", "date": 1593683645.0, "origin_url": "http://arxiv.org/pdf/2007.01288v1", "zh": "接触跟踪的鲁棒模糊性", "is_can_visited": false, "text": null, "images": null, "id": "e74beda4626393530920d8313d24d0c2", "day": "2020-07-02", "is_new": true}, {"img": "https://images.deepai.org/publication-preview/deep-learning-for-neuroimaging-based-diagnosis-and-rehabilitation-of-autism-spectrum-disorder-a-review-page-1-thumb.jpg", "title": "Deep Learning for Neuroimaging-based Diagnosis and Rehabilitation of Autism Spectrum Disorder: A Review", "url": "https://deepai.org/publication/deep-learning-for-neuroimaging-based-diagnosis-and-rehabilitation-of-autism-spectrum-disorder-a-review", "date": 1593683359.0, "origin_url": "http://arxiv.org/pdf/2007.01285v1", "zh": "基于神经影像学的自闭症谱系障碍诊断与康复的深度学习研究进展", "is_can_visited": false, "text": null, "images": null, "id": "3542f6e93359b38bd6ccda3f2020648d", "day": "2020-07-02", "is_new": true}, {"img": "https://images.deepai.org/publication-preview/floodgate-inference-for-model-free-variable-importance-page-18-thumb.jpg", "title": "Floodgate: inference for model-free variable importance", "url": "https://deepai.org/publication/floodgate-inference-for-model-free-variable-importance", "date": 1593683278.0, "origin_url": "http://arxiv.org/pdf/2007.01283v1", "zh": "闸门：无模型变量重要性的推理", "is_can_visited": false, "text": null, "images": null, "id": "3d228c6c4daaf8ebf8d4292dac95a3e4", "day": "2020-07-02", "is_new": true}, {"img": "/static/images/publication-placeholder-icon.png", "title": "Leveraging Passage Retrieval with Generative Models for Open Domain Question Answering", "url": "https://deepai.org/publication/leveraging-passage-retrieval-with-generative-models-for-open-domain-question-answering", "date": 1593683097.0, "origin_url": "http://arxiv.org/pdf/2007.01282v1", "zh": "基于生成模型的篇章检索在开放领域问答中的应用", "is_can_visited": false, "text": null, "images": null, "id": "5831aed38a9127bd7dace5c9abd20d9e", "day": "2020-07-02", "is_new": true}, {"img": "/static/images/publication-placeholder-icon.png", "title": "Efficient estimation of the ANOVA mean dimension, with an application to neural net classification", "url": "https://deepai.org/publication/efficient-estimation-of-the-anova-mean-dimension-with-an-application-to-neural-net-classification", "date": 1593683050.0, "origin_url": "http://arxiv.org/pdf/2007.01281v1", "zh": "方差分析平均维数的有效估计及其在神经网络分类中的应用", "is_can_visited": false, "text": null, "images": null, "id": "559553b79f76ba2adb4740d77bc76b93", "day": "2020-07-02", "is_new": true}, {"img": "https://images.deepai.org/publication-preview/multicommodity-flows-in-planar-graphs-with-demands-on-faces-page-1-thumb.jpg", "title": "Multicommodity Flows in Planar Graphs with Demands on Faces", "url": "https://deepai.org/publication/multicommodity-flows-in-planar-graphs-with-demands-on-faces", "date": 1593682621.0, "origin_url": "https://deepai.org/publication/multicommodity-flows-in-planar-graphs-with-demands-on-faces", "zh": "有面需求平面图中的多商品流", "is_can_visited": false, "text": null, "images": null, "id": "d8ba4a9eb3708f2e894d06ee570f327e", "day": "2020-07-02", "is_new": true}, {"img": "https://images.deepai.org/publication-preview/weak-boundary-condition-enforcement-for-linear-kirchhoff-love-shells-formulation-error-analysis-and-verification-page-11-thumb.jpg", "title": "Weak Boundary Condition Enforcement for Linear Kirchhoff-Love Shells: Formulation, Error Analysis, and Verification", "url": "https://deepai.org/publication/weak-boundary-condition-enforcement-for-linear-kirchhoff-love-shells-formulation-error-analysis-and-verification", "date": 1593682535.0, "origin_url": "http://arxiv.org/pdf/2007.01279v1", "zh": "线性Kirchhoff Love壳的弱边界条件强化：公式、误差分析和验证", "is_can_visited": false, "text": null, "images": null, "id": "d5ebc2899f76cc45fef4c00a28f45c70", "day": "2020-07-02", "is_new": true}, {"img": "https://images.deepai.org/news-links/1f4bb3172fa84596ad41c0aa575ce16c/what-cafe-x-and-zume-can-teach-us-about-robots-in-re.jpg", "title": "What Café X And Zume Can Teach Us About Robots In Restaurants", "url": "https://deepai.org/posts/what-cafe-x-and-zume-can-teach-us-about-robots-in-restaurants", "date": 1593746775.0, "origin_url": "https://www.forbes.com/sites/forbestechcouncil/2020/07/03/what-caf-x-and-zume-can-teach-us-about-robots-in-restaurants/", "zh": "CaféX和Zume能教我们餐馆里的机器人吗", "is_can_visited": false, "text": null, "images": null, "id": "80569730ac830a86c4bf85c5482a352e", "day": "2020-07-03", "is_new": true}, {"img": "https://images.deepai.org/news-links/4fbab519572f44678c02159ba448684f/ai-50-america-s-most-promising-artificial-intelligen.jpg", "title": "AI 50: America's Most Promising Artificial Intelligence Companies", "url": "https://deepai.org/posts/ai-50-america-s-most-promising-artificial-intelligence-companies", "date": 1593744750.0, "origin_url": "https://www.forbes.com/sites/alanohnsman/2020/07/03/ai-50-americas-most-promising-artificial-intelligence-companies/", "zh": "美国最有前途的人工智能公司", "is_can_visited": false, "text": null, "images": null, "id": "86ef6788ec5d55c321108ee4738ab8f6", "day": "2020-07-03", "is_new": true}, {"img": "https://images.deepai.org/news-links/c0ddb4f993fc41c5a5c755f82abe9d3f/nec-and-japanese-research-agency-to-use-ai-for-autom.jpg", "title": "NEC and Japanese research agency to use AI for automatic plastic waste detection", "url": "https://deepai.org/posts/nec-and-japanese-research-agency-to-use-ai-for-automatic-plastic-waste-detection", "date": 1593725850.0, "origin_url": "https://www.zdnet.com/article/nec-and-japanese-research-agency-to-use-ai-for-automatic-microplastic-detection/", "zh": "NEC和日本研究机构将使用人工智能进行塑料垃圾自动检测", "is_can_visited": true, "text": "\t\n\t\nMENU\n\t\nAS\nNEC and Japanese research agency to use AI for automatic plastic waste detection\n\nThe system will be used to help determine the impact microplastics have on marine life.\n\nBy Aimee Chanthadavong | July 3, 2020 -- 05:42 GMT (13:42 GMT+08:00) | Topic: Innovation\n\nNEC and the Japan Agency Marine-Earth Science and Technology (JAMSTEC) have developed a system that uses artificial intelligence (AI) imaging recognition techniques to automatically detect microplastics from seawater and sediment samples.\n\nThe system, according to NEC, has been developed using its Rapid machine learning technology in combination with JAMESTEC's method for staining microplastics using fluorescent dyes in samples, before capturing videos of the dyed microplastics.\n\nThe software then automatically extracts image data for each microplastic that appears in the video and uses AI recognition technology to sort microplastics based on sizes and shapes at a processing speed of 60 per minute, NEC said.\n\nThe Japanese conglomerate touted the new system could improve the current method that is used to analyse microplastics to determine the impact plastic waste has on marine life.\n\nTypically, the process of analysing microplastics involves scooping seawater and sediment with a fine mesh, before using a microscope to pick and analyse each microplastic manually to determine the number, size, and types that exist in the ocean.\n\n\"It is expected that by establishing and popularising this measurement method, and by clarifying the actual situation of microplastic pollution, we will be able to contribute to the formulation of appropriate emission regulations,\" JAMSTEC marine plastics research deputy group leader Masashi Tsuchiya.\n\nRecently, the Commonwealth Scientific and Industrial Research Organisation (CSIRO) inked a partnership with Microsoft to look at how AI could be used to tackle plastic waste, as well as illegal fishing, and how it can help boost farming.\n\nBy collecting data about the spread and concentration of plastic, CSIRO is using AI and ML to analyse where the plastic might end up and also what steps can be taken on land to reduce the likelihood of plastic entering waterways and oceans.  \n\n\"Reverse vending machines\", where the public can recycle bottles and cans in return for a fee, is also on the list for exploration.  \n\nRELATED COVERAGE\nDrones and AI making a dent in Kakadu's war against weeds \nSmart coral reefs: This underwater, fish-spotting AI helps protect the rainforest of the sea\nResearchers claim industrial underwater robots can help with ocean discoveries\nMicrosoft backs six Aussie environment-focused AI projects \nHow AI and drones are trying to save the Great Barrier Reef (TechRepublic)  \nRELATED TOPICS: JAPAN CXO DIGITAL TRANSFORMATION TECH INDUSTRYSMART CITIES CLOUD\n\nBy Aimee Chanthadavong | July 3, 2020 -- 05:42 GMT (13:42 GMT+08:00) | Topic: Innovation\n\nSHOW COMMENTS\nMORE FROM AIMEE CHANTHADAVONG\n\nTech Industry\n\nUN reports global e-waste production soared beyond 53 million tonnes in 2019\n\nDigital Transformation\n\nNational Library of Australia brings 10-year-old Trove research portal into the 21st century\n\nRobotics\n\nSingapore hospital disinfects patient rooms using Xenex Lightstrike robots\n\nData Centers\n\nLeading Edge Data Centres puts AU$20 million towards Newcastle data centre campus\n\nNEWSLETTERS\nRELATED STORIES\n1 of 3\n\nWhen Apple moves Mac to Arm, is it time for Mac users to move to Windows?\n\nIt seems like an obvious question since new machines will have to be purchased. But the prevailing Facebook opinion is that it all depends on your apps. We take a deep dive. Come on in. ...\n\nTalking rubbish: How smart bins are helping one city understand the impact of lockdown\n\nOne city council has 30 smart bins spread out around the city, and they are coming in even more handy than previously thought.\n\nBMW explores in-car subscriptions for smart, connected services\n\nThe automaker is set to offer optional upgrades for smart vehicle owners in a bid to generate recurring revenue.\n\nZDNet\nCONNECT WITH US\n\n© 2020 CBS Interactive. All rights reserved. Privacy Policy | Cookies | Ad Choice | Advertise | Terms of Use | Mobile User Agreement\n\nVisit other CBS Interactive sites:\nSelect Site\nCBS Cares\nCBS Films\nCBS Radio\nCBS.com\nCBSInteractive\nCBSNews.com\nCBSSports.com\nChowhound\nCNET\nCollege Networks\nGameSpot\nLast.fm\nMaxPreps\nMetacritic.com\nMoneywatch\nmySimon\nSearch.com\nShowtime\nTechRepublic\nThe Insider\nTV.com\nUrbanBaby.com\nZDNet\nTopics\nGalleries\nVideos\nSponsored Narratives\nCA Privacy/Info We Collect\nCA Do Not Sell My Info\nNewsletters\nSite Assistance\nZDNet Academy\nTechRepublic Forums", "images": ["https://zdnet3.cbsistatic.com/hub/i/r/2014/02/17/fc9a5bf1-1174-11e4-9732-00505685119a/thumbnail/40x40/0cbfd49d5606aa5536ed8914168d4ec1/aimee-chanthadavong.jpg", "https://www.zdnet.com/article/nec-and-japanese-research-agency-to-use-ai-for-automatic-microplastic-detection/"], "id": "295eea1707eab152ad96d6617e5ccbb9", "day": "2020-07-03", "is_new": true}, {"img": "https://images.deepai.org/news-links/1b81ac5458fc469bb217806bc4013749/artificial-feathers-let-this-robotic-bird-fly-with-i.jpg", "title": "Artificial Feathers Let This Robotic Bird Fly With Incredible Agility", "url": "https://deepai.org/posts/artificial-feathers-let-this-robotic-bird-fly-with-incredible-agility", "date": 1593766350.0, "origin_url": "https://gizmodo.com/artificial-feathers-let-this-robotic-bird-fly-with-incr-1844254186", "zh": "人造羽毛让这只机器鸟以不可思议的敏捷飞行", "is_can_visited": false, "text": null, "images": [], "id": "8bfa830ba6159d2fa7c8e4b7657be35c", "day": "2020-07-03", "is_new": true}, {"img": "https://images.deepai.org/news-links/be9abec53d624e3b8c708a8f4da49aa7/study-crowdsourced-data-could-help-map-urban-food-de.jpg", "title": "Study: Crowdsourced data could help map urban food deserts", "url": "https://deepai.org/posts/study-crowdsourced-data-could-help-map-urban-food-deserts", "date": 1593682650.0, "origin_url": "https://www.eurekalert.org/pub_releases/2020-07/uota-scd070220.php", "zh": "研究：众包数据有助于绘制城市食物沙漠图", "is_can_visited": true, "text": "Skip to main content\nADVANCED SEARCH\nHOME\nCOVID-19\nNEWS RELEASES\nMULTIMEDIA\nMEETINGS\nPORTALS\nABOUT\nLOGIN\nNEWS RELEASE 2-JUL-2020\nStudy: Crowdsourced data could help map urban food deserts\n\nUNIVERSITY OF TEXAS AT DALLAS\n\nSHARE\n PRINT E-MAIL\n\nNew research from The University of Texas at Dallas suggests food deserts might be more prevalent in the U.S. than the numbers reported in government estimates.\n\nIn a feasibility study published in the journal Frontiers in Public Health, scholars found that the methods used by the U.S. Department of Agriculture (USDA) to identify areas with low access to healthy food are often outdated and narrow in scope.\n\nTheir findings indicate that crowdsourced information gathered from mobile apps such as Yelp could help provide more accurate real-time representation of food deserts in impoverished communities.\n\n\"Using data from the city of Dallas, we compared our results with the 2015 USDA database and discovered the agency needs an up-to-date source of information on grocery stores,\" said Dr. Dohyeong Kim, associate professor of public policy and political economy and of geospatial information sciences in the School of Economic, Political and Policy Sciences at UT Dallas. \"The number of food deserts may be a lot larger than what the USDA says it is.\"\n\nThe USDA considers three metrics when identifying \"food deserts,\" areas where residents lack access to fresh and healthy food: income, car ownership and distance to the nearest supermarket. In an effort to improve accuracy of food desert locations, the UT Dallas researchers looked at two additional variables not included by the USDA: access to public transit and shopper-provided food pricing gathered from Yelp, an online source of business reviews by the public.\n\n\"If a community has few public transportation options nearby, that may contribute to the existence of a food desert,\" Kim said. \"Plus, low-income households still face limited access to healthy food if prices are too high.\"\n\nThe researchers analyzed data from Dallas' 296 census tracts, which are neighborhood-sized geographical areas used by government agencies to collect population data. Nine census tracts were identified as food deserts based on the USDA's 2015 data only. Using 2018 Yelp data alone, the researchers identified 50 census tracts -- mostly in south Dallas -- as food deserts. Thirty-three census tracts were overlapped by both data sources.\n\nDue to the time difference between the two data sources, Kim cautioned that their findings could not confirm which dataset -- USDA vs. Yelp -- matches the situation on the ground more accurately, and he stressed that Yelp should not be considered as a replacement for government data. The results do show, however, that crowdsourced, georeferenced data could be a good supplement to improve accuracy of official government data and help guide health policies.\n\n\"Yelp data is still incomplete in coverage and limited for wide application, although it has the potential to be improved in the future,\" Kim said. \"This study sheds light on the need for on-the-ground, place-specific observation in the study of food deserts, and future studies should include multiple cities to gauge the quality of Yelp data across the country.\"\n\nKim added that use of such crowdsourced information also could give guidance to other public-health mapping, such as for noise or pollution.\n\n###\n\nOther contributors to the study included first author Thomas McKey, UT Dallas geospatial information sciences doctoral student, and Dr. SungChul Seo from Eulji University, South Korea.\n\nThe study was supported by the Environmental Health Action Program, funded by the Ministry of Environment, South Korea.\n\nDisclaimer: AAAS and EurekAlert! are not responsible for the accuracy of news releases posted to EurekAlert! by contributing institutions or for the use of any information through the EurekAlert system.\n\nSHARE\n PRINT E-MAIL\n\nMedia Contact\n\nAmanda Siegfried\namanda.siegfried@uutdallas.edu\n 972-883-4335\n\n @ut_dallas\n\nhttp://www.utdallas.edu \n\nMore on this News Release\nStudy: Crowdsourced data could help map urban food deserts\n\nUNIVERSITY OF TEXAS AT DALLAS\n\nJOURNAL\nFrontiers in Public Health\nFUNDER\nSouth Korean Ministry of Environment\nKEYWORDS\nDEMOGRAPHY\nINFORMATION MANAGEMENT/TRACKING SYSTEMS\nNUTRITION/NUTRIENTS\nPUBLIC HEALTH\nSOCIAL/BEHAVIORAL SCIENCE\nSOCIOECONOMICS\nSOCIOECONOMICS\nORIGINAL SOURCE\nhttps://www.utdallas.edu/news/social-sciences/food-deserts-study-2020/\nRELATED JOURNAL ARTICLE\nhttp://dx.doi.org/10.3389/fpubh.2020.00071\nMore in Social & Behavior\nCenter for BrainHealth advances understanding of brain connectivity in cannabis users\nCENTER FOR BRAINHEALTH\nStudy: Crowdsourced data could help map urban food deserts\nUNIVERSITY OF TEXAS AT DALLAS\nHow prison and police discrimination affect black sexual minority men's health\nRUTGERS UNIVERSITY\nResearchers examine refugee children's academic, social, and emotional learning outcomes\nNEW YORK UNIVERSITY\nView all in Social & Behavior \nTrending News Releases\nRadar points to moon being more metallic than researchers thought\nNASA/GODDARD SPACE FLIGHT CENTER\nFeeds of the future\nUNIVERSITY OF GÖTTINGEN\nEven in the worst COVID-19 cases, the body launches immune cells to fight back\nLA JOLLA INSTITUTE FOR IMMUNOLOGY\nHistoric floods reveal how salt marshes can save lives in the future\nROYAL NETHERLANDS INSTITUTE FOR SEA RESEARCH\nView all latest news releases \n\nCopyright © 2020 by the American Association for the Advancement of Science (AAAS)\n\nLatest News Releases RSS Feed\nAll EurekAlert! RSS Feeds\n@EurekAlert\nfacebook.com/EurekAlert\nHelp / FAQ\nDisclaimer\nPrivacy Policy\nTerms & Conditions\nContact EurekAlert!", "images": ["https://www.eurekalert.org/images/e4/logo-2x.png", "https://www.eurekalert.org/images/e4/brand.png", "https://www.eurekalert.org/images/meganav/browse-images.jpg", "https://www.eurekalert.org/images/meganav/browse-video.jpg", "https://www.eurekalert.org/images/meganav/browse-audio.jpg", "https://media.eurekalert.org/meganav/SfNMenuBanner2019.jpg", "https://media.eurekalert.org/meganav/EurekAlert_AM20.png", "https://www.eurekalert.org/images/meganav/portal-climate-new.png", "https://www.eurekalert.org/images/meganav/portal-cancer-new.png", "https://www.eurekalert.org/images/meganav/portal-marine-new.png", "https://media.eurekalert.org/meganav/AAAS-logo.png", "https://www.eurekalert.org/images/e4/logo-footer.png"], "id": "19e58aca0dff2b30763d90c400949b3e", "day": "2020-07-02", "is_new": true}, {"img": "https://images.deepai.org/news-links/e79cbbdb933149b793b163fcf8d155be/artificial-intelligence-brings-pancreatic-cancer-scr.jpg", "title": "Artificial intelligence brings pancreatic cancer screening one step closer to reality", "url": "https://deepai.org/posts/artificial-intelligence-brings-pancreatic-cancer-screening-one-step-closer-to-reality", "date": 1593679950.0, "origin_url": "https://www.eurekalert.org/pub_releases/2020-07/esfm-aib062620.php", "zh": "人工智能使胰腺癌筛查更接近现实", "is_can_visited": true, "text": "Skip to main content\nADVANCED SEARCH\nHOME\nCOVID-19\nNEWS RELEASES\nMULTIMEDIA\nMEETINGS\nPORTALS\nABOUT\nLOGIN\nNEWS RELEASE 2-JUL-2020\nArtificial intelligence brings pancreatic cancer screening one step closer to reality\n\nEUROPEAN SOCIETY FOR MEDICAL ONCOLOGY\n\nSHARE\n PRINT E-MAIL\n\nIMAGE: DR. ANANYA MALHOTRA, RESEARCH FELLOW IN STATISTICS, LONDON SCHOOL OF HYGIENE &TROPICAL MEDICINE, LONDON, UK view more \n\nCREDIT: ESMO PRESS OFFICE\n\nLugano, Switzerland, 2 July 2020 - Artificial intelligence (AI) holds promise for enabling earlier detection of pancreatic cancer, which is crucial to saving lives. The potential of AI is showcased in a study to be presented at the ESMO World Congress on Gastrointestinal Cancer, 1-4 July 2020. (1, 2)\n\nOverall, 12 in every 100,000 people develop pancreatic cancer. This means that screening everyone would be inefficient and would expose many people to unnecessary tests and potential side-effects. Between 70-80% of patients are diagnosed at an advanced stage when it is too late for curative treatment and five years after diagnosis, just 6% of patients have survived.\n\nScreening helps identify cancer early, when treatments are most effective, thus improving survival. There are two main requirements for screening. First, a screening test that is easy to perform and has few side-effects. Second, a defined group that would benefit most from screening because they are at higher risk. For example, breast cancer screening involves mammography in women aged 50 to 71 years. AI could be the desperately needed answer to define a group of higher risk individuals that would benefit from screening, especially as recently some promising results have indicated that non-invasive tests for pancreatic cancer may soon be available.\n\nIt is known that patients who develop pancreatic cancer consult their general practitioner (GP) with non-specific symptoms such as gastrointestinal problems or back pain more frequently in the months and years prior to diagnosis compared with their peers who do not develop pancreatic cancer. Individually, these symptoms are unlikely to trigger further investigations for cancer. Researchers came up with the idea that AI could find a combination of these non-specific symptoms that is linked with higher risk of contracting the disease, which would be difficult to spot by GPs.\n\nThis preliminary study used electronic health records from GP practices in the UK. (3) The analysis included 1,378 patients aged 15-99 years diagnosed with pancreatic cancer in 2005 to 2010. Each patient was matched by age and sex to four people who did not get pancreatic cancer. Information on symptoms, diseases, and medications in the two years prior to diagnosis were used to create a model predicting who would develop pancreatic cancer. \"We used AI to study a large volume of data and look for combinations that predict who will develop pancreatic cancer,\" said study author Dr. Ananya Malhotra, research fellow in statistics, London School of Hygiene & Tropical Medicine, London, UK. \"It's not possible for the human eye to recognise these trends in such large amounts of data.\"\n\nThe pilot study found that in people under 60 years of age, the model could predict who was at higher risk of pancreatic cancer up to 20 months before diagnosis. \"Our model has estimated that around 1,500 tests need to be performed to save one life from pancreatic cancer,\" explained Malhotra. \"This is unlikely to be small enough to make screening viable just yet. However, it shows that AI holds potential to narrow down the number of people we need to screen. We should be able to reduce this quite a lot further by matching pancreatic cancer patients to controls from the general population, which is what we plan to do next (in the current study, the controls had other types of cancer).\"\n\n\"Pairing this predictive model with a non-invasive screening test, followed by scans and biopsies, could lead to earlier diagnosis for a significant proportion of patients and a greater number of patients surviving this cancer,\" added Malhotra.\n\nUsing AI to identify people at high-risk of pancreatic cancer up to 20 months earlier could make the difference between life and death. \"This should be enough time to screen for pancreatic cancer, then proceed with diagnosis and treatment in patients with a positive screening test,\" said Dr. Angela Lamarca, consultant in medical oncology, The Christie NHS Foundation Trust, Manchester, UK. \"Early diagnosis in pancreatic cancer gives the highest chance of cure.\"\n\nAccording to Lamarca, GPs could use this type of AI model on their medical records to highlight patients at higher risk. An alarm could be raised showing who should receive screening. She said: \"We need bigger studies incorporating AI tools into daily clinical practice and exploring the benefit of screening the patients selected by AI. More research is also needed to find a good screening test for these high-risk patients.\"\n\n###\n\nNotes to Editors\n\nPlease make sure to use the official name of the meeting in your reports: ESMO World Congress on Gastrointestinal Cancer?\n\nOfficial Congress Hashtag: #WorldGI2020\n\nDisclaimer\n\nThis press release contains information provided by the author of the highlighted abstract and reflects the content of this abstract. It does not necessarily reflect the views or opinions of ESMO who cannot be held responsible for the accuracy of the data. Commentators quoted in the press release are required to comply with the ESMO Declaration of Interests policy and the ESMO Code of Conduct.\n\nReferences\n\n1 Abstract -SO-13 'Can we screen for pancreatic cancer? Identifying a sub-population of patients at high risk of subsequent diagnosis using machine learning techniques applied to primary care data' will be presented by A. Malhotra during Session V: Molecular Screening; Imaging; Artificial Intelligence on Thursday, 2 July 2020, 18:50 to 20:21 (CEST). Annals of Oncology: doi.org/10.1016/j.annonc.2020.04.028\n\n2 ESMO World Congress on Gastrointestinal Cancer https://www.worldgicancer.com/\n\n3 This study was funded by the Pancreatic Cancer Research Fund\n\nAbout the European Society for Medical Oncology (ESMO)\n\nESMO is the leading professional organisation for medical oncology. With more than 25,000 members representing oncology professionals from over 160 countries worldwide, ESMO is the society of reference for oncology education and information. ESMO is committed to offer the best care to people with cancer, through fostering integrated cancer care, supporting oncologists in their professional development, and advocating for sustainable cancer care worldwide. Visit http://www.esmo.org\n\nAbout the ESMO World Congress on Gastrointestinal Cancer\n\nThe ESMO World Congress on Gastrointestinal Cancer represents the year's most important gathering designed to focus on reversing the current global statistics that rank gastrointestinal malignancies as the leading causes of cancer deaths worldwide.\n\nSO-13 - Can we screen for pancreatic cancer? Identifying a sub-population of patients at high risk of subsequent diagnosis using machine learning techniques applied to primary care data\n\nA. Malhotra1, B. Rachet1, A. Bonaventure2, S. Pereira3, L. Woods1\n\n1London School of Hygiene and Tropical Medicine, London, United Kingdom; 2CRESS, University of Paris, Paris, France; 3UCL Institute for Liver and Digestive Health, London, United Kingdom\n\nBackground: Ninety-four percent of pancreatic cancer patients die within 5 years of their diagnosis. Most patients experience no obvious symptoms until the tumour is well advanced. It is now possible, via a blood test, to detect pancreatic cancer before symptoms of late-stage disease are evident. However, in order to be cost-effective, this test should only be applied to a limited group of individuals.\n\nMethods: We conducted a national, population-based, case-control study to deter-mine whether it is possible to identify a sub-population of patients at high risk of developing pancreatic cancer. Our hypothesis was that patients with early malignancy share similar profiles of early, diffuse, warning signs which might be detectable through the application of machine learning approaches. We used the Clinical Practice Research Datalink (CPRD), linked to the national cancer registrations. Our cases comprised of 1,378 patients, aged 15-99 years, diagnosed with pancreatic cancer between 1 January 2005 and 31 December 2010. Each case was individually age- and diagnosis time-matched to four non-pancreatic (cancer) controls. Disease, symptom and prescription codes for the 24 months prior to diagnosis were used to define 58 individual symptoms. Using a machine learning approach, we fitted logistic regression and random forest models. These models were trained on 75% of the data and tested on the remaining 25%.\n\nResults: Preliminary results show that diagnosis could be accurately predicted for 60%of the patients below the age of 60 using their medical history recorded between 20-24 months before diagnosis with an AUC of 61%, sensitivity of 76% and a specificity of 45%.\n\nConclusion: A sub-population of patients later diagnosed with pancreatic cancer is detectable up to 20 months before diagnosis. Further work should test the performance of the model for longer time periods as well as its effectiveness in a population-based setting. These data suggest that early detection of pancreatic cancer is possible. Pairing this predictive model with a screening test could lead to earlier diagnosis and a greater number of patients surviving this devastating disease.\n\nLegal entity responsible for the study: The authors.\n\nFunding: Pancreatic Cancer Research Fund.\n\nDisclosure: The presenting author has declared no conflicts of interest.\n\nDisclaimer: AAAS and EurekAlert! are not responsible for the accuracy of news releases posted to EurekAlert! by contributing institutions or for the use of any information through the EurekAlert system.\n\nSHARE\n PRINT E-MAIL\n\nMedia Contact\n\nESMO Press Office\nmedia@esmo.org\n\n @myesmo\n\nhttp://www.esmo.org \n\nMore on this News Release\nArtificial intelligence brings pancreatic cancer screening one step closer to reality\n\nEUROPEAN SOCIETY FOR MEDICAL ONCOLOGY\n\nJOURNAL\nAnnals of Oncology\nMEETING\nESMO World Congress on Gastrointestinal Cancer 2020\nKEYWORDS\nCANCER\nCLINICAL TRIALS\nHEALTH CARE SYSTEMS/SERVICES\nHEALTH PROFESSIONALS\nMEDICAL EDUCATION\nMEDICINE/HEALTH\nPUBLIC HEALTH\nMULTIMEDIA\nDr. Ananya Malhotra (IMAGE)\nview MORE \nRELATED JOURNAL ARTICLE\nhttp://dx.doi.org/10.1016/j.annonc.2020.04.028\nMore in Medicine & Health\nProtective antibodies identified for rare, polio-like disease in children\nPURDUE UNIVERSITY\nNovel biomarker discovery could lead to early diagnosis for deadly preeclampsia\nUNIVERSITY OF TECHNOLOGY SYDNEY\nMorning exercise is the key to a good night's sleep after heart bypass surgery\nEUROPEAN SOCIETY OF CARDIOLOGY\nSurge in domestic child abuse during pandemic, reports specialist UK children's hospital\nBMJ\nView all in Medicine & Health \nTrending News Releases\nRadar points to moon being more metallic than researchers thought\nNASA/GODDARD SPACE FLIGHT CENTER\nFeeds of the future\nUNIVERSITY OF GÖTTINGEN\nEven in the worst COVID-19 cases, the body launches immune cells to fight back\nLA JOLLA INSTITUTE FOR IMMUNOLOGY\nHistoric floods reveal how salt marshes can save lives in the future\nROYAL NETHERLANDS INSTITUTE FOR SEA RESEARCH\nView all latest news releases \n\nCopyright © 2020 by the American Association for the Advancement of Science (AAAS)\n\nLatest News Releases RSS Feed\nAll EurekAlert! RSS Feeds\n@EurekAlert\nfacebook.com/EurekAlert\nHelp / FAQ\nDisclaimer\nPrivacy Policy\nTerms & Conditions\nContact EurekAlert!", "images": ["https://www.eurekalert.org/images/e4/logo-2x.png", "https://www.eurekalert.org/images/e4/brand.png", "https://www.eurekalert.org/images/meganav/browse-images.jpg", "https://www.eurekalert.org/images/meganav/browse-video.jpg", "https://www.eurekalert.org/images/meganav/browse-audio.jpg", "https://media.eurekalert.org/meganav/SfNMenuBanner2019.jpg", "https://media.eurekalert.org/meganav/EurekAlert_AM20.png", "https://www.eurekalert.org/images/meganav/portal-climate-new.png", "https://www.eurekalert.org/images/meganav/portal-cancer-new.png", "https://www.eurekalert.org/images/meganav/portal-marine-new.png", "https://media.eurekalert.org/meganav/AAAS-logo.png", "https://media.eurekalert.org/multimedia_prod/pub/web/235950_web.jpg", "https://media.eurekalert.org/multimedia_prod/pub/rel/235950_rel.jpg", "https://www.eurekalert.org/images/e4/logo-footer.png"], "id": "89310c1d7f7412683573de02891060e4", "day": "2020-07-02", "is_new": true}, {"img": "https://images.deepai.org/news-links/2808fc0406ac4fadb238aad6bb36d8e8/trump-administration-hires-tech-firm-to-build-a-virt.jpg", "title": "Trump administration hires tech firm to build a virtual border wall, an idea Democrats have praised", "url": "https://deepai.org/posts/trump-administration-hires-tech-firm-to-build-a-virtual-border-wall-an-idea-democrats-have-praised", "date": 1593676765.0, "origin_url": "https://www.washingtonpost.com/immigration/trump-virtual-border-wall/2020/07/02/7b380490-b0ac-11ea-a567-6172530208bd_story.html", "zh": "特朗普政府雇佣科技公司建造一道虚拟的边境墙，民主党人对此表示赞赏", "is_can_visited": true, "text": "", "images": [], "id": "0e5f48166be2b4898b38ccfe90f2f517", "day": "2020-07-02", "is_new": true}, {"img": "https://images.deepai.org/news-links/36acdd9609394e93a77cf4354e857d36/how-ai-is-impacting-operations-at-linkedin-thumb.jpg", "title": "How AI Is Impacting Operations At LinkedIn", "url": "https://deepai.org/posts/how-ai-is-impacting-operations-at-linkedin", "date": 1593669054.0, "origin_url": "https://www.forbes.com/sites/cognitiveworld/2020/07/02/how-ai-is-impacting-operations-at-linkedin/", "zh": "人工智能如何影响LinkedIn的运营", "is_can_visited": true, "text": "next-hop.forbes.com | Access denied (403)\nCurrent session has been terminated.\n\nFor further information, do not hesitate to contact us.\n\nRef: 183.195.79.46 2020-07-04T04:04:33.700Z", "images": [], "id": "a6a3c43d2ba2fd0b0fa3b7f1b2918475", "day": "2020-07-02", "is_new": true}, {"img": "https://images.deepai.org/news-links/98c69d7180a34c7899ce4f15342ff542/where-insights-meet-privacy-privacy-preserving-machi.jpg", "title": "Where Insights Meet Privacy: Privacy-Preserving Machine Learning", "url": "https://deepai.org/posts/where-insights-meet-privacy-privacy-preserving-machine-learning", "date": 1593662400.0, "origin_url": "https://www.forbes.com/sites/forbestechcouncil/2020/07/02/where-insights-meet-privacy-privacy-preserving-machine-learning/", "zh": "洞察与隐私相遇：隐私保护机器学习", "is_can_visited": true, "text": "next-hop.forbes.com | Access denied (403)\nCurrent session has been terminated.\n\nFor further information, do not hesitate to contact us.\n\nRef: 183.195.79.46 2020-07-04T04:04:35.118Z", "images": [], "id": "148e50de44b6287d11bf64bbec7705a4", "day": "2020-07-02", "is_new": true}, {"img": "https://images.deepai.org/news-links/5a3c45ad09ba4e6c8aeb91ed236d98b6/lemonade-ipo-shows-the-power-of-ai-artificial-intell.jpg", "title": "Lemonade IPO Shows The Power Of AI (Artificial Intelligence)", "url": "https://deepai.org/posts/lemonade-ipo-shows-the-power-of-ai-artificial-intelligence", "date": 1593764325.0, "origin_url": "https://www.forbes.com/sites/tomtaulli/2020/07/03/lemonade-ipo-shows-the-power-of-ai-artificial-intelligence/", "zh": "柠檬水IPO显示人工智能的力量", "is_can_visited": true, "text": "Jul 3, 2020,12:22pm EDT\nLemonade IPO Shows The Power Of AI (Artificial Intelligence)\nTom TaulliContributor\nEntrepreneurs\nI write about tech & finance.\n\nBusiness woman showing insurance document over white desk at office\n\nGETTY\n\nAfter a hiatus because of the COVID-19 pandemic, the IPO market has come roaring back. Just look at yesterday’s offering for Lemonade (NYSE:LMND). The shares spiked by 139% to $69.41—putting the market cap at over $3 billion.\n\nPart of the success has been the overall bullishness in the equities markets. But there is something else that is important: Lemonade is a next-generation AI company. The technology is all-pervasive across its operations.\n\nThe AI Foundation\n\nKeep in mind that the insurance industry was actually the first industry that was data driven. The roots go back to 1662 when John Graunt helped to create modern statistics, which he used to calculate the probabilities for life expectancies for those living in London. The framework would lead to the creation of Lloyd's of London.\n\nThe result is that the insurance industry has turned into one of the most valuable the world has ever seen. As of today, property, casualty and life premiums represent a whopping $5 trillion and account for 11% of the GDP in the US. \n\nMost Popular In: Entrepreneurs\nThis Common Practice Is Killing Small Businesses\nWhy Every Small Business Should Consider A Bounce Back Loan\nBritain’s Fastest Growing Start-Ups Identified\n\nYet the insurance industry has lagged with AI, as the legacy IT systems have been a burden. So yes, Lemonade’s founders saw this as a huge opportunity. \n\nHere’s what the company has built:\n\nAI Maya: This is an engaging virtual assistant that collects information, provides quotes and handles the payments. \nAI Jim: This is the claims bot. For the most part, he has been able to handle roughly a third of the cases. But even when a case is passed along to a human, the claim is generally much easier to work out because AI Jim has already done quite a bit of work on the matter. \nCX.AI: This is the bot that answers customer questions. \n\n“Lemonade’s revolutionary model has completely changed the way we think about an antiquated industry,” said Nick Liuzza, who is the CEO and co-founder of Beeline. “By implementing artificial intelligence and machine learning directly into its model, the company can keep its costs low and bring savings back to the customer—and this result rings true across many industries.”\n\nMore Than About AI\n\nLemonade also has built something called the Forensic Graph, which uses AI and behavioral economics to predict, detect and block fraud. So far, the company has avoided millions in potential losses. \n\n“In the case of Lemonade, we’d expect the company’s loss ratio and customer acquisition cost to be superior to legacy insurance carriers as a result of its AI technology,” said Nima Wedlake, who is a Principal at Thomvest Ventures. “To date, that isn’t the case, though. For example, its loss ratio in Q1 2020 was about 80% vs. about a 50% industry average. However, Lemonade is still in its early days and I expect its unit economics to improve as the company scales. If Lemonade can prove that it is more effective at underwriting risk using AI vs. legacy approaches, I expect more carriers to adopt similar approaches. Many are already leveraging AI or ML as part of the underwriting process.”\n\nYet there are skeptics. In other words, AI may be more hype than substance.\n\n“At best AI could only help the company improve its actuarially ability, not see into the future and predict loss, which is of course, by definition, unknowable,” said Kristopher Marsh, who is the editor of Discoverdando.com. “Otherwise there would be no need for insurance in the first instance. On the claims side, there may be some ability to automate payments, but this comes at the cost of leakage without human oversight. If the company can process information to an above average quality, there may be a slight pricing advantage. Otherwise, their true advantage lies is in being able to operate without high labor overhead—particularly in underwriting.”\n\nRegardless, Lemonade does show that an immersive digital approach can be effective with customers. Besides, when it comes to AI, there continue to be many breakthroughs. The industry is still in the nascent stages.\n\n“Lemonade’s successful IPO is about a new generation of digital insurance carriers coming to market and giving insurance incumbents, handicapped by technology constraints, a run for their money,” said Michael Yang, who is the Managing Partner at OMERS Ventures. “Lemonade is leveraging new consumer interactions and creating data sets that allow it to offer the right product to the right person on the right proportional risk basis that the incumbents can’t. Whether that’s through AI or not, or alternatively, through a pretty user experience or not, is less the material point. It’s that Lemonade eschews the traditional broker and agent channel and has a direct relationship with the insured, which affords it more flexibility to innovate.”\n\nTom (@ttaulli) is an advisor to startups and the author of Artificial Intelligence Basics: A Non-Technical Introduction and The Robotic Process Automation Handbook: A Guide to Implementing RPA Systems. He also has developed various online courses, such as for the Python programming language.\n\nFollow me on Twitter or LinkedIn. Check out my website or some of my other work here. \nTom Taulli\n\nTom (@ttaulli) is the author of Artificial Intelligence Basics: A Non-Technical Introduction ( https://amzn.to/2InAZeT) and The Robotic Process Automation Handbook: A\n\n…\n\n Read More\nSite Feedback\nTips\nCorrections\nReprints & Permissions\nTerms\nPrivacy\n© 2020 Forbes Media LLC. All Rights Reserved.\nAdChoices", "images": ["https://secure.gravatar.com/avatar/bf17adbab556ac58443073773992ce3b?s=400&d=mm&r=g", "https://specials-images.forbesimg.com/imageserve/5eff578f9756420007f6f6b9/960x0.jpg?fit=scale", "https://contextual.media.net/px.gif?&ch=1&vn=1", "https://s.mnet-ad.net/px.gif?&ch=2&vn=1", "https://c.aaxads.com/pxusr.gif?&type=1&vn=1", "https://www.aaxdetect.com/pxext.gif?&type=2&vn=1"], "id": "a943d9da94f1a07d74ccc6c4a4091ca7", "day": "2020-07-03", "is_new": true}]