[{"img": "https://images.deepai.org/news-links/1f4bb3172fa84596ad41c0aa575ce16c/what-cafe-x-and-zume-can-teach-us-about-robots-in-re.jpg", "title": "What Café X And Zume Can Teach Us About Robots In Restaurants", "url": "https://deepai.org/posts/what-cafe-x-and-zume-can-teach-us-about-robots-in-restaurants", "date": 1593746775.0, "origin_url": "https://www.forbes.com/sites/forbestechcouncil/2020/07/03/what-caf-x-and-zume-can-teach-us-about-robots-in-restaurants/", "zh": "CaféX和Zume能教我们餐馆里的机器人吗", "is_can_visited": false, "text": null, "images": null, "id": "80569730ac830a86c4bf85c5482a352e", "day": "2020-07-03", "is_new": true}, {"img": "https://images.deepai.org/news-links/4fbab519572f44678c02159ba448684f/ai-50-america-s-most-promising-artificial-intelligen.jpg", "title": "AI 50: America's Most Promising Artificial Intelligence Companies", "url": "https://deepai.org/posts/ai-50-america-s-most-promising-artificial-intelligence-companies", "date": 1593744750.0, "origin_url": "https://www.forbes.com/sites/alanohnsman/2020/07/03/ai-50-americas-most-promising-artificial-intelligence-companies/", "zh": "美国最有前途的人工智能公司", "is_can_visited": false, "text": null, "images": null, "id": "86ef6788ec5d55c321108ee4738ab8f6", "day": "2020-07-03", "is_new": true}, {"img": "https://images.deepai.org/news-links/c0ddb4f993fc41c5a5c755f82abe9d3f/nec-and-japanese-research-agency-to-use-ai-for-autom.jpg", "title": "NEC and Japanese research agency to use AI for automatic plastic waste detection", "url": "https://deepai.org/posts/nec-and-japanese-research-agency-to-use-ai-for-automatic-plastic-waste-detection", "date": 1593725850.0, "origin_url": "https://www.zdnet.com/article/nec-and-japanese-research-agency-to-use-ai-for-automatic-microplastic-detection/", "zh": "NEC和日本研究机构将使用人工智能进行塑料垃圾自动检测", "is_can_visited": true, "text": "\t\n\t\nMENU\n\t\nAS\nNEC and Japanese research agency to use AI for automatic plastic waste detection\n\nThe system will be used to help determine the impact microplastics have on marine life.\n\nBy Aimee Chanthadavong | July 3, 2020 -- 05:42 GMT (13:42 GMT+08:00) | Topic: Innovation\n\nNEC and the Japan Agency Marine-Earth Science and Technology (JAMSTEC) have developed a system that uses artificial intelligence (AI) imaging recognition techniques to automatically detect microplastics from seawater and sediment samples.\n\nThe system, according to NEC, has been developed using its Rapid machine learning technology in combination with JAMESTEC's method for staining microplastics using fluorescent dyes in samples, before capturing videos of the dyed microplastics.\n\nThe software then automatically extracts image data for each microplastic that appears in the video and uses AI recognition technology to sort microplastics based on sizes and shapes at a processing speed of 60 per minute, NEC said.\n\nThe Japanese conglomerate touted the new system could improve the current method that is used to analyse microplastics to determine the impact plastic waste has on marine life.\n\nTypically, the process of analysing microplastics involves scooping seawater and sediment with a fine mesh, before using a microscope to pick and analyse each microplastic manually to determine the number, size, and types that exist in the ocean.\n\n\"It is expected that by establishing and popularising this measurement method, and by clarifying the actual situation of microplastic pollution, we will be able to contribute to the formulation of appropriate emission regulations,\" JAMSTEC marine plastics research deputy group leader Masashi Tsuchiya.\n\nRecently, the Commonwealth Scientific and Industrial Research Organisation (CSIRO) inked a partnership with Microsoft to look at how AI could be used to tackle plastic waste, as well as illegal fishing, and how it can help boost farming.\n\nBy collecting data about the spread and concentration of plastic, CSIRO is using AI and ML to analyse where the plastic might end up and also what steps can be taken on land to reduce the likelihood of plastic entering waterways and oceans.  \n\n\"Reverse vending machines\", where the public can recycle bottles and cans in return for a fee, is also on the list for exploration.  \n\nRELATED COVERAGE\nDrones and AI making a dent in Kakadu's war against weeds \nSmart coral reefs: This underwater, fish-spotting AI helps protect the rainforest of the sea\nResearchers claim industrial underwater robots can help with ocean discoveries\nMicrosoft backs six Aussie environment-focused AI projects \nHow AI and drones are trying to save the Great Barrier Reef (TechRepublic)  \nRELATED TOPICS: JAPAN CXO DIGITAL TRANSFORMATION TECH INDUSTRYSMART CITIES CLOUD\n\nBy Aimee Chanthadavong | July 3, 2020 -- 05:42 GMT (13:42 GMT+08:00) | Topic: Innovation\n\nSHOW COMMENTS\nMORE FROM AIMEE CHANTHADAVONG\n\nTech Industry\n\nUN reports global e-waste production soared beyond 53 million tonnes in 2019\n\nDigital Transformation\n\nNational Library of Australia brings 10-year-old Trove research portal into the 21st century\n\nRobotics\n\nSingapore hospital disinfects patient rooms using Xenex Lightstrike robots\n\nData Centers\n\nLeading Edge Data Centres puts AU$20 million towards Newcastle data centre campus\n\nNEWSLETTERS\nRELATED STORIES\n1 of 3\n\nWhen Apple moves Mac to Arm, is it time for Mac users to move to Windows?\n\nIt seems like an obvious question since new machines will have to be purchased. But the prevailing Facebook opinion is that it all depends on your apps. We take a deep dive. Come on in. ...\n\nTalking rubbish: How smart bins are helping one city understand the impact of lockdown\n\nOne city council has 30 smart bins spread out around the city, and they are coming in even more handy than previously thought.\n\nBMW explores in-car subscriptions for smart, connected services\n\nThe automaker is set to offer optional upgrades for smart vehicle owners in a bid to generate recurring revenue.\n\nZDNet\nCONNECT WITH US\n\n© 2020 CBS Interactive. All rights reserved. Privacy Policy | Cookies | Ad Choice | Advertise | Terms of Use | Mobile User Agreement\n\nVisit other CBS Interactive sites:\nSelect Site\nCBS Cares\nCBS Films\nCBS Radio\nCBS.com\nCBSInteractive\nCBSNews.com\nCBSSports.com\nChowhound\nCNET\nCollege Networks\nGameSpot\nLast.fm\nMaxPreps\nMetacritic.com\nMoneywatch\nmySimon\nSearch.com\nShowtime\nTechRepublic\nThe Insider\nTV.com\nUrbanBaby.com\nZDNet\nTopics\nGalleries\nVideos\nSponsored Narratives\nCA Privacy/Info We Collect\nCA Do Not Sell My Info\nNewsletters\nSite Assistance\nZDNet Academy\nTechRepublic Forums", "images": ["https://zdnet3.cbsistatic.com/hub/i/r/2014/02/17/fc9a5bf1-1174-11e4-9732-00505685119a/thumbnail/40x40/0cbfd49d5606aa5536ed8914168d4ec1/aimee-chanthadavong.jpg", "https://www.zdnet.com/article/nec-and-japanese-research-agency-to-use-ai-for-automatic-microplastic-detection/"], "id": "295eea1707eab152ad96d6617e5ccbb9", "day": "2020-07-03", "is_new": true}, {"img": "https://images.deepai.org/news-links/1b81ac5458fc469bb217806bc4013749/artificial-feathers-let-this-robotic-bird-fly-with-i.jpg", "title": "Artificial Feathers Let This Robotic Bird Fly With Incredible Agility", "url": "https://deepai.org/posts/artificial-feathers-let-this-robotic-bird-fly-with-incredible-agility", "date": 1593766350.0, "origin_url": "https://gizmodo.com/artificial-feathers-let-this-robotic-bird-fly-with-incr-1844254186", "zh": "人造羽毛让这只机器鸟以不可思议的敏捷飞行", "is_can_visited": false, "text": null, "images": [], "id": "8bfa830ba6159d2fa7c8e4b7657be35c", "day": "2020-07-03", "is_new": true}, {"img": "https://images.deepai.org/news-links/5a3c45ad09ba4e6c8aeb91ed236d98b6/lemonade-ipo-shows-the-power-of-ai-artificial-intell.jpg", "title": "Lemonade IPO Shows The Power Of AI (Artificial Intelligence)", "url": "https://deepai.org/posts/lemonade-ipo-shows-the-power-of-ai-artificial-intelligence", "date": 1593764325.0, "origin_url": "https://www.forbes.com/sites/tomtaulli/2020/07/03/lemonade-ipo-shows-the-power-of-ai-artificial-intelligence/", "zh": "柠檬水IPO显示人工智能的力量", "is_can_visited": true, "text": "Jul 3, 2020,12:22pm EDT\nLemonade IPO Shows The Power Of AI (Artificial Intelligence)\nTom TaulliContributor\nEntrepreneurs\nI write about tech & finance.\n\nBusiness woman showing insurance document over white desk at office\n\nGETTY\n\nAfter a hiatus because of the COVID-19 pandemic, the IPO market has come roaring back. Just look at yesterday’s offering for Lemonade (NYSE:LMND). The shares spiked by 139% to $69.41—putting the market cap at over $3 billion.\n\nPart of the success has been the overall bullishness in the equities markets. But there is something else that is important: Lemonade is a next-generation AI company. The technology is all-pervasive across its operations.\n\nThe AI Foundation\n\nKeep in mind that the insurance industry was actually the first industry that was data driven. The roots go back to 1662 when John Graunt helped to create modern statistics, which he used to calculate the probabilities for life expectancies for those living in London. The framework would lead to the creation of Lloyd's of London.\n\nThe result is that the insurance industry has turned into one of the most valuable the world has ever seen. As of today, property, casualty and life premiums represent a whopping $5 trillion and account for 11% of the GDP in the US. \n\nMost Popular In: Entrepreneurs\nThis Common Practice Is Killing Small Businesses\nWhy Every Small Business Should Consider A Bounce Back Loan\nBritain’s Fastest Growing Start-Ups Identified\n\nYet the insurance industry has lagged with AI, as the legacy IT systems have been a burden. So yes, Lemonade’s founders saw this as a huge opportunity. \n\nHere’s what the company has built:\n\nAI Maya: This is an engaging virtual assistant that collects information, provides quotes and handles the payments. \nAI Jim: This is the claims bot. For the most part, he has been able to handle roughly a third of the cases. But even when a case is passed along to a human, the claim is generally much easier to work out because AI Jim has already done quite a bit of work on the matter. \nCX.AI: This is the bot that answers customer questions. \n\n“Lemonade’s revolutionary model has completely changed the way we think about an antiquated industry,” said Nick Liuzza, who is the CEO and co-founder of Beeline. “By implementing artificial intelligence and machine learning directly into its model, the company can keep its costs low and bring savings back to the customer—and this result rings true across many industries.”\n\nMore Than About AI\n\nLemonade also has built something called the Forensic Graph, which uses AI and behavioral economics to predict, detect and block fraud. So far, the company has avoided millions in potential losses. \n\n“In the case of Lemonade, we’d expect the company’s loss ratio and customer acquisition cost to be superior to legacy insurance carriers as a result of its AI technology,” said Nima Wedlake, who is a Principal at Thomvest Ventures. “To date, that isn’t the case, though. For example, its loss ratio in Q1 2020 was about 80% vs. about a 50% industry average. However, Lemonade is still in its early days and I expect its unit economics to improve as the company scales. If Lemonade can prove that it is more effective at underwriting risk using AI vs. legacy approaches, I expect more carriers to adopt similar approaches. Many are already leveraging AI or ML as part of the underwriting process.”\n\nYet there are skeptics. In other words, AI may be more hype than substance.\n\n“At best AI could only help the company improve its actuarially ability, not see into the future and predict loss, which is of course, by definition, unknowable,” said Kristopher Marsh, who is the editor of Discoverdando.com. “Otherwise there would be no need for insurance in the first instance. On the claims side, there may be some ability to automate payments, but this comes at the cost of leakage without human oversight. If the company can process information to an above average quality, there may be a slight pricing advantage. Otherwise, their true advantage lies is in being able to operate without high labor overhead—particularly in underwriting.”\n\nRegardless, Lemonade does show that an immersive digital approach can be effective with customers. Besides, when it comes to AI, there continue to be many breakthroughs. The industry is still in the nascent stages.\n\n“Lemonade’s successful IPO is about a new generation of digital insurance carriers coming to market and giving insurance incumbents, handicapped by technology constraints, a run for their money,” said Michael Yang, who is the Managing Partner at OMERS Ventures. “Lemonade is leveraging new consumer interactions and creating data sets that allow it to offer the right product to the right person on the right proportional risk basis that the incumbents can’t. Whether that’s through AI or not, or alternatively, through a pretty user experience or not, is less the material point. It’s that Lemonade eschews the traditional broker and agent channel and has a direct relationship with the insured, which affords it more flexibility to innovate.”\n\nTom (@ttaulli) is an advisor to startups and the author of Artificial Intelligence Basics: A Non-Technical Introduction and The Robotic Process Automation Handbook: A Guide to Implementing RPA Systems. He also has developed various online courses, such as for the Python programming language.\n\nFollow me on Twitter or LinkedIn. Check out my website or some of my other work here. \nTom Taulli\n\nTom (@ttaulli) is the author of Artificial Intelligence Basics: A Non-Technical Introduction ( https://amzn.to/2InAZeT) and The Robotic Process Automation Handbook: A\n\n…\n\n Read More\nSite Feedback\nTips\nCorrections\nReprints & Permissions\nTerms\nPrivacy\n© 2020 Forbes Media LLC. All Rights Reserved.\nAdChoices", "images": ["https://secure.gravatar.com/avatar/bf17adbab556ac58443073773992ce3b?s=400&d=mm&r=g", "https://specials-images.forbesimg.com/imageserve/5eff578f9756420007f6f6b9/960x0.jpg?fit=scale", "https://contextual.media.net/px.gif?&ch=1&vn=1", "https://s.mnet-ad.net/px.gif?&ch=2&vn=1", "https://c.aaxads.com/pxusr.gif?&type=1&vn=1", "https://www.aaxdetect.com/pxext.gif?&type=2&vn=1"], "id": "a943d9da94f1a07d74ccc6c4a4091ca7", "day": "2020-07-03", "is_new": true}]