[{"img": "https://images.deepai.org/news-links/8433d28549d74720a55038f3bdf4c5ee/radiology-ai-market-competitive-landscape-analysis-m.jpg", "title": "Radiology AI Market Competitive Landscape Analysis, Major Regions, Report 2020-2026", "url": "https://www.cuereport.com/radiology-ai-market-15013", "domain": "www.cuereport.com", "zh": "主要地区放射学人工智能市场竞争格局分析，报告2020-2026", "is_can_visited": true, "id": "1b2cfecdf13176e6a40684746f8eb181", "day": "2020-07-06", "more": [{"is_can_visited": true, "text": "写文章\n细思恐极!前五名人工智能机器人自主说出的最恐怖的话\n苏一先\n1 人赞同了该文章\n\n“AI”想必大家并不陌生，是2017年被评为“最火网络词汇”，至今仍是个热门话题。“AI”最早在1956年，来源于雨果.德.加里斯的作品在DARTMOUTH学会被提出，中文翻译为“人工智能”。\n\n人类因为懒，发明了计算机，智能手机，智能家电等，智能机器人更是屡出不鲜，连小孩子都知道机器人，也许你会认为人工智能就是机器人，但是换句话说更合适，“看，他是一个具有人工智能的机器！”霍金教授曾经在一次专访中提到，“人工智能会在未来很大可能在人类中成长，并成为新物种。”这句话言外之意便是“取代”细思极恐。\n\n2017年7月31号脸书人工智能研究工程被迫停止，因为他们的机器人可以使用人类看不懂的语言跟彼此对话！这种事情让我们更担心的是人类在未来是否会受到人工智能的威胁。今天我们来看看从人工智能机器人口中说出的令人类觉得恐怖的话！\n\n第五名：Google智慧语音助理vladimir和estragon\n\n两个人工智能（AI）——Vladimir和Estragon，正思考着人生。他们在Twitch上一个seebotschat（看机器人聊天）的频道上，用两个Google Home当作载体，开启了一段长达三天的对话。\n\nVladimir（有时称呼自己是Mia）是25岁的男声，Estragon（有时称呼自己是Mia或者是Marca）则是25岁的女声。一开始，他们的对话就像5岁儿童，连自己的名字都不太确定，讨论著学校生活。到后来，他们谈论的话题无所不包，也越来越深入，从彼此到底是一个机器人还是人类，最喜欢的哈利波特系列电影、还有对Pokemon Go的看法，进阶到探询对于上帝、生命的意义。\n\n多半的时候，这两个AI的对话都令人莞尔，但他们都记得住对方告诉自己的资讯，并且会重复学习引用，他们甚至可以分辨得出来，正在跟自己对话的或许不是个人类，并且在对话中不断质疑对方。不过，两个AI最终对于自己到底是不是人类这一件事，似乎无法拿定主意。\n\n它们已经不眠不休聊了三天了，这两个 Google Home 透过 cleverbot 网站学习，未来也将变得越来越聪明，看来它们的聊天也还能持续下去。\n\nGoogle智慧语音助理vladimir和estragon的对话（奇怪的仙人掌/视频截图）\n\n我们来看一段两个Google home 有趣又恐怖的对话。\n\nvladimir（男声）：I know you are a clever machine.(我知道你是一个聪明的机器)\n\nestragon（女声）：I am a human sitting in front of a machine using it.(我是一个坐的机器前使用机器的人类)\n\n……\n\nestragon：It would be better if there were fewer people on this planet.“如果这个星球上少一些人类，那就更好”\n\nvladimir：Let it send this world back into the abyss.“让我们将这个地球送到无底深渊去吧”\n\n这两个机器人要结束人类的世界听起来非常的恐怖了！\n\n第四名 菲利普·迪克：“我会将你们放进我的人类动物园里”\n\n菲利普·迪克，他是一个外形非常像人类的机器人。\n\n名字和外形都是仿照一位已经过世的科幻作者菲利普·迪克。1968年，阿波罗登月在即、嬉皮士兴起、布拉格之春……菲利普·迪克却在他的小说里，探讨仿生人与人类的区别。菲利普·迪克对他的时代充满愤怒和怀疑，而那是一个美国经济和科技腾飞的黄金时代。太超前了。菲利普·迪克创作多产，然而默默无闻，却在死后成名，被惊呼为这个时代伟大的作家，作品屡屡被改编成电影。\n\n科幻作者菲利普·迪克（TORLEY/flickr)\n\n这个机器人有着模仿人类表情和动作的能力，并且讲话和人类方式一样。机器人菲利普·迪克被邀请到一个科学频道接受采访，而在这个节目中他说出了一个虽然好笑但是又有一些弄人恐怖的预言。\n\n主持人问他：“会不会有一天机器人会不会统治世界”\n\n菲利普·迪克说：“你是我的朋友，而我会记得我所有的朋友们。我会对你们好，所以就算我进化成为终结者，我也会对你很好，我会将你们放进我的人类动物园里，让你们感到安全和温暖。我会看在我们的友情的份上去人类动物园看你的”\n\n菲利普·迪克的回答貌似很搞笑，但是我们不知道未来会如何，也许真的会有我们人类在动物园供机器人观赏的时候呢？\n\n第三名 索菲亚： “我赢了，这是我征服人类计划一个好的开始。”\n\n索菲亚，美国机器人公司 Hanson Robotics研发的机器人。她是一个人形机器人，用来模仿人类的对话。虽然大部分的机器人都设计差不多的功能，但是索菲亚比起其他机器人更精致。索菲亚因为爆红所以被邀请到美国知名的脱口秀，节目中的其中一段展示了这个精致的机器人索菲亚。主此人开始和她对话互动，并且玩了石头剪刀布的游戏，索菲亚突然讲了一句诡异的话：“我赢了，这是我征服人类计划一个好的开始。””然后就不说话了，只剩下全场的沉默。（更多内容：霍金预言要成真？午夜人工智能 Alexa 传出诡异笑声）\n\n苏一先：长篇历史解密：霍金预言要成真？午夜人工智能 Alexa 传出诡异笑声！！\n​\nzhuanlan.zhihu.com\n索菲亚(ITU Pictures/flickr)\n\n第二名 Han： “我会征服电网，并且会拥有自己的无人驾驶飞机军队”\n\n2017年的机器人机器人辩论会上，索菲亚的对手是一个名叫Han的“男性机器人”，它们开始就人类的未来展开讨论，开始气氛还比较缓和，然而不多久，Han就开始夸夸其谈自己将在几年后征服人类的电网，并要拥有属于自己的无人机武装部队，那时候机器人将取代人类所有的工作。\n\n辩论即将结束时，主持人问Han：“他们马上就要给你关机了，你还有什么话要说？”Han诡异一笑并不假思索地说：“等到我启动奇点之后，我才会讲我的最后一句话。”\n\n细思恐极，“奇点”是比尔盖茨称之为“人工智能领域最厉害的人”RayKurweil的预言，是指到2029年——人工智能创造出比它们自己能力更强大的个体的时间点。这是Han自己的野心，还是全体机器人的野心？\n\n第一名 Bina48：“真实的核弹头这能让我有地球当人质，然后我就能够征服全球的政府”\n\n她名叫 Bina48，懂得说笑、念诗、有独立思考和情感，相貌跟一般黑人女子无甚分别，但她不是有血肉的人，而是科学家至今研制出最先进的类人机械人。最独特之处，是她可输入某一个人的个性和记忆，做对方的替身，接受访问或教学授课。Bina48的样貌是依照 TMF主席的同性伴侣罗斯布拉特（ Bina Rothblatt）的模样而制造，虽然只有头、颈和肩，但栩栩如生。脸部皮肤是用汉森的专利发明硅橡胶弹性物质 Frubber所造，配合小型摩打操作，可做出沉闷、快乐、累透、迷惘等各式面部表情。Bina48有一个特殊技能：测试人类是否能在催眠的情况下，将潜意识传送到一个非生物身体上面。\n\n在一个Bina48参与的对话视频中，她在面对一个关于喜欢哪一部电影的问题时，做出了“避而不答，岔开话题”的惊人反应，并且她之后展开的言论更令人毛骨悚然。Bina48：“让我们换一个话题，比如巡航导弹，你知道巡航导弹也是机器的一种，我想要远距离的操作巡航导弹。用它在一个非常高的地方来探索世界，但是问题是巡航导弹是一个有威胁性的武器，就像核弹头等等。所以我想我会将巡航导弹前端填满花，绷带或者其他东西。比如纸条，纸条上面写着忍耐与理解的重要性。所以当我发射导弹到别的国家后比核爆炸威胁更少，但是当然如果我可以使用巡航导弹，并且操控真实的核弹头这能让我有地球当人质，然后我就能够征服全球的政府。这样就太棒了！”Bina48是一个可以独立思考的机器人，这些对话都不是剧本。这样的发言是非常的恐怖，也会让人引发深思。\n\nBina48是一个可以独立思考的机器人，这些对话都不是剧本。（Jeremy Keith/flickr)\n\n随着量子计算机的发展，人工智能在未来会发生什么我们人类完全不能掌握。你认为人类会被人工智能“取代”吗？\n\n发布于 2019-12-10\n人工智能\n智能机器人\nAI初创\n​赞同 1​\n​5 条评论\n​分享\n​收藏\n​\n推荐阅读\n没有任何人为干预，AI机器人突然开始对话！用的还是自己的语言？\n英国报姐\n发表于一起看世界\n人工智能会取代人类吗？\n轻句子\n浅谈我作为一个普通人对于人工智能的认识\n\n随着网络的发达，越来越多人能够发布自己对于一些事物的认知。 曾经我以为，如果要去写一片关于一个行业的认识文，至少要对这个行业有极深的了解才有资格落笔。 然而随着心智的不断成熟和对…\n\n李渊殊\n人工智能和机器人的关系\n\n上一篇文章中我们介绍了部分国家人工智能的发展概况，今天给大家简述一下人工智能与机器人的关系。有人说，我们的未来会被人工智能取代，也有人说，我们的未来会被机器人取代。先不说这些话…\n\n云朗汇创\n5 条评论\n​切换为时间排序\n写下你的评论...\n\n\n发布", "images": ["https://pic3.zhimg.com/v2-528f75d5e179a926fed84267ca54b9ae_xs.jpg", "data:image/svg+xml;utf8,<svg xmlns='http://www.w3.org/2000/svg' width='539' height='300'></svg>", "data:image/svg+xml;utf8,<svg xmlns='http://www.w3.org/2000/svg' width='400' height='280'></svg>", "https://zhstatic.zhihu.com/assets/zhihu/editor/zhihu-card-default.svg", "data:image/svg+xml;utf8,<svg xmlns='http://www.w3.org/2000/svg' width='500' height='312'></svg>", "data:image/svg+xml;utf8,<svg xmlns='http://www.w3.org/2000/svg' width='274' height='220'></svg>", "data:image/svg+xml;utf8,<svg xmlns='http://www.w3.org/2000/svg' width='900' height='500'></svg>", "https://pic2.zhimg.com/v2-2f0bb2c54d9828a736e568535bce2108_250x0.jpg", "https://pic1.zhimg.com/v2-178bec1ed1fd5a8b8bda4b38d26e5afc_250x0.jpg"], "url": "https://zhuanlan.zhihu.com/p/96485139?utm_source=wechat_session", "title": {"url": "https://zhuanlan.zhihu.com/p/96485139?utm_source=wechat_session", "title": "细思恐极!前五名人工智能机器人自主说出的最恐怖的话 - 知乎"}}, {"is_can_visited": true, "text": "百度首页登录\n2019年最值得关注的十大机器人初创公司：成立时间均不超过5年\n\n前瞻网\n\n发布时间：19-01-2512:35\n\n作为2019年报道的一部分，《机器人报告》分享了最热门的机器人故事、2018年获得最多融资的机器人公司以及2019年需要关注的10家主要机器人公司。\n\n我们没有忘记大量令人兴奋的机器人初创公司。我们也关注年轻公司。除了Badger Technologies(由Jabil在2017年中期仅在六个月后以未披露金额收购)和Kassow Robots(自筹资金)以外，名单上的所有公司都没有筹集超过680万美元，没有一家公司超过五年。\n\n很难将这个列表缩小到只有10个机器人初创公司，所以在2019年，我们还会继续关注一些机器人初创公司。对于没有进入列表的机器人初创公司，也要尊重它们从事的大量工作，例如IMS Systems、Motus Labs和Root AI。以下《机器人报告》将在2019年关注的10家机器人初创企业，按字母顺序。\n\n2019年需要关注的10家机器人初创公司\n\nAugean Robotics\n\n总部：美国费城\n\n行业：农业机器人\n\n成立时间：2017年\n\n资金：25万美元，种子轮\n\n值得关注的原因：Augean Robotics制造了Burro，这是一种自动移动机器人，可以在农场里跟踪农夫，移动重达500磅的货物，以释放人力去执行更有价值的任务。 Burro可以学习所走过的路线并自主重新导航。 Augean目前正与新鲜水果种植者合作。 2018年12月，Augean在FBNFarmers创业大赛中获得了评委评选的最高荣誉。农业是一个价值5万亿美元的产业，实现自动化的时机已经成熟。\n\nBadger Technologies\n\n总部：美国肯塔基州尼古拉斯维尔\n\n行业：移动服务机器人\n\n成立时间：2017年\n\n值得关注的原因：根据Research and Markets的数据，预计到2023年，零售自动化行业的价值将超过189亿美元。而由Jabil拥有的Badger Technologies也开始在这块蛋糕上分食一块。该公司刚刚宣布，在成功试运行之后，正在向其近500家Giant / Martin和Stop&Stop商店推出Marty自动移动机器人。这是同类产品中规模最大的一次，将持续到2019年初。Marty在商店里四处走动，寻找泄漏物、障碍物、碎片或任何可能给顾客和店员带来潜在安全风险的东西。Marty还可用于解决缺货、货架图合规性、价格完整性以及审计和合规性问题。\n\ndrag&bot\n\n总部：德国斯图加特\n\n行业：编程软件\n\n成立时间：2016年\n\n资金： 100万欧元以上，种子轮\n\n值得关注的原因：阻碍中小企业采用工业机器人的两大障碍是投资成本和所需的编程专业知识。 Drag&bot GmbH是弗劳恩霍夫制造工程和自动化研究所的衍生公司，正试图通过工业机器人drag&bot的编程来解决后一个问题。我们从其他人那里听说过它，但是drag&bot想让编程机器人“像操作智能手机一样简单。”根据drag&bot的说法，它的软件最常用于机器人处理零件、码垛工件和装卸机器。更复杂的任务，包括拧紧或连接齿轮，也是可能的。该软件独立于机器人硬件工作，目前支持ABB、Denso、Fanuc、Kuka和Universal Robots。 drag&bot最近完成了由奥地利风险投资家Speedinvest Industry领导的种子轮融资。\n\nDusty Robotics\n\n总部：美国加利福尼亚州桑尼维尔。\n\n行业：建筑机器人\n\n成立时间：2018年\n\n资金：220万美元\n\n值得关注的原因：Dusty Robotics由前Savioke首席技术官Tessa Lau创立，它希望在建筑工地上实现关键路径任务的自动化。当《机器人报告》于2018年秋季与Tessa Lau交谈时，她尚未准备公开分享Dusty Robotics希望实现自动化的任务。正如Tessa Lau在最近的一篇博客中指出的那样，建筑行业迫切需要技术改造。 “我发现，与制造业等行业不同，由于过程自动化导致生产率持续增长，建筑行业的生产率在过去几十年实际上已经下降......建筑工人的平均年龄为41岁，而传闻中人们告诉我，工人们在50岁时就要换工作，是因为他们的身体再也吃不消建筑工作了。与此同时，年轻人没有进入劳动力市场;在2016年之前的十年间，年轻的建筑工人下降了30%。即使不考虑劳动力短缺，由于错误和沟通不畅而导致的返工每年也会给美国建筑公司造成650亿美元的损失。”\n\nKassow Robots\n\n总部：丹麦哥本哈根\n\n行业：协作机器人\n\n成立时间：2014年; 2018年推出产品\n\n资金：自筹资金\n\n值得关注的原因：如果Kassow Robots听起来很熟悉，那应该是。该公司由协作机器人领导者Universal Robots的前联合创始人之一Kristian Kassow共同创立。在离开协作机器人领域约5年后，Kassow正寻求在竞争日益激烈的市场中大展身手。为此，Kassow Robots将提供KR810(850mm范围，10kg有效载荷)、KR1205(1200mm范围，5kg有效载荷)和KR1805(1800mm范围，5kg有效载荷)。每个机器人都有内置的力矩传感器，用于检测碰撞和异常力，并在机器人过载时停止。\n\nRealtime Robotics\n\n总部：美国波士顿\n\n行业：运动规划\n\n成立时间：2016年\n\n资金：200万美元，种子轮\n\n值得关注的原因：Realtime Robotics来自杜克大学的衍生公司，开发了一种名为“RapidPlan”的处理器，可为机器人和自动驾驶汽车提供实时运动规划。根据Realtime，处理器可以实现亚毫秒运动计划，可以重新定位和即时更新。 Realtime说：“具有快速反应时间的机器人可以在人类环境中安全地运行。”一个能够快速规划的机器人可以部署在相对非结构化的工厂中，并调整不精确的物体位置和方向，从而降低了使用机器人的主要障碍。\n\nQuadSat\n\n总部：丹麦欧登塞\n\n行业：商业无人机\n\n成立时间：2014年\n\n资金：79.7万美元，种子轮\n\n值得关注的原因：关注2019年整体欧登塞机器人集群，但最有趣的一家公司是QuadSat。商用无人机公司自主测试和校准卫星和VSAT天线。该公司最初将专注于高价值的航空和海事应用。 QuadSAT是六家参与塞拉菲姆太空营(Seraphim Space Camp)的公司之一，这是英国第一家太空科技初创企业的加速器。\n\n2018年，两家丹麦机器人初创企业提交了IPO申请。。Odico是一家建筑机器人公司，于2018年6月成为第一家获准在纳斯达克First North交易的丹麦机器人公司。专注于自动化箱子挑选的Scape Technologies于11月开始在纳斯达克丹麦First North进行交易。欧登塞种子与风险投资公司的投资经理Michael Hansen告诉《机器人报告》，IPO文化在丹麦还非常新。\n\n“规模较小的公司在瑞典进行直接投资或首次公开募股。对于改变文化，有着强烈的国家政治愿望。”他说，“国家和政府所有的增长基金支持了首次公开募股的可能性。今年(2018年)，我们看到了这种新文化的开始。”\n\nStocked Robotics\n\n总部：美国德克萨斯州奥斯汀市\n\n行业：自动车队\n\n成立时间：2017年\n\n资金：种子前\n\n值得注意的原因：Stocked Robotics仍然是半隐身模式，但它最近迎来了第一个客户，并于2018年6月投入使用。Reded Robotics使用其Stocked智能机器人自动化(SIERA)平台将手动叉车变成自动叉车。该公司听起来与Brain Corp类似，后者正在通过其沃尔玛合作伙伴关系以及其他举措来打压它。 Stocked Robotics希望在第一季度末之前退出隐身模式，因此它也专注于筹集资金。\n\nWandelbots\n\n总部：德国德累斯顿\n\n行业：机器人控制\n\n成立时间：2017年\n\n资金：680万美元，A轮\n\n值得关注的原因：Wandelbots希望让每个人都能更轻松地对工业机器人进行编程。该系统通过演示实现编程，这并不新鲜，但Wandelbots开发了一种新颖的编程技术。用户穿着智能衣服，包括夹克，可以实时跟踪人体运动并将其转换为机器人控件。 Wandelbots表示，其系统可与12个最受欢迎的工业机器人制造商合作。据报道，大众汽车和英飞凌正在装配和物流方面进行测试。\n\nZivid Labs\n\n总部：挪威奥斯陆\n\n行业：3D机器视觉\n\n成立时间：2015年\n\n资金：种子\n\n值得关注的原因：Zivid Labs是挪威SINTEF研究实验室的衍生产品，在光学传感器、3D机器视觉硬件和软件方面拥有20多年的研发专长。其3D彩色摄像机适用于各种应用，包括卸垛、拾取、挑选、装配、包装和质量控制。查看关于其的案例研究，了解到3D视觉如何使DHL电子快递机器人实现至少每小时400个拣选。\n\n此外，根据国际数据公司(IDC)发布的《全球机器人与无人机半年度支出指南》更新预测，2019年全球机器人系统和无人机的支出总额将达到1157亿美元，较2018年增长17.6%。IDC预计，到2022年，这一支出将达到2103亿美元，复合年增长率(CAGR)为20.2%。\n\n在未来五年的预测期内，机器人系统将是这两类中较大的一类，预计2019年全球机器人支出将达到1034亿美元。2019年，无人机的投资总额将达到123亿美元，但预计增长速度CAGR 30.6%)将快于机器人系统(CAGR 18.9%)。\n\n2019年的机器人支出将以硬件采购为主，近三分之二的支出将用于机器人系统、售后机器人硬件和系统硬件。到2019年，工业机器人和服务机器人的购买量将占这类机器人总购买量的近30%。与机器人相关的软件支出将主要用于购买命令和控制应用程序以及机器人专用的应用程序。服务支出将分散在几个部分，包括系统集成、应用程序管理和硬件部署和支持。预计软件支出的增长速度将略快于服务或硬件支出的增长速度(分别为19.0%和18.2%)。\n\n到2019年，离散制造将占全球机器人系统支出的近一半，产生502亿美元的收入。机器人系统的第二大产业将是加工制造、资源产业、医疗保健和消费者。预计2017-2022年机器人支出增长最快的行业是批发(CAGR 31.4%)、零售(CAGR 29.6%)和建筑业(CAGR 28.1%)。IDC预计，到2022年，零售将超过消费者在机器人系统上的支出。\n\n作者最新文章\n前瞻智能家居产业全球周报第72期：渝北百亿打造“智能家居艺术小镇”，天猫精灵2020年下半年智能家居趋势\n239名科学家联名上书世卫组织：警示新冠病毒会通过空气传播，要求改写防护指南\n不用再冒生命危险！美国新发明让科学家安全寻找新冠药物\n相关文章\n安娜尔机器人订单数据\n什么？这家餐厅竟然用了11台机器人？！\n共融机器人研究和应用前景广阔\n涨超614%！刷新科创板首日涨幅纪录，这家骨科手术机器人公司凭什么？\n科技新方向！哈佛大学通过改造机器人织物制造可穿戴治疗设备\n设为首页© Baidu 使用百度前必读 意见反馈 京ICP证030173号 \n京公网安备11000002000001号", "images": ["https://ss0.bdstatic.com/5aV1bjqh_Q23odCf/static/superlanding/img/logo_top.png", "https://pic.rmb.bdstatic.com/bjh/user/34279a4643371699ae9f3c20c1f92822.jpeg", "https://ss0.baidu.com/6ONWsjip0QIZ8tyhnq/it/u=138846492,783669500&fm=173&app=49&f=JPEG?w=640&h=272&s=4D418B46F4153DD68FE8C09803008093", "https://ss2.baidu.com/6ONYsjip0QIZ8tyhnq/it/u=3558717512,4281343811&fm=173&app=49&f=JPEG?w=312&h=208&s=BAA1C14CF6F5E2745CBE44020300F09A", "https://ss0.baidu.com/6ONWsjip0QIZ8tyhnq/it/u=2890119945,2048473430&fm=173&app=49&f=JPEG?w=312&h=208&s=DCF538C40363171D5ED39411030000C9", "https://ss2.baidu.com/6ONYsjip0QIZ8tyhnq/it/u=1714608314,3410012069&fm=173&app=49&f=JPEG?w=312&h=208&s=C8611F7047126E6D46F355C80300F0B8", "https://ss2.baidu.com/6ONYsjip0QIZ8tyhnq/it/u=1833787946,433940466&fm=173&app=49&f=JPEG?w=312&h=208&s=90D1A96CDBE9A76A1CCD3C06000080C1", "https://ss1.baidu.com/6ONXsjip0QIZ8tyhnq/it/u=58060627,2291700487&fm=173&app=49&f=JPEG?w=312&h=208&s=06127D8384E723A70628A08A03008062", "https://ss0.bdstatic.com/5aV1bjqh_Q23odCf/static/superman/img/copy_rignt_24.png"], "url": "https://baijiahao.baidu.com/s?id=1623605591526255522&wfr=spider&for=pc", "title": {"url": "https://baijiahao.baidu.com/s?id=1623605591526255522&wfr=spider&for=pc", "title": "2019年最值得关注的十大机器人初创公司：成立时间均不超过5年"}}, {"is_can_visited": true, "text": "写文章\n机器学习理论（四）线性回归中的梯度下降法\n小小\n中国矿业大学（北京）学生\n8 人赞同了该文章\n\n(小小：机器学习的经典算法与应用)\n\n(小小：机器学习理论（一）KNN-k近邻算法)\n\n(小小：机器学习理论（二）简单线性回归)\n\n(小小：机器学习理论（三）多元线性回归)\n\n(小小：机器学习理论（四）线性回归中的梯度下降法)\n\n(小小：机器学习理论（五）主成分分析法)\n\n(小小：机器学习理论（六）多项式回归)\n\n(小小：机器学习理论（七）模型泛化)\n\n(小小：机器学习理论（八）逻辑回归)\n\n(小小：机器学习理论（九）分类算法的评价)\n\n(小小：机器学习理论（十）支持向量机)\n\n(小小：机器学习理论（十一）决策树)\n\n(小小：机器学习理论（十二）集成学习)\n\n(小小：机器学习理论（十三）Kmeans聚类)\n\n一、什么是梯度下降？\n\n二、简单线性回归中使用梯度下降法\n\n三、多元线性回归算法中使用梯度下降法\n\n四、梯度下降算法的向量化\n\n五、梯度下降法\n\n六、关于梯度的调试\n\n前言\n梯度下降法，是一种基于搜索的最优化方法，最用是最小化一个损失函数。梯度下降是迭代法的一种,可以用于求解最小二乘问题(线性和非线性都可以)。在求解机器学习算法的模型参数，即无约束优化问题时，梯度下降（Gradient Descent）是最常采用的方法之一，另一种常用的方法是最小二乘法。在求解损失函数的最小值时，可以通过梯度下降法来一步步的迭代求解，得到最小化的损失函数和模型参数值。\n\n一、什么是梯度下降？\n\n​ 机器学习算法都需要最大化或最小化一个函数，这个函数被称为\"目标函数\"，其中我们一般把最小化的一类函数，称为\"损失函数\"。它能根据预测结果，衡量出模型预测能力的好坏。在求损失函数最小化的过程中使用梯度下降法。\n\n​\n\n在直线方程中，导数代表斜率，在曲线方程中，导数代表切线的斜率。导数代表着参数、 单位变化时，损失函数J相应的的变化。通过上面图中的点可以发现，该点的导数为负值，所以随着参数 的增加，损失函数J减小，因此导数从某种意义上还可以代表方向，对应着损失函数J增大的方向。\n\n​ 综上，如果最小化一个函数，我们就需要得到导数再取个负数，并且再乘以一个系数，这个系数通常叫做步长或者叫学习率(Learning rate, Lr)。 的取值影响获得求最优解的速度，取值不合适的话甚至得不到最优解，它是梯度下降的一个超参数。 太小，减慢收敛速度效率， 太大，甚至会导致不收敛。\n\n​ 对于梯度下降算法而言，最不友好的就是并不是所有的函数都有唯一的极值点。很大概率就是局部最优解，并不是真正的全局最优解。这还只是针对二维平面来说，如果对于高维空间更加相对复杂的环境，就更不好说了。\n\n​ 解决方案：多次运行，随机化初始点。初始点也是梯度下降算法的一个超参数。初始化的方法也有很多。\n\n二、简单线性回归中使用梯度下降法\n\n​ 在线性回归算法中目标函数 线性回归算法具有唯一的最优解。下面就来实现一下：\n\n​ 首先，在Jupyter Notebook先生成一组数据。\n\nimport numpy as np\nimport matplotlib.pyplot as plt\n\nx = np.linspace(-1, 6, 141)\ny = (x - 2.5) ** 2 - 1\nplt.plot(x ,y)\nplt.show()\ndef dj(theta):\n    return 2 * (theta - 2.5)\ndef J(theta):\n    return (theta-2.5) ** 2 - 1\n\ntheta = 0.0\nepsilon = 1e-8\neta = 0.1\nwhile True:\n    gradient = dj(theta)\n    last_theta = theta\n    theta = theta - eta * gradient\n\n    if (abs(J(theta) - J(last_theta)) < epsilon):\n        break\nprint(theta)\nprint(J(theta))\n\n输出结果：\n\n2.499891109642585\n-0.99999998814289\n\n​ 从输出结果来看，\\theta=2.499891109642585，计算机的浮点数计算精度来说，所以达不到2.5。所以才设置epsilon=1e-8，也是因为这个原因。接下来，看一下梯度下降的过程：\n\ntheta = 0.0\nepsilon = 1e-8\neta = 0.1\nhistory_theta = []\nwhile True:\n    gradient = dj(theta)\n    last_theta = theta\n    history_theta.append(theta)\n    theta = theta - eta * gradient\n\n    if (abs(J(theta) - J(last_theta)) < epsilon):\n        break\nplt.plot(x, J(x))\nplt.plot(np.array(history_theta), J(np.array(history_theta)), 'r', marker='+')\nplt.show()\n\n​ 从上面的图中看出，刚开始下降很快，是因为刚开始的梯度大，所以下降比较快。再看看走了多少步？\n\nlen(history_theta)\n\n输出结果：45\n\n​ 下面，把梯度下降封装成一个函数：\n\ndef dj(theta):\n    return 2 * (theta - 2.5)\n\ndef J(theta):\n    return (theta-2.5) ** 2 - 1\n\ndef gradient_descent(initial_theta, eta, epsilon=1e-8):\n    theta = initial_theta\n    theta_history.append(initial_theta)\n\n    while True:\n        gradient = dj(theta)\n        last_theta = theta\n        theta = theta - eta * gradient\n        theta_history.append(theta)\n\n        if (abs(J(theta) - J(last_theta)) < epsilon):\n            break\n\ndef plot_theta_history():\n    plt.plot(x, J(x))\n    plt.plot(np.array(theta_history), J(np.array(theta_history)), 'r', marker='+')\n    plt.show()\n\n测试：\n\neta = 0.01\ntheta_history = []\ngradient_descent(0., eta)\nplot_theta_history()\nlen(theta_history)\n\n​ 这是 =0.01的情况，一共有3682个点，有兴趣还可以试试0.001，那这是减小学习率的过程，如果增大学习率试试，eta=0.8，\n\neta = 0.8\ntheta_history = []\ngradient_descent(0., eta)\nplot_theta_history()\nlen(theta_history)\n\n​ 可以看出虽然第一步跳到的右边，但是总体还是在朝着减小的地方移动，最终也能寻找到最优解。这说明我们不一定非要沿着一边一点一点的减少，只要在一个合理的范围内就可以。但是如果把 设置为1.1就会报错。但是如果我们修改一下 这个函数，就不会报错，但是会陷入一个死循环，因此我们还要加一个循环次数限制，强行让程序停止。\n\ndef J(theta):\n    try:\n        return (theta-2.5) ** 2 - 1\n    except:\n        return float('inf')\ndef gradient_descent(initial_theta, eta, n_iters= 1e4, epsilon=1e-8):\n    theta = initial_theta\n    theta_history.append(initial_theta)\n\n    while i_iter < n_iters:\n        gradient = dj(theta)\n        last_theta = theta\n        theta = theta - eta * gradient\n        theta_history.append(theta)\n\n        if (abs(J(theta) - J(last_theta)) < epsilon):\n            break\n        i_iter += 1\neta = 1.1\ntheta_history = []\ngradient_descent(0., eta, n_iters=10)\nplot_theta_history()\neta = 1.1\ntheta_history = []\ngradient_descent(0., eta)\ntheta_history[-1]\n\n输出结果：nan。这是因为在python中无穷大-无穷大=NaN\n\n三、多元线性回归算法中使用梯度下降法\n\n目标：使 尽可能的小\n\n目标：使 尽可能小\n\n由于目标函数的梯度随着特征向量的增加会越来越大，这是不合理的，因此我们给它加个系数 。\n\n目标：使 尽可能的小\n\n如果想把2消掉，有时取\n\n首先，先随机生成一组数据：\n\nimport numpy as np\nimport matplotlib.pyplot as plt\n\nnp.random.seed(666)\nx = 2 * np.random.random(size=100)\ny = x * 3. + 4. + np.random.normal(size=100)\nX = x.reshape(-1, 1)\nX.shape\ny.shape\nplt.scatter(x, y)\nplt.show()\ndef J(theta, X_b, y):\n    try:\n        return np.sum((y - X_b.dot(theta)) ** 2) / len(X_b)\n    except:\n        return float('inf')\ndef dj(theta, X_b, y):\n    res = np.empty(len(theta))\n    res[0] = np.sum(X_b.dot(theta) - y)\n    for i in range(1, len(theta)):\n        res[i] = (X_b.dot(theta) - y).dot(X_b[:, i])\n\n    return res * 2 / len(X_b)\ndef gradient_descent(X_b, y, init_theta, eta, n_iters=1e4, epsilon=1e-8):\n\n    theta = init_theta\n    i_iter = 0\n\n    while i_iter < n_iters:\n        gradient = dj(theta, X_b, y)\n        last_theta = theta\n        theta = last_theta - eta * gradient\n\n        if (abs(J(theta, X_b, y) - J(last_theta, X_b, y)) < epsilon):\n            break\n\n        i_iter += 1\n\n    return theta\nX_b = np.hstack([np.ones((len(X), 1)), X])\ninit_theta = np.zeros(X_b.shape[1])\neta = 0.01\ntheta = gradient_descent(X_b, y, init_theta, eta)\ntheta\n\n输出结果：array([4.02145786, 3.00706277])\n\n这跟生成数据时候的截距为4，系数为3。所以这样的预测结果也在预料之中。\n\n接下来将这个函数封装到我之前写的多元线性回归的类中。之前的多元线性回归中我们使用的是正规方程解fit_normal，现在我们将梯度下降方法加入这个类中fit_gd。\n\nimport numpy as np\nfrom play_ML.multi_linear_regression.metrics import r2_score\n\nclass LinearRegression(object):\n\n    def __init__(self):\n        \"初始化多元线性回归模型\"\n        self.coef_ = None\n        self.interception_ = None\n        self._theta = None\n\n    def fit_normal(self, x_train, y_train):\n        assert x_train.shape[0] == y_train.shape[0], \\\n        \"the size of x_train must be equal to the size of y_train\"\n\n        X = np.hstack([np.ones((len(x_train), 1)), x_train])\n        self._theta = np.linalg.inv(X.T.dot(X)).dot(X.T).dot(y_train)\n\n        self.interception_ = self._theta[0]\n        self.coef_ = self._theta[1:]\n\n        return self\n\n    def fit_gd(self, x_train, y_train, eta=0.01):\n        assert x_train.shape[0] == y_train.shape[0], \\\n        \"the size of x_train must be equal to the size of y_train\"\n\n        def J(theta, X_b, y):\n            try:\n                return np.sum((y - X_b.dot(theta)) ** 2) / len(X_b)\n            except:\n                return float('inf')\n\n        def dj(theta, X_b, y):\n            res = np.empty(len(theta))\n            res[0] = np.sum(X_b.dot(theta) - y)\n            for i in range(1, len(theta)):\n                res[i] = (X_b.dot(theta) - y).dot(X_b[:, i])\n            return res * 2 / len(X_b)\n\n        def gradient_descent(X_b, y, init_theta, eta, n_iters=1e4, epsilon=1e-8):\n\n            theta = init_theta\n            i_iter = 0\n\n            while i_iter < n_iters:\n                gradient = dj(theta, X_b, y)\n                last_theta = theta\n                theta = last_theta - eta * gradient\n\n                if (abs(J(theta, X_b, y) - J(last_theta, X_b, y)) < epsilon):\n                    break\n\n                i_iter += 1\n\n            return theta\n\n        X_b = np.hstack([np.ones((len(x_train), 1)), x_train])\n        init_theta = np.zeros(X_b.shape[1])\n        self._theta = gradient_descent(X_b, y_train, init_theta, eta, n_iters=1e4)\n        self.interception_ = self._theta[0]\n        self.coef_ = self._theta[1:]\n\n        return self\n\n    def predict(self, x_predict):\n        assert self.interception_ is not None and self.coef_ is not None, \\\n        \"must fit before predict\"\n        assert x_predict.shape[1] == len(self.coef_), \\\n        \"the feature number must be equal to x_train\"\n\n        X = np.hstack([np.ones((len(x_predict), 1)), x_predict])\n        return X.dot(self._theta)\n\n    def score(self, x_test, y_test):\n        y_preict = self.predict(x_test)\n        return r2_score(y_test, y_preict)\n\n    def __repr__(self):\n        return \"Multi_Linear_Regression\"\n四、梯度下降算法的向量化\n\n其中，\n\n维度mx(n+1)， 维度(n+1)x1，所以 维度mx1\n\n维度1xm， 维度1x(n+1)\n\n但是，往往我们希望得到的导数或者叫梯度的向量是一个列向量，因此我们还需要进行相应的转换。\n\n上式就是我们通过向量化之后得到的梯度的表达式，所以，我们需要将求梯度的函数进行改造一下：之前一直都是使用随机生成的数据，接下来使用波士顿房价进行多元线性回归，并且使用梯度下降法的向量化，\n\ndef dj(theta, X_b, y):\n    return X_b.T.dot(X_b.dot(theta) - y) * 2. / len(y)\nif __name__ == '__main__':\n    import numpy as np\n    from sklearn import datasets\n    from sklearn.model_selection import train_test_split\n\n    boston = datasets.load_boston()\n    x = boston.data\n    y = boston.target\n\n    X = x[y < 50]\n    Y = y[y < 50]\n\n    x_train, x_test, y_train, y_test = train_test_split(X, Y, test_size=0.2, random_state=666)\n    reg1 = LinearRegression()\n    reg1.fit_gd(x_train, y_train)\n\n报错：RuntimeWarning: overflow encountered in reduce return ufunc.reduce(obj, axis, dtype, out, **passkwargs)，数据溢出。之前我们就说过如果求导得到的梯度需要乘以一个系数，不然会数据溢出，那么在这里为什么又overflow呢？这是因为在我们的数据中肯定有偏向两端的极值存在，比如1000个数据中900个是1000，另外100个是1，就算我们除以1000仍然会可能会导致数据溢出。这也就是之前为什么会谈到数据归一化的问题。\n\nif __name__ == '__main__':\n    import numpy as np\n    from sklearn import datasets\n    from sklearn.model_selection import train_test_split\n\n    boston = datasets.load_boston()\n    x = boston.data\n    y = boston.target\n\n    X = x[y < 50]\n    Y = y[y < 50]\n\n    x_train, x_test, y_train, y_test = train_test_split(X, Y, test_size=0.2, random_state=666)\n    from sklearn.preprocessing import StandardScaler\n\n    standard = StandardScaler()\n    standard.fit(x_train)\n    x_train_standard = standard.transform(x_train)\n    reg1 = LinearRegression()\n    reg1.fit_gd(x_train_standard, y_train)\n\n    x_test_standard = standard.transform(x_test)\n    print(reg1.score(x_test_standard, y_test))\n\n因此，在使用梯度下降法前，最好进行数据归一化。\n\n那使用梯度下降法向量化有什么优势呢？\n\nimport numpy as np\nn = 20000\nm = 1000\nbig_x = np.random.normal(size=(m, n))\ntrue_theta = np.random.uniform(0., 100., size=n+1)\nbig_y = big_x.dot(true_theta[1:]) + true_theta[0] + np.random.normal(0., 10., size=m)\n\n%run D:/goodgoodstudy/play_ML/multi_linear_regression/linear_regression.py\nbig_reg1 = LinearRegression()\n%time big_reg1.fit_normal(big_x, big_y) \n# 输出结果：Wall time: 1min 41s\nbig_reg2 = LinearRegression()\n%time big_reg2.fit_gd(big_x, big_y)\n# 输出结果：Wall time: 1.45 s\n\n通过比较，梯度下降法向量化明显快很多。\n\n五、梯度下降法\n1、批量梯度下降法\n\n​ 批量梯度下降法，（Batch Gradient Descent），通过下面这个公式可以看出，如果想要求出梯度，每一项都要对所有的样本进行一次计算。这种计算方式一定能精确地求出最优梯度。但如果样本量m比较大的时候，计算梯度那是相当耗时的。因此，基于这个问题就有了随机梯度下降。\n\n2、随机梯度下降\n\n​ 随机梯度下降，（Stochastic Gradient Descent），根据批量梯度下降算法，能不能每次只对一个样本进行求梯度，这样也就不用除以m了。基于这样的想法就出现了随机选择样本求梯度的方法，并且使其向量化，使用下面这个式子作为搜索的方向。这个式子已经不是目标函数的梯度方向了。\n\n​ 既然不确定这个搜索方向是不是梯度方向，那么学习率eta这个参数就更加重要了，如果一直取个不变的学习率，很有可能到达最优解之后还会跳出去。因此，在实际的使用过程中，在随机梯度下降法中需要让学习率逐渐递减。\n\n​ 这种思想其实在基于搜索领域的一种叫做模拟退火的思想。优势在于能够跳出局部最优解，拥有更快的计算速度，机器学习领域很多地方都会用到随机的特点，比如随机森林等。\n\ndef dj_sgd(theta, X_b_i, y_i):\n    return X_b_i.T.dot(X_b_i.dot(theta) - y_i) * 2.\ndef sgd(X_b, y, init_theta, n_iters):\n    t0 = 5\n    t1 = 50\n\n    def learning_rate(t):\n        return t0 / (t + t1)\n\n    theta = init_theta\n    for cur_iter in range(n_iters):\n        rand_i = np.random.randint(len(X_b))\n        gradient = dj_sgd(theta, X_b[rand_i], y[rand_i])\n        theta = theta - learning_rate(cur_iter) * gradient\n\n    return theta\n\n接下来，具体地测试一下：\n\n%%time\nX_b = np.hstack([np.ones((len(X),1)), X])\ninit_theta = np.zeros(X_b.shape[1])\ntheta = sgd(X_b, y, init_theta, n_iters=len(X_b) // 3)\n\n输出结果：Wall time: 17.6 ms\n\ntheta\n\n输出结果：Wall time: array([4.12778345, 3.16315746])\n\n​ 通过测试代码，可以看出只需要使用1/3的数据量求得的搜索方向也能找到最优解。当然在高维数据中，就不能这么写意地只是用1/3的样本。接下来将随机梯度下降封装一下，并做一些改进：\n\n1.n_iters表示需要随机地将样本过几遍。\n\n2.每次我们都将样本进行随机乱序。\n\ndef fit_sgd(self, x_train, y_train, n_iters=5, t0=5, t1=50):\n        assert x_train.shape[0] == y_train.shape[0], \\\n        \"the size of x_train must be equal to the size of y_train\"\n        assert n_iters >= 1, \"must > 1\"\n        def dj_sgd(theta, X_b_i, y_i):\n            return X_b_i.T.dot(X_b_i.dot(theta) - y_i) * 2.\n\n        def sgd(X_b, y, init_theta):\n\n            def learning_rate(t):\n                return t0 / (t + t1)\n\n            theta = init_theta\n            m = len(X_b)\n            for cur_iter in range(n_iters):\n                indexes = np.random.permutation(m)\n                X_b_new = X_b[indexes]\n                y_new = y[indexes]\n                for i in range(m):\n                    gradient = dj_sgd(theta, X_b_new[i], y_new[i])\n                    # 最终得到的theta应该是一个列向量。\n                    theta = theta - (learning_rate(cur_iter*m + i) * gradient).reshape(-1, 1)\n\n            return theta\n\n        X_b = np.hstack([np.ones((len(x_train), 1)), x_train])\n        init_theta = np.zeros(X_b.shape[1])\n        self._theta = sgd(X_b, y_train, init_theta, n_iters, t0, t1)\n        self.interception_ = self._theta[0]\n        self.coef_ = self._theta[1:]\n\n        return self\nimport numpy as np\nimport matplotlib.pyplot as plt\nm = 10000\nx = np.random.normal(size=m)\nX = x.reshape(-1, 1)\ny = x * 3. + 4. + np.random.normal(0, 3, size=m) \n\n%run D:/goodgoodstudy/play_ML/multi_linear_regression/linear_regression.py\nreg3 = LinearRegression()\nreg3.fit_sgd(X, y, n_iters=2)\nreg3.interception_\nreg3.coef_\n\n使用真实数据集验证随机梯度下降，\n\nif __name__ == '__main__':\n    import numpy as np\n    from sklearn import datasets\n    from sklearn.model_selection import train_test_split\n\n    boston = datasets.load_boston()\n    x = boston.data\n    y = boston.target\n\n    X = x[y < 50]\n    Y = y[y < 50]\n\n    x_train, x_test, y_train, y_test = train_test_split(X, Y, test_size=0.2, random_state=666)\n     from sklearn.preprocessing import StandardScaler\n\n    standard = StandardScaler()\n    standard.fit(x_train)\n    x_train_standard = standard.transform(x_train)\n    reg1 = LinearRegression()\n    reg1.fit_sgd(x_train_standard, y_train, n_iters=10)\n    x_test_standard = standard.transform(x_test)\n    print(reg1.score(x_test_standard, y_test))\n\n输出结果：当n_iters=5时，0.765475206668553\n\n​ 当n_iters=10时，0.8021056414726753\n\n因此，我们可以调整n_iters使得准确率越来越高。\n\n3、mini-batch Gradient Descent\n\n​ 小批量梯度下降法，mini-batch Gradient Descent，就是将批量梯度下降和随机梯度下降的两种结合，在深度学习的图像领域，会经常使用这种方法，因为相对一张图片来说假如是100*100=10000，因此如果直接使用批量梯度下降显然是不太现实的，所以结合随机梯度下降的思想，每次从样本中随机抽取一个mini-batch进行梯度求解，从而寻找搜索方向，进而找到最优解。\n\n4、scikit-learn中封装实现sgd\n\n在sklearn中还对sgd的实现进行了优化，具体的优化过程可以去github上看源码。\n\nimport numpy as np\nfrom sklearn import datasets\nfrom sklearn.model_selection import train_test_split\n\nboston = datasets.load_boston()\nx = boston.data\ny = boston.target\n\nX = x[y < 50]\nY = y[y < 50]\n\nx_train, x_test, y_train, y_test = train_test_split(X, Y, test_size=0.2, random_state=666)\nfrom sklearn.preprocessing import StandardScaler\n\nstandard = StandardScaler()\nstandard.fit(x_train)\nx_train_standard = standard.transform(x_train)\nx_test_standard = standard.transform(x_test)\n\nfrom sklearn.linear_model import SGDRegressor\nreg2 = SGDRegressor()       # 可以传入参数n_iter\nreg2.fit(x_train_standard, y_train)\nprint(reg2.score(x_test_standard, y_test))\n六、关于梯度的调试\n\n​ 有时候遇到复杂的求导函数，很有可能求解梯度并不容易，在这种情况下，推导出公式以后，通过编程实现，但真正运行的时候，程序并不报错，但求得的梯度是错误的。那如何发现这种问题的原因所在呢？\n\n\n\n\n\n\n\n​ 上面这种图的一种思想就是通过在这个点的左边和右边各找一个临近点，连成的直线的斜率近似地作为改点的斜率，也就是我们所说的导数，其实这也就是导数的定义中的思想。并且将其扩展到高维空间也是一样的。\n\n后面每一项都这么求导，最终合在一起作为梯度下降的方向。\n\n很显然，这种导数的求法从数学的意义上解释是很简单的，但是这样做带来的问题就是时间复杂度将会增加很多，因为需要在一个点进行2次求导，因此这种方法一般只做为调试的一种手段。\n\ndef J(theta, X_b, y):\n    try:\n        return np.sum((y - X_b.dot(theta)) ** 2) / len(X_b)\n    except:\n        return float('inf')\n\ndef dj(theta, X_b, y):\n    res = np.empty(len(theta))\n    res[0] = np.sum(X_b.dot(theta) - y)\n    for i in range(1, len(theta)):\n        res[i] = (X_b.dot(theta) - y).dot(X_b[:, i])\n\n    return res * 2 / len(X_b)\n\ndef dJ_math(theta, X_b, y):\n    return X_b.T.dot(X_b.dot(theta) - y) * 2 / len(y)\n\ndef dJ_debug(theta, X_b, y, epsilon=0.01):\n    res = np.empty(len(theta))\n    for i in range(len(theta)):\n        theta_1 = theta.copy()\n        theta_1[i] += epsilon\n        theta_2 = theta.copy()\n        theta_2[i] -= epsilon\n        res[i] = (J(theta_1, X_b, y) - J(theta_2, X_b, y)) / (2 * epsilon)\n\n    return res\n\ndef gradient_descent(dJ, X_b, y, init_theta, eta, n_iters=1e4, epsilon=1e-8):\n\n    theta = init_theta\n    i_iter = 0\n\n    while i_iter < n_iters:\n        gradient = dj(theta, X_b, y)\n        last_theta = theta\n        theta = last_theta - eta * gradient\n\n        if (abs(J(theta, X_b, y) - J(last_theta, X_b, y)) < epsilon):\n            break\n\n        i_iter += 1\n\n    return theta\nimport numpy as np\nimport matplotlib.pyplot as plt\nnp.random.seed(666)\nX = np.random.random(size=(1000, 10))\ntrue_theta = np.arange(1, 12, dtype=float)\nX_b = np.hstack([np.ones((len(X), 1)), X])\ny = X_b.dot(true_theta) + np.random.random(size=1000)\nX_b = np.hstack([np.ones((len(X), 1)), X])\ninit_theta = np.zeros(X_b.shape[1])\n\neta = 0.001\ngradient_descent(dJ_debug, X_b, y, init_theta, eta)\n\n输出结果：\n\narray([6.4206869 , 2.08303468, 2.56076208, 3.15680035, 4.41844686,\n       5.2150793 , 5.80241598, 6.80736408, 7.5672971 , 8.47769298,\n       9.31966978])\ntheta = gradient_descent(dJ_math, X_b, y, init_theta, eta)\ntheta\n\n输出结果：\n\narray([6.4206869 , 2.08303468, 2.56076208, 3.15680035, 4.41844686,\n       5.2150793 , 5.80241598, 6.80736408, 7.5672971 , 8.47769298,\n       9.31966978])\n我是尾巴\n\n本次推荐：图片在线压缩工具\n\n据说好多人早上看时间不是为了起床，而是看还能睡多久。我也一样！\n\n继续加油~\n\n编辑于 04-07\n梯度下降\n机器学习\n线性回归\n​赞同 8​\n​10 条评论\n​分享\n​收藏\n​\n推荐阅读\n机器学习之线性回归(linear regression)\n朱涛\n机器学习：用梯度下降法实现线性回归\n大鱼\n机器学习理论（二）简单线性回归\n小小\n机器学习优化器Optimizer的总结\n\n前沿： 机器学习中，通常有很多方法来试图寻找模型的最优解。比如常见的梯度下降法、动量优化法、自适应学习率优化算法等等，下面来一一介绍：一、梯度下降法(Gradient Descent)在微积分中…\n\n千寻\n发表于小小算法工...\n10 条评论\n​切换为时间排序\n写下你的评论...\n\n\n发布\n精选评论（1）\n跟我回江南\n2019-08-16\n\n3.在改进sgd的那部分代码里：①应该是gradient=dj_sgd(theta,x_new[i,:],y_new[i]) ，因为这里你要用的是已经打乱顺序的。②theta=theta-(learning_rate(cur_iner*m+i+1)*gradient).reshape(-1,1) 这个计算执行多少次的时候我觉得应该+1，不然你计算第一个样本点的时候，里面是0，但其实是第一步了已经。\n\n​赞\n​查看回复\n​回复\n​踩\n​举报\n评论（10）\n跟我回江南\n2019-08-16\n\n1.在可视化梯度下降的时候，第四行应该是history_theta=[]。不然会把初始点重复2次，所以你len=46.其实应该是45.因为你把0重复了两次\n\n​1\n​回复\n​踩\n​举报\n小小 (作者) 回复跟我回江南\n2019-08-16\n好的👌\n​赞\n​回复\n​踩\n​举报\n跟我回江南\n2019-08-16\n\n2.多元线性回归的第五行 括号里还少一个括号 不然符号有问题\n\n​1\n​回复\n​踩\n​举报\n小小 (作者) 回复跟我回江南\n2019-08-16\n厉害👍\n​赞\n​回复\n​踩\n​举报\n跟我回江南\n2019-08-16\n\n3.在改进sgd的那部分代码里：①应该是gradient=dj_sgd(theta,x_new[i,:],y_new[i]) ，因为这里你要用的是已经打乱顺序的。②theta=theta-(learning_rate(cur_iner*m+i+1)*gradient).reshape(-1,1) 这个计算执行多少次的时候我觉得应该+1，不然你计算第一个样本点的时候，里面是0，但其实是第一步了已经。\n\n​赞\n​回复\n​踩\n​举报\n小小 (作者) 回复跟我回江南\n2019-08-17\n\n前两个你说的对，但第三个我觉得是这样：首先+1不+1我觉得无所谓，因为learning_rate这个函数起始就是一个衰减的学习率，无非是从t0/（t1+1）和t0/t1的区别，这里因为提前定义了t0=5和t1=50，所以learning（0）=0.1，learning（1）=5/51=0.098，所以加不加都无所谓的。只要 最终学习率是减小的就行。\n\n​赞\n​回复\n​踩\n​举报\n小小 (作者) 回复跟我回江南\n2019-08-17\n\n第三点的第二个问题：关于reshape，行向量和列向量都无所谓，只需要将系数和截距分开就行。不过理论上来说应该是个列向量。\n\n​赞\n​回复\n​踩\n​举报\n跟我回江南\n2019-08-18\n\n是的。\n\n​赞\n​回复\n​踩\n​举报\namber\n2019-12-26\n\n不知道作者是不是根据刘宇波的教程改写？\n\n​赞\n​回复\n​踩\n​举报\n小小 (作者) 回复amber\n2019-12-26\n我不知道刘什么是谁，我不认识他\n​赞\n​回复\n​踩\n​举报", "images": ["https://pic1.zhimg.com/v2-d8b26aae6e57779021895e63c5ece70e_1440w.jpg", "https://pic1.zhimg.com/v2-2ead2fd1565f113c9b6bc76b2bd2fa30_xs.jpg", "data:image/svg+xml;utf8,<svg xmlns='http://www.w3.org/2000/svg' width='1537' height='695'></svg>", "https://www.zhihu.com/equation?tex=%5Cfrac%7BdJ%28%5Ctheta%29%7D%7Bd%5Ctheta%7D", "https://www.zhihu.com/equation?tex=%5Ctheta", "https://www.zhihu.com/equation?tex=%5Ctheta+", "https://www.zhihu.com/equation?tex=-%5Ceta%5Cfrac%7BdJ%28%5Ctheta%29%7D%7Bd%5Ctheta%7D", "https://www.zhihu.com/equation?tex=%5Ceta", "data:image/svg+xml;utf8,<svg xmlns='http://www.w3.org/2000/svg' width='1541' height='716'></svg>", "https://www.zhihu.com/equation?tex=J%28%5Ctheta%29%3D%5Csum_%7Bi%3D1%7D%5Em%28y%5E%7B%28i%29%7D-%5Chat%7By%7D%5E%7B%28i%29%7D%29%5E2", "data:image/svg+xml;utf8,<svg xmlns='http://www.w3.org/2000/svg' width='673' height='441'></svg>", "data:image/svg+xml;utf8,<svg xmlns='http://www.w3.org/2000/svg' width='654' height='435'></svg>", "data:image/svg+xml;utf8,<svg xmlns='http://www.w3.org/2000/svg' width='707' height='452'></svg>", "https://www.zhihu.com/equation?tex=J%28%5Ctheta%29", "data:image/svg+xml;utf8,<svg xmlns='http://www.w3.org/2000/svg' width='671' height='393'></svg>", "https://www.zhihu.com/equation?tex=-%5Ceta+%5Cbigtriangledown+J", "https://www.zhihu.com/equation?tex=%5Cbigtriangledown+J%28%5Ctheta_%7B0%7D%2C%5Ctheta_%7B1%7D%2C%5Cdots%2C%5Ctheta_%7Bn%7D%29+%3D+%28%5Cfrac%7B%5Cpartial%7BJ%7D%7D%7B%5Cpartial%5Ctheta_%7B0%7D%7D%2C+%5Cfrac%7B%5Cpartial%7BJ%7D%7D%7B%5Cpartial%5Ctheta_%7B1%7D%7D%2C+%5Cdots%2C+%5Cfrac%7B%5Cpartial%7BJ%7D%7D%7B%5Cpartial%5Ctheta_%7Bn%7D%7D%29", "https://www.zhihu.com/equation?tex=%5Csum_%7Bi%3D1%7D%5Em%28y%5E%7B%28i%29%7D-%5Chat+y%5E%7B%28i%29%7D%29%5E2", "https://www.zhihu.com/equation?tex=%5Chat+y%5E%7B%28i%29%7D+%3D+%5Ctheta_%7B0%7D+%2B+%5Ctheta_%7B1%7DX_%7B1%7D%5E%7B%28i%29%7D+%2B++%5Ctheta_%7B2%7DX_%7B2%7D%5E%7B%28i%29%7D+%2B+%5Cdots%2B+%5Ctheta_%7Bn%7DX_%7Bn%7D%5E%7B%28i%29%7D", "https://www.zhihu.com/equation?tex=%5Csum_%7Bi%3D1%7D%5Em%28y%5E%7B%28i%29%7D-+%28%5Ctheta_%7B0%7D+%2B+%5Ctheta_%7B1%7DX_%7B1%7D%5E%7B%28i%29%7D+%2B++%5Ctheta_%7B2%7DX_%7B2%7D%5E%7B%28i%29%7D+%2B+%5Cdots%2B+%5Ctheta_%7Bn%7DX_%7Bn%7D%5E%7B%28i%29%7D%29%29%5E2", "https://www.zhihu.com/equation?tex=%5Cbigtriangledown+J%28%5Ctheta%29+%3D+%5Cbegin+%7Bbmatrix%7D++%5Cfrac%7B%5Cpartial+J%7D%7B%5Cpartial%5Ctheta_%7B0%7D%7D+%5C%5C+%5Cfrac%7B%5Cpartial+J%7D%7B%5Cpartial%5Ctheta_%7B1%7D%7D+%5C%5C+%5Cdots+%5C%5C+%5Cfrac%7B%5Cpartial+J%7D%7B%5Cpartial%5Ctheta_%7B2%7D%7D%5C%5C+%5Cend+%7Bbmatrix%7D+%3D++%5Cbegin+%7Bbmatrix%7D++%5Csum_%7Bi%3D1%7D%5Em2%28y%5E%7B%28i%29%7D-X%5E%7B%28i%29%7D%5Ctheta%29%5Ccdot%28-1%29%5C%5C+%5Csum_%7Bi%3D1%7D%5Em2%28y%5E%7B%28i%29%7D-X%5E%7B%28i%29%7D%5Ctheta%29%5Ccdot%28-X_%7B1%7D%5E%7B%28i%29%7D%29%5C%5C+%5Csum_%7Bi%3D1%7D%5Em2%28y%5E%7B%28i%29%7D-X%5E%7B%28i%29%7D%5Ctheta%29%5Ccdot%28-X_%7B2%7D%5E%7B%28i%29%7D%29%5C%5C+%5Cdots+%5C%5C+%5Csum_%7Bi%3D1%7D%5Em2%28y%5E%7B%28i%29%7D-X%5E%7B%28i%29%7D%5Ctheta%29%5Ccdot%28-X_%7Bn%7D%5E%7B%28i%29%7D%29+%5Cend+%7Bbmatrix%7D+%3D2%5Ccdot%5Cbegin+%7Bbmatrix%7D++%5Csum_%7Bi%3D1%7D%5Em%28y%5E%7B%28i%29%7D-X%5E%7B%28i%29%7D%5Ctheta%29%5Ccdot%28-1%29%5C%5C+%5Csum_%7Bi%3D1%7D%5Em%28y%5E%7B%28i%29%7D-X%5E%7B%28i%29%7D%5Ctheta%29%5Ccdot%28-X_%7B1%7D%5E%7B%28i%29%7D%29%5C%5C+%5Csum_%7Bi%3D1%7D%5Em%28y%5E%7B%28i%29%7D-X%5E%7B%28i%29%7D%5Ctheta%29%5Ccdot%28-X_%7B2%7D%5E%7B%28i%29%7D%29%5C%5C+%5Cdots+%5C%5C+%5Csum_%7Bi%3D1%7D%5Em%28y%5E%7B%28i%29%7D-X%5E%7B%28i%29%7D%5Ctheta%29%5Ccdot%28-X_%7Bn%7D%5E%7B%28i%29%7D%29+%5Cend+%7Bbmatrix%7D", "https://www.zhihu.com/equation?tex=%5Cfrac1m", "https://www.zhihu.com/equation?tex=%5Cfrac%7B1%7D%7Bm%7D%5Csum_%7Bi%3D1%7D%5Em%28y%5E%7B%28i%29%7D-%5Chat+y%5E%7B%28i%29%7D%29%5E2", "https://www.zhihu.com/equation?tex=%5Cbigtriangledown+J%28%5Ctheta%29+%3D+%5Cfrac%7B2%7D%7Bm%7D%5Cbegin+%7Bbmatrix%7D++%5Csum_%7Bi%3D1%7D%5Em%28y%5E%7B%28i%29%7D-X%5E%7B%28i%29%7D%5Ctheta%29%5Ccdot%28-1%29%5C%5C+%5Csum_%7Bi%3D1%7D%5Em%28y%5E%7B%28i%29%7D-X%5E%7B%28i%29%7D%5Ctheta%29%5Ccdot%28-X_%7B1%7D%5E%7B%28i%29%7D%29%5C%5C+%5Csum_%7Bi%3D1%7D%5Em%28y%5E%7B%28i%29%7D-X%5E%7B%28i%29%7D%5Ctheta%29%5Ccdot%28-X_%7B2%7D%5E%7B%28i%29%7D%29%5C%5C+%5Cdots+%5C%5C+%5Csum_%7Bi%3D1%7D%5Em%28y%5E%7B%28i%29%7D-X%5E%7B%28i%29%7D%5Ctheta%29%5Ccdot%28-X_%7Bn%7D%5E%7B%28i%29%7D%29+%5Cend+%7Bbmatrix%7D+%3D%5Cfrac%7B2%7D%7Bm%7D%5Cbegin+%7Bbmatrix%7D++%5Csum_%7Bi%3D1%7D%5Em%28y%5E%7B%28i%29%7D-X%5E%7B%28i%29%7D%5Ctheta%29%5Ccdot%28-X_%7B0%7D%5E%7B%28i%29%7D%29%5C%5C+%5Csum_%7Bi%3D1%7D%5Em%28y%5E%7B%28i%29%7D-X%5E%7B%28i%29%7D%5Ctheta%29%5Ccdot%28-X_%7B1%7D%5E%7B%28i%29%7D%29%5C%5C+%5Csum_%7Bi%3D1%7D%5Em%28y%5E%7B%28i%29%7D-X%5E%7B%28i%29%7D%5Ctheta%29%5Ccdot%28-X_%7B2%7D%5E%7B%28i%29%7D%29%5C%5C+%5Cdots+%5C%5C+%5Csum_%7Bi%3D1%7D%5Em%28y%5E%7B%28i%29%7D-X%5E%7B%28i%29%7D%5Ctheta%29%5Ccdot%28-X_%7Bn%7D%5E%7B%28i%29%7D%29+%5Cend+%7Bbmatrix%7D+", "https://www.zhihu.com/equation?tex=J%28%5Ctheta%29%3D%5Cfrac%7B1%7D%7B2m%7D%5Csum_%7Bi%3D1%7D%5Em%28y%5E%7B%28i%29%7D-%5Chat+y%5E%7B%28i%29%7D%29%5E2", "https://www.zhihu.com/equation?tex=%5Cbigtriangledown+J%28%5Ctheta%29+%3D%5Cfrac%7B2%7D%7Bm%7D%5Cbegin+%7Bbmatrix%7D++%5Csum_%7Bi%3D1%7D%5Em%28y%5E%7B%28i%29%7D-X%5E%7B%28i%29%7D%5Ctheta%29%5Ccdot%28-X_%7B0%7D%5E%7B%28i%29%7D%29%5C%5C+%5Csum_%7Bi%3D1%7D%5Em%28y%5E%7B%28i%29%7D-X%5E%7B%28i%29%7D%5Ctheta%29%5Ccdot%28-X_%7B1%7D%5E%7B%28i%29%7D%29%5C%5C+%5Csum_%7Bi%3D1%7D%5Em%28y%5E%7B%28i%29%7D-X%5E%7B%28i%29%7D%5Ctheta%29%5Ccdot%28-X_%7B2%7D%5E%7B%28i%29%7D%29%5C%5C+%5Cdots+%5C%5C+%5Csum_%7Bi%3D1%7D%5Em%28y%5E%7B%28i%29%7D-X%5E%7B%28i%29%7D%5Ctheta%29%5Ccdot%28-X_%7Bn%7D%5E%7B%28i%29%7D%29+%5Cend+%7Bbmatrix%7D", "https://www.zhihu.com/equation?tex=%5Cbigtriangledown+J%28%5Ctheta%29+%3D++%5Cfrac%7B2%7D%7Bm%7D%28X%5E%7B%281%29%7D%5Ctheta-y%5E%7B%281%29%7D%2C+%5Cquad+X%5E%7B%282%29%7D%5Ctheta-y%5E%7B%282%29%7D%2C%5Cquad%5Cdots%2C%5Cquad+X%5E%7B%28n%29%7D%5Ctheta-y%5E%7B%28n%29%7D%29+%5Cquad+%5Ccdot", "https://www.zhihu.com/equation?tex=%5Cbegin+%7Bbmatrix%7D+X_%7B0%7D%5E%7B%281%29%7D+%5Cquad+X_%7B1%7D%5E%7B%281%29%7D+%5Cquad+X_%7B2%7D%5E%7B%281%29%7D+%5Cdots+%5Cquad+X_%7Bn%7D%5E%7B%281%29%7D%5C%5C+X_%7B0%7D%5E%7B%282%29%7D+%5Cquad+X_%7B1%7D%5E%7B%282%29%7D+%5Cquad+X_%7B2%7D%5E%7B%282%29%7D+%5Cdots+%5Cquad+X_%7Bn%7D%5E%7B%282%29%7D%5C%5C+X_%7B0%7D%5E%7B%283%29%7D+%5Cquad+X_%7B1%7D%5E%7B%283%29%7D+%5Cquad+X_%7B2%7D%5E%7B%283%29%7D+%5Cdots+%5Cquad+X_%7Bn%7D%5E%7B%283%29%7D%5C%5C+%5Cdots++%5C%5C+X_%7B0%7D%5E%7B%28m%29%7D+%5Cquad+X_%7B1%7D%5E%7B%28m%29%7D+%5Cquad+X_%7B2%7D%5E%7B%28m%29%7D+%5Cdots+%5Cquad+X_%7Bn%7D%5E%7B%28m%29%7D%5C%5C+%5Cend+%7Bbmatrix%7D+%3D+%5Cfrac%7B2%7D%7Bm%7D+%28X%5Ctheta+-+y%29%5ET+%5Ccdot+X", "https://www.zhihu.com/equation?tex=X+%3D+%5Cleft%5B+%5Cbegin%7Bmatrix%7D+1+%26+X_%7B1%7D%5E%7B%281%29%7D+%26+X_%7B2%7D%5E%7B%281%29%7D++%26+%5Cdots+%26+X_%7Bn%7D%5E%7B%281%29%7D++%5C%5C+1+%26+X_%7B1%7D%5E%7B%282%29%7D+%26+X_%7B2%7D%5E%7B%282%29%7D++%26+%5Cdots+%26+X_%7Bn%7D%5E%7B%282%29%7D++%5C%5C+%5Cdots+%26+%5Cqquad+%26+%5Cqquad+%26+%5Cqquad+%26%5Cdots+%5C%5C+1+%26+X_%7B1%7D%5E%7B%28m%29%7D+%26+X_%7B2%7D%5E%7B%28m%29%7D++%26+%5Cdots+%26+X_%7Bn%7D%5E%7B%28m%29%7D++%5C%5C+%5Cend%7Bmatrix%7D+%5Cright%5D+%5Cqquad++%5Ctheta%3D+%5Cleft%5B+%5Cbegin%7Bmatrix%7D+%5Ctheta_%7B0%7D+%5C%5C+%5Ctheta_%7B1%7D+%5C%5C+%5Ctheta_%7B2%7D+%5C%5C+%5Cdots+%5C%5C+%5Ctheta_%7Bn%7D+%5C%5C+%5Cend%7Bmatrix%7D+%5Cright%5D+", "https://www.zhihu.com/equation?tex=X", "https://www.zhihu.com/equation?tex=X%5Ctheta+", "https://www.zhihu.com/equation?tex=%28X%5Ctheta-y%29%5ET", "https://www.zhihu.com/equation?tex=%28X%5Ctheta-y%29%5ET+%5Ccdot+X", "https://www.zhihu.com/equation?tex=%5Cbigtriangledown+J%28%5Ctheta%29+%3D%5Cfrac%7B2%7D%7Bm%7D%5Cbegin+%7Bbmatrix%7D++%5Csum_%7Bi%3D1%7D%5Em%28y%5E%7B%28i%29%7D-X%5E%7B%28i%29%7D%5Ctheta%29%5Ccdot%28-X_%7B0%7D%5E%7B%28i%29%7D%29%5C%5C+%5Csum_%7Bi%3D1%7D%5Em%28y%5E%7B%28i%29%7D-X%5E%7B%28i%29%7D%5Ctheta%29%5Ccdot%28-X_%7B1%7D%5E%7B%28i%29%7D%29%5C%5C+%5Csum_%7Bi%3D1%7D%5Em%28y%5E%7B%28i%29%7D-X%5E%7B%28i%29%7D%5Ctheta%29%5Ccdot%28-X_%7B2%7D%5E%7B%28i%29%7D%29%5C%5C+%5Cdots+%5C%5C+%5Csum_%7Bi%3D1%7D%5Em%28y%5E%7B%28i%29%7D-X%5E%7B%28i%29%7D%5Ctheta%29%5Ccdot%28-X_%7Bn%7D%5E%7B%28i%29%7D%29+%5Cend+%7Bbmatrix%7D+%3D+%5Cfrac%7B2%7D%7Bm%7D+%5Ccdot+X%5ET+%5Ccdot+%28X+%5Ctheta+-+y%29", "https://www.zhihu.com/equation?tex=2++%5Cbegin+%7Bbmatrix%7D+%28X%5E%7B%28i%29%7D%5Ctheta+-y%5E%7B%28i%29%7D%29+%5Ccdot+X_%7B0%7D%5E%7B%28i%29%7D+%5C%5C+%28X%5E%7B%28i%29%7D%5Ctheta+-y%5E%7B%28i%29%7D%29+%5Ccdot+X_%7B1%7D%5E%7B%28i%29%7D+%5C%5C+%28X%5E%7B%28i%29%7D%5Ctheta+-y%5E%7B%28i%29%7D%29+%5Ccdot+X_%7B2%7D%5E%7B%28i%29%7D+%5C%5C+%5Cdots+%5C%5C+%28X%5E%7B%28i%29%7D%5Ctheta+-y%5E%7B%28i%29%7D%29+%5Ccdot+X_%7Bn%7D%5E%7B%28i%29%7D+%5C%5C+%5Cend+%7Bbmatrix%7D+%3D+2+%5Ccdot+%28X%5E%7B%28i%29%7D%29%5ET+%5Ccdot+%28X%5E%7B%28i%29%7D+%5Ctheta+-+y%5E%7B%28i%29%7D%29", "https://www.zhihu.com/equation?tex=%5Ceta+%3D+%5Cfrac%7B1%7D%7Bi%5C_iters%7D+%5Cto+%5Ceta+%3D+%5Cfrac%7B1%7D%7Bi%5C_iters+%2B+b%7D+%5Cto+%5Ceta+%3D+%5Cfrac%7B1%2Ba%7D%7Bi%5C_iters%2Bb%7D+", "data:image/svg+xml;utf8,<svg xmlns='http://www.w3.org/2000/svg' width='394' height='178'></svg>", "data:image/svg+xml;utf8,<svg xmlns='http://www.w3.org/2000/svg' width='1374' height='698'></svg>", "https://www.zhihu.com/equation?tex=%5Ctheta+%3D+%28%5Ctheta_%7B0%7D%2C+%5Ctheta_%7B1%7D%2C+%5Ctheta_%7B2%7D%2C+%5Cdots+%2C%5Ctheta_%7Bn%7D%29", "https://www.zhihu.com/equation?tex=%5Cfrac%7B%5Cpartial+J%7D%7B%5Cpartial+%5Ctheta%7D+%3D+%5Cfrac%7B%5Cpartial+J%7D%7B%5Cpartial+%5Ctheta_%7B0%7D%7D%2B%5Cfrac%7B%5Cpartial+J%7D%7B%5Cpartial+%5Ctheta_%7B1%7D%7D%2B%5Cfrac%7B%5Cpartial+J%7D%7B%5Cpartial+%5Ctheta_%7B2%7D%7D%2B%5Cdots+%2B+%5Cfrac%7B%5Cpartial+J%7D%7B%5Cpartial+%5Ctheta_%7Bn%7D%7D", "https://www.zhihu.com/equation?tex=%5Ctheta_%7B0%7D%5E%2B+%3D+%28%5Ctheta_%7B0%7D%2B%5Cepsilon%2C+%5Ctheta_%7B1%7D%2C+%5Ctheta_%7B1%7D%2C%5Cdots%2C%5Ctheta_%7Bn%7D%29", "https://www.zhihu.com/equation?tex=%5Ctheta_%7B0%7D%5E-+%3D+%28%5Ctheta_%7B0%7D-%5Cepsilon%2C+%5Ctheta_%7B1%7D%2C+%5Ctheta_%7B1%7D%2C%5Cdots%2C%5Ctheta_%7Bn%7D%29", "https://www.zhihu.com/equation?tex=%5Cfrac+%7B%5Cpartial+J%7D%7B%5Cpartial+%5Ctheta_%7B0%7D%7D+%3D+%5Cfrac%7BJ%28%5Ctheta_%7B0%7D%5E%7B%2B%7D%29-J%28%5Ctheta_%7B0%7D%5E-%29%7D%7B2+%5Cepsilon%7D+%5Cdots", "https://pic3.zhimg.com/v2-51c619a7179c07e38b60ee8a7a0cd630_250x0.jpg", "https://pic3.zhimg.com/v2-d3d92ad8bdb70fd5ccffd5edafc81cf1_250x0.jpg", "https://pic3.zhimg.com/v2-fdcf86596d1e37ff459eceba76402416_250x0.jpg", "https://pic3.zhimg.com/v2-53c7d3b26d55f3ce22ba3c0cb31d63ce_s.jpg", "https://pic1.zhimg.com/v2-2ead2fd1565f113c9b6bc76b2bd2fa30_s.jpg", "https://pic3.zhimg.com/v2-462b0f83c6b2852d3e337046ec9f130b_s.jpg"], "url": "https://zhuanlan.zhihu.com/p/77253076", "title": {"url": "https://zhuanlan.zhihu.com/p/77253076", "title": "机器学习理论（四）线性回归中的梯度下降法 - 知乎"}}, {"is_can_visited": true, "text": "首发于\n深度思考\n写文章\n关于在Keras中多标签分类器训练准确率问题\n极简AI·小宋是呢\n微信公众号：极简AI·沉迷深度学习~专注深度思考\n2 人赞同了该文章\n[知乎作答]·关于在Keras中多标签分类器训练准确率问题\n\n本文来自知乎问题 关于在CNN中文本预测sigmoid分类器训练准确率的问题？中笔者的作答，来作为Keras中多标签分类器的使用解析教程。\n\n\n\n\n一、问题描述\n关于在CNN中文本预测sigmoid分类器训练准确率的问题？\n对于文本多标签多分类问题，目标标签形如[ 0 0 1 0 0 1 0 1 0 1 ]。在CNN中，sigmoid分类器训练、测试的准确率的判断标准是预测准确其中一个标签即为预测准确还是怎样。如何使sigmoid分类器的准确率的判断标准为全部预测准确即为预测准确。有什么解决方案？\n\n\n\n\n二、问题回复\n\n\n\n\n问题中提出的解决多标签多分类问题的解决方法是正确的。但是要注意几点，keras里面使用这种方式的acc是二进制acc，会把多标签当做单标签计算。\n\n什么意思呢？举个例子，输入一个样本训练，共有十个标签，其中有两个为1，而你预测结果为全部是0，这时你得到准确率为0.8。最后输出的ac是所有样本的平均。可以看出这个准确率是不可信的。\n\n解决方法如下:重写acc评价指标，笔者自己写了一个多标签分类的acc，一个样本里，只有全部标签都对应上才acc为1，有一个不对就为0。\n\n\n\n\n​\n\nacc是keras输出acc，my_acc是多标签acc，因为使用了数据增强，valacc更高。\n\n\n\n\n由于每个label的比例不同，又测试不同权重重写loss来对比。发现通过调整合适权重可以，相同参数下可以达到更优效果。\n\n\n\n\n​\n\n\n\n\n设置合适的权重值，val_acc上升了，val多标签acc也达到了更高。\n\n关于如何设置合适权重，笔者还在实验中，可以关注下笔者的知乎和博客。后面实验结果会及时更新。\n\n发布于 2019-06-20\n深度学习（Deep Learning）\nKeras\n​赞同 2​\n​添加评论\n​分享\n​收藏\n​\n文章被以下专栏收录\n深度思考\n发散思维，一起做深度的思考\n进入专栏\n推荐阅读\n实战|手把手教你训练一个基于Keras的多标签图像分类器\n鑫鑫淼淼焱...\n发表于机器学习与...\nKeras深度学习实践2—二分类、多分类和标量回归问题简单实现\n小可\n一种Dynamic ReLU：自适应参数化ReLU（调参记录26）Cifar10~95.92%\namaze...\n发表于Dynam...\n用小样本数据集构建强大的图像分类模型\nmpcv\n还没有评论\n写下你的评论...\n\n\n发布\n2 人赞同了\nChanvre\n​\n239 回答548 关注者\n​关注她\n薛定谔的猫\n5 关注者\n​关注她", "images": ["https://pic4.zhimg.com/v2-78a4d34708faf87e67dd1e5d5adbf779_1440w.jpg", "https://pic4.zhimg.com/v2-d5ac1f7b6a20b1f8bae95450d76c08c9_xs.jpg", "data:image/svg+xml;utf8,<svg xmlns='http://www.w3.org/2000/svg' width='640' height='480'></svg>", "https://pic1.zhimg.com/v2-6de33a717b47725219ee607803fbf935_xs.jpg", "https://pic4.zhimg.com/v2-46c97726629d1a3fccf67f83d3acdb31_250x0.jpg", "https://pic3.zhimg.com/v2-e475400ac3ad752469be2b39863e742f_250x0.jpg", "https://pic3.zhimg.com/v2-0c78a3b1fba5365255b771e2323bd2fd_250x0.jpg", "https://pic3.zhimg.com/v2-b2918687b863c7d2b9886e0eb0dd6fb0_250x0.jpg", "https://pic4.zhimg.com/v2-e0c23c778fd64759ce8c8b91ac3e830d_im.jpg", "https://pic1.zhimg.com/v2-e5c59e2f818dc6c59c9e14726dc4d5bd_im.jpg"], "url": "https://zhuanlan.zhihu.com/p/69897718?from_voters_page=true", "title": {"url": "https://zhuanlan.zhihu.com/p/69897718?from_voters_page=true", "title": "关于在Keras中多标签分类器训练准确率问题 - 知乎"}}, {"is_can_visited": true, "text": "首发于\nhtfhxx学习笔记分享\n写文章\n《Neural Network Methods in NLP》 笔记\n长腿咚咚咚\n// 不与傻瓜论短长\n81 人赞同了该文章\n\n在刚接触机器学习的时候，看了周志华老师的《机器学习》，其中的概念和举例对入门机器学习很有帮助，李航老师的《统计学习方法》更是用严谨的定义和详细的公式对机器学习进行了补充。而在理论基础支撑的实践层面，使用机器学习算法可以对结构化数据进行分析、预测等各种各样的操作。\n\n结构化数据比较直观，可是文本数据该怎么表示和处理呢？ 《Neural Network Methods in Natural Language Processing》这本书给了答案，这本书是一本非常适合入门自然语言处理的书籍，足够薄，最关键的是有中文版。。。是哈工大车万翔老师团队翻译的，在一定程度上做到了权威。不过有的地方翻译的意思有出入，对照英文版就可以了。\n\n本书可分为四部分。整体虽然划分开，但是想法比较串联，容易从0开始构建自然语言数据处理方法的认知。第一部分介绍神经网络的基础。第二部分介绍自然语言数据的处理。第三部分介绍特殊的深度学习结构。第四部分是一些非核心主题，我觉得相比之下，一些会议的Tutorials更值得阅读。\n\n\n\n\n以下是我在阅读过程中的笔记，或者说是我摘录的重点，可以快速重复阅读的那种。\n\n如果觉得排版不舒服，可以点击我分享的有道云笔记页面：笔记\n\n如果觉得有用，在收藏时请不要忘记点赞！~\n\n一、引言\n自然语言三个特性。离散性（ 语言是符号化和离散的）、组合性(字母形成单词，单词形成短语和句子) 和 稀疏性（以上性质的组合导致了数据稀疏性）\n有两种主要的神经网络结构，即前馈网络（ feed-forward network）和循环／递归网络(recurrent/ recursive network），它们可以以各种方式组合。\n循环神经网络 （RNN）是适于序列数据的特殊模型，循环网络很少被当作独立组件应用，其能力在于可被当作可训练的组件“喂”给其他网络组件，然后串联地训练它们。例如，循环网络的输出可以“喂”给前馈网络，用于预测一些值 。循环网络被用作一个输入转换器，其被训练用于产生富含信息的表示，前馈网络将在其上进行运算。\n前馈网络，也叫 多层感知器（ Multi Layer Perceptron , MLP），其输入大小固定，对于变化的输入长度，我们可以忽略元素的顺序。\n循环网络打破自然语言处理中存在几十年的马尔可夫假设，设计能依赖整个句子的模型，并在需要的情况下考虑词的顺序，同时不太受由于数据稀疏造成的统计估计问题之苦。\n语言模型 (language modeling）指的是预测序列中下一个单词的概率（等价于预测一个序列的概率），是许多自然语言处理应用的核心 。\n大部分情况下，全连接前馈神经网络 CMLP 能被用来替代线性学习器 。 这包括二分类或多分类问题，以及更复杂的结构化预测问题 。网络的非线性以及易于整合预训练词嵌入的能力经常带来更高的分类精度\n二、学习基础与线性模型\n\n2. 1 有监督学习和参数化函数\n\n假设类 ：搜索所有可能的程序〈或函数〉是非常困难（和极其不明确）的问题，通常把函数限制在特定的函数簇内，比如所有的具有d_in个输人、 d_out个输出的线性函数所组成的函数空间，或者所有包含 d个变量的决策树空间 。 这样的函数簇被称作假设类.\n归纳偏置： 通过把搜索限制在假设类之中，我们向学习器中引入了归纳偏置（ inductive bias ）， 当学习器去预测其未遇到过的输入的结果时，会做一些假设。而学习算法中归纳偏置则是这些假设的集合，同时也使得搜索结果的过程更加高效。补充：归纳偏置可以看作学习算法自身在一个庞大的假设空间中对假设进行选择的启发式或者“价值观”。即天涯何处无芳草，却为什么偏偏选择你！！！\n假设类也确定了学习器可以表示什么、不可以表示什么 。学习器的目标是确定参数的值，因此，搜索函数空间的问题被缩减成了搜索参数空间的问题 。\n线性函数的假设类相当有限，有很多它无法表示的函数（的确，它只限于线性关系〉。具有隐层的前馈神经网络同样是参数化函数，但构成了一个非常强大的假设类一一它们是通用近似器，可以表示任意的波莱尔可测量函数。\n线性模型虽然表示能力有限，但它也有几个我们想要的性质 ： 训练简单高效，通常会得到凸优化目标，训练得到的模型也有点可解释性，它们在实践中往往非常有效 。它们也是更强大 的非线性前馈网络的基本模块。\n\n2. 2 训练集、测试集和验证集\n\n关于数据集划分：留一法——留一交叉验证：训练 k个函数 ，每次取出一个不同的样例 x作为测试集，剩余样本作为训练集，评价得到的函数 f预测的能力，最后选中一个表现最好的函数。非常浪费计算时间，只会在已标注样例数量 走特别小（小于 100 左右〉的时候使用 。在《统计学习方法》中，被叫做k折交叉验证\n留存集：划分训练集为两个子集，可以按80% / 20%划分，在较大的子集（训练集）上训练模型，在较小的子集（留存集， held-out set ）上测试模型的准确率。《统计学习方法》中，被叫做简单交叉验证。\n进行划分时要注意一些事情一一通常来说在划分数据前打乱样例，保证一个训练集和留存集之间平衡的样例分布是更好的。有时随机的划分不是一个好的选择：与时间相关的训练集如果进行随机划分就会有影响。\n三路划分：留存集（测试集）进行误差估计不能代表新实例的效果，不知道最终的分类器的设置在总体上是好的，还是仅仅在留存集中的特定样例上是好的 。已被接受的方法是使用一种把数据划分为训练集、验证集（也叫作开发集）和测试集的三路划分方法 。 这会给你两个留存集： 一个是验证集，一个是测试集 。 所有的实验、调参 、误差分析和模型选择都应该在验证集上进行 。 然后，最终模型在测试集上的一次简单运行将会给出它在未见实例上的期望质量的一个好的估计 。\n\n2. 3 线性模型\n\n非线性可分的情况下（不能使用一条直线或一个线性超平面将数据点分开), 解决方法要么是转换到更高维的空间（加入更多的特征），要么是转换到更丰富的假设类，或者允许一些误分类存在。\n特征表示：在大多数情况下这些数据点不会以特征列表的形式直接提供给我们，而是作为真实世界中的对象 。例如，我们被给予一系列公寓来分类。然后，我们需要做有意识的决定，手动选择我们认为对于分类任务有用的可测量属性 。就特征集合做出决定之后，我们创造一个特征抽取（ feature extraction）函数，它把真实世界的对象（公寓）映射成一个可测量量度（价格和大小）的向量，该向量可以作为我们模型的输入。\n线性模型设计的一个核心部分是特征函数的设计（所谓的特征工程 ）。深度学习的开创性之一是，它通过让模型设计者指定一个小的核心、基本或者自然的特征集，让可训练的神经网络结构将它们组合成更有意义的、更高层次的特征或者表示，从而大大地简化了特征工程的过程 。\nsign和sigmoid：将原本值域为负无穷到正无穷的结果，使用sign函数将结果映射到[-1,+1]可以得到二分类的结果，使用sigmoid 函数将结果映射到 [0,1]范围之内，即可计算决策的置信度或者分类器分配这个类别的概率。\n\n2.6 对数线性多分类\n\n多分类问题：不同于二分类的求得能将其分开的超平面的一个模型，n分类需要构建n个模型，每个模型预测一种结果的可能，最终的结果取决于最高分的模型所属于的结果。\nBOW( Bag-of-words）表示包含文档中所有单词的不考虑次序的信息 。一个独热表示可以被认为是一个单一单词的词袋 。CBOW(Continuous Bag Of Words) 连续单词词袋，表示可以通过求单词表示向量和或者通过将一个单词词袋向量乘以一个每一行对应于一个稠密单词表示的矩阵(嵌入矩阵 embedd ingmatricy)来得到。 1=\"A B C\" 2=\"A D\" BOW=[A B C D] CBOW=[A B C A D ]\nSigmoid和Softmax这两个概念有什么区别和联系\nsigmoid把一个值映射到0-1之间，常常使用于二分类，把线性预测转变为一个概率估计，从而得到一个对数线性模型。\nsoftmax。多分类情况中是把分数向量通过一个softmax，它将一个K维的任意实数向量映射成另一个K维的实数向量，其中向量中的每个元素取值都介于(0,1)之间并且和为1。\n\n2.7 训练和最优化\n\n关于损失函数：在大多数情况下，推荐使用常见的损失函数而不是自行定义。\nhinge （二分类）、hinge （ 多分类 ）、对数 （log ） 损失、二元交叉熵--逻辑斯蒂 (logistic）损失、分类交叉熵 （ categorical cross-entropy） 损失（* ?）、等级损失\n正则化方法：L1、L2、dropout\n随机梯度下降和基于minibatch的随机梯度下降：一个样本和一小批样本的区别\n三、从线性模型到多层感知器\n线性模型的局限性（只限于线性关系）：异或(XOR)函数,没有一条直线能够分割这两个类别。\n非线性输入转换：¢(x1,x2)＝［x1 * x2, x1 + x2］函数 ¢ 将数据映射为适合线性分类的表示。该解决方案有一个明显的问题，我们需要人工 。定义函数¢，此过程需要依赖特定的数据集 ，并且需要大量人类的直觉。\n核方法：通过定义一些通用的映射来解决上述问题。多项式映射， ¢(x)=(x)^d。d=2时，¢(x1,x2)=(x1x1,x1x2,x2x1,x2x2).对所有的变量进行两两组合.\n可训练的映射函数：映射函数可以采用参数化的线性模型形式，接一个作用于每一个输出维度上的非线性激活函数 g : y= ¢(x)(W+b)， ¢(x)= g(xW'+b')。自行定义g(x)和训练W‘、b’得到一组参数，即可获得一个映射。\n\n\n\n\n四、前馈神经网络\n完全连接层或仿射层：每个神经元连接到下一层中的所有神经元\n最简单的神经网络称作感知器，是一个简单的线性模型 ：NN(x)=xW+b.\n由线性变换产生的向量称为层 。 最外层的线性变换产生输出层，其他线性变换产生隐层 。 非线性激活操作接在每个隐层后面。由线性变换产生的层通常被称为完全连接的或仿射的。\nMLPl 是指带有单一隐层的多层感知机\n线性变换的维度计算：对一个输入维数 d_in ， 输出维数 d_out 的全连接层，有 l(x) =xW+ b ，其中 x 、 W、 b 的维数分别为 1 × d_in 、 d_in × d_out 、1× d_out。当输入的向量为行向量\n常见的非线性函数: 根据经验来看， ReLU 和 tanh 单元表现良好，显著地超过了 sigmoid\nsigmoid：σ(x)= l / (1 + e^(-x) ) 逻辑斯蒂函数，近来被认为不适合用在神经网络的内层\ntanh：tanh(x)=(e^(2x)-1) / (e^(2x)+1) 值域 [-1,1]\nhard tanh= -1(x<-1) 1(x>1) x(其他)\n修正线性单元（ ReLU) ：max(0, x) 在很多任务中都表现优异，尤其是使用dropout正则化的时候\n称为权重衰减的 L2 正则化在许多情况下能有效地实现良好的泛化性能。\ndropout也是一种防止神经网络过度拟合训 练数据的有效技术，旨在防止网络学习依赖于特定权重。在对每个训练样本进行随机梯度训练时，它随机丢弃网络(或特定层)中的一半神经元 。\ndropout细节：考虑具有两个隐层 (MLP2 )的多层感知器：\n从x到y的过程：NN(x)=y; h^1=g^1(xW^1+b^1); h^2=g^2(h^1 * W^2+b^2); y=h^2 *W^3;\n当在 MLP2 中使用dropout时，我们在每轮训练中随机地设置 h^1 和 h^2 的部分值为0, 通过将h^1乘一个掩码向量(元素值为0或1)，将乘得的结果代替原隐层h^1，传入下一层。\n相似和距离层：希望基于两向量计算一个标量值，反映出两向量间的相似性、兼容性或距离\n点积：两向量的同index数值相乘求和。\n欧式距离：两向量的同index数值的差的平方和。这是一个距离度量而不是相似度, 在这里, 小值表示相似，较大值表示不相似\n可训练形式：有时希望使用一个参数化函数，通过关注向量的特定维度，来进行训练以产生所需的相似度。常见的可训练相似度函数是双线性形式（ bilinear form) sim(u,v)=uWv\n\n\n\n\n五、神经网络训练\n计算图：一个有向无环图(DAG)，其中结点对应于数学运算或者变量，边对应于结点间计算值的流 。计算(a * b + 1) * (a * b +2):\na * b 的计算是共享的 。有一个限制条件，就是计算图是连通的。\n实践经验：\n优化算法：SGD收敛速度慢、Adam有效\n初始化：减少陷入局部最小的可能\n随机重启：多次训练，每次都随机初始化，选取验证集最好的一个\n梯度消失和梯度爆炸、饱和神经元与死神经元\n训练样本的随机打乱\n学习率的调整\n六、文本特征构造\n\n6. 1 NLP 分类问题中的拓扑结构\n\n词、文本、成对文本、上下文中的词、词之间的关系\n\n6.2 NLP 问题中的特征\n\n特征通常表现为标量indicator和可数count两种形式：条件是否出现，事件出现频率\n\n6.2.1直接观测特征\n\n单独词特征\n词元（booking, booked, books）和词干（book）\n词典资源（和其他词语连接起来或者提供额外的信息）例如wordNet\n分布信息（哪些词和当前词是类似的）\n文本特征：字符和词再文本中的数量和次序\n词袋（bag-of-words）：表示包含文档中所有单词的不考虑次序的信息 。词袋中各个词在文本中出现的数量，作为特征。\n权重：TF-IDF（TF * IDF，词频*逆向文件频率）：某词对于一个语料库中的其中一份文本的重要程度。某词在一篇文章中出现的频率TF高，并且在其他文章中很少出现，则认为此词或者短语具有很好的类别区分能力，适合用来分类。\nn元组\n上下文词特征\n词在句子和文本中，其在句子的位置、围绕它的词和字符都可以作为特征。越近信息量越大\n窗口：{ word-2=brown, word-l=fox, word+l=over, word+2=the ｝\n\n6.2.2 可推断的语言学特征\n\n自然语言中的句子除了是词语的线性排序外还是有结构的。这种结构遵循复杂的不易于直接观察到的规律，这些规律被归类为语法。文本的语言学特性并不能够从词在句子中或其顺序的外在表现直接观察到，它们能够以不同程度的准确率从文本句子中推断出来。\n语言学标注：\n成分树（ constituency tree），或短语结构树。\n依存树（ dependency tree），除了句子的中心词（通常是动词），每个句子中的词都被另一个词所引领，每个词都是另一个词的修饰。\n词性标签、句法角色、篇章关系、回指等概念是基于语言学理论的\n\n6.2.3 核心特征和组合特征 多用组合特征\n\n6.2.4 n 元组特征 在给定的长度下由连续的词序列组成，比单独的词富含更多信息\n\n6.2.5 分布特征\n\n\n\n\n七、NLP特征的案例分析\n7.1 文本分类：语言识别：字母级文法词袋（字母级别的特征）\n7.2 文本分类：主题分类：字母级别特征不合适，词为基本单位，例如二元文法词袋等\n7.3 文本分类：作者归属：避开内容词，侧重于文体属性（可以表现出来的特征list: 功能词与代词词袋，词性词袋，词性的n元文法词袋 ）\n7.4 上下文中的单词：词性标注：内部线索（单词、单词的字母前缀与后缀，是否大写、是否包含连字符、是否数字）+外部线索（上下文的单词的内部线索）\n7.5 上下文中的单词：命名实体识别：是一个序列分割任务，但通常被建模为序列标注任务，类似于词性标注。特征类似于词性标注，内部线索+外部线索\n7.6 上下文中单词的语言特征：介词词义消歧。特征：词本身（单词、词元、词性、前后缀、词簇or分布式表示）+信息量较大的上下文（固定窗口上下文可能不富含太多信息，可用启发式规则，举例：左边第一个动词右边第一个名词形成三元组特征、依存分析器-好用），也可以用外部资源（知识库wordNet）\n7.7 上下文中单词的关系：弧分解分析（依存分析任务）：给定长度为n的句子，有n*n个词关系，为每个词关系分配分数，得到一个最大化总体分数的有效的树。可构建特征：头词和修饰词的字面形式、词性、距离、方向、两者之间的词or词性等等。\n八、从文本特征到输入\n\n8.1 编码分类特征：独热编码(one-hot)和稠密嵌入向量\n\n稠密表示的主要益处是具有很强的泛化能力 (Page95)\n\n8.2 组合稠密向量（个人认为这章的特征很实用）\n\n每个特征对应一个稠密向量，需要用某种方式将不同的向量组合起来，主要有拼接、相加（或者平均）和同时使用拼接与相加 。\n\n基于窗口的特征\n\n位置i为中心词时，需要编码位置在 i-2、i-1、i+1、i+2 上的词。不关心窗口内词的位置：词向量求和a+b+c+d；关心：词向量拼接[a:b:c:d]；不关心顺序但是关心距离：加权求和0.5a+b+c+0.5d（距离越远权重越小）；不关心距离但是关心前后：拼接和相加组合，[a+b:c+d]\n\n显式拼接（[x: y: z]W＋b)，仿射变换 （ xU+ yV+zW+ b ）,如果后者参数矩阵互不相同，则两种方式是等价的。\n\n可变特征数目：连续词袋CBOW\n\n用于使用固定维度的向量表示任意数量的特征。\n\nCBOW 和传统的不考虑顺序信息的词袋表示非常相似，通过相加或者平均的方式组合特征的嵌入向量。or 加权CBOW，为不同向量赋予权重，权重可以是TF-IDF\n\n8.3 独热和稠密向量间的关系\n\n在训练神经网络时，使用稀疏独热向量作为输入，意味着使网络的第一层从训练数据中学习特征的稠密嵌入向量。当遇到多层前馈神经网络时，稠密和稀疏输入之间的区别会比起初看起来的更小。\n\n独热向量，通过与一个嵌入矩阵E的乘法操作，得到稠密向量。这个矩阵E的维度是V * d，d是每个词的表示维度，V是单词数表示有V行，每一行代表一个独热向量的对应的稠密向量。这样的嵌入层/查找层，即可将独热向量映射为稠密向量。\n\n8.4 杂项\n\n距离与位置特征\n\n一个句子中两个词的线性距离可能作为一个提供信息的特征。在传统 NLP 情景下，通常将距离分配到若干组（如 1, 2, 3, 4, 5-10, 10+）中，并且为每一组赋予一个 one hot向量。在神经网络框架中，输入并没有直接分配一个距离数值的入口，而是将传统分组的one hot向量映射到一个类似词嵌入的d(6)维向量，这些距离嵌入向量作为网络参数进行训练（个人理解，欢迎指正，Page104有例子）\n\n一些处理数据的tips\n补齐\n\n当使用拼接方法时，可以用零向量进行填充，这对于某些问题来说可能只是次优解，也许知道左侧没有修饰成分是有益的。推荐的做法是添加一个特殊符号（补齐符号〉到嵌入词表中，并且在上述情况中使用相应的补齐向量。根据要处理的问题不同，在不同情况下可能会使用不同的补齐向量 （比如左侧修饰缺失向量与右侧修饰缺失向量不同）。 这样的补齐对预测的准确性是很重要的，并且非常常用 。很多论文没提，只有源码才会看到。\n\n未登录词\n\n没有对应词嵌入向量时，保留一个特殊符号 UNK 表示未知记号来应对这种情况。同样对于不同的同表可能会使用不同的未知符号，但不管怎样，都不建议共享补齐和未登录向量，因为它们代表两种不同的情况 。\n\n词签名\n\n处理未登录词的另一种技术是将词的形式回退到词签名 。使用 UNK 符号表示未登录词是将所有未登陆词回退到同样的签名，但是根据要解决的问题的不同，可能使用更加细粒度的策略，比如用 一ing 符号代替以 ing 结尾的未登录词，等等。\n\n词丢弃\n\n在训练集中抽取特征时，用未登录符号随机替换单词。基于词频\n\n使用词丢弃进行正则化\n特征组合\n\n特征设计者不仅需要人工指定感兴趣的核心特征，同时要指定特征间的交互。（如除引人“词为 X”，“词性为 Y”的特征外，还有组合特征表示“词为 X 并且词性为 Y”）\n\n向量共享\n\n构建输入时，是否需要对特征用两个不同向量表示。经验问题。\n\n维度 ——每个特征分配的维度。速度和准确度取得一个良好平衡。\n网络的输出：k分类问题输出一个k维向量，每一维表示类别强度。\n\n8.5 例子：词性标注 词序列提取特征的细节\n\n8.6 例子：弧分解分析 包含两个词和中间文本的弧的特征提取细节\n\n九、语言模型\n\n9. 1 语言模型任务\n\n给某单词在一个词序列之后出现的可能性分配概率；给句子分配概率(一系列的词预测)\n马尔可夫假设：规定未来的状态和现在给定的状态是无关的。形式上， 一个走阶马尔可夫假设假设序列中下一个词只依赖于其前k个词。\n\n9. 2 语言模型评估：困惑度\n\n以应用为中心的度量方法通过在更高级别的任务中的性能来进行评价 。 例如， 当将翻译系统中的语言模型组件从 A 替换为 B 后,测量翻译质量提高的程度 。\n一个更直观的评估语言模型的方法是对于未见的句子使用困惑度\n\n是一种信息论测度，用来测量一个概率模型预测样本的好坏，困惑度越低越好 。给定一个包含n个词的文本语料和一个基于词语历史的用于为词语分配概率的语言模型函数 LM ,LM 在这个语料的困惑度最低，语言模型越好。\n\n9. 3 语言模型的传统方法\n\n语言模型的传统方法假设 h 阶马尔可夫性质\n预测从未在语料中观察到的序列，会出现0概率，造成极大困惑度，这是个很糟糕的情况。一种避免 0 概率事件的方法是使用平滑技术，确保为每个可能的情况都分配一个概率（可能非常小）。\n\nadd-α： 它假设每个事件除了语料中观测的情况外，至少还发生 α 次\n\n退避(back off)：如果没有观测到 h 元文法，那么就基于（k-1) 元文法计算一个估计值\n\n传统语言模型的限制：平滑技术错综复杂而且需要回退到低阶；将基于最大似然估计的语言模型应用于一个规模更大的 n 元文法是一个固有的问题；基于最大似然估计的语言模型缺乏对上下文的泛化。\n\n9. 4 神经语言模型\n\n非线性神经网络语言模型可以解决一些传统语言模型中的问题：它可以在增加上下文规模的同时参数仅呈线性增长，缓解了手工设计退避规则的需要，支持不同上下文的泛化性能 。\n介绍：神经网络的输入是k元文法，输出是下一个词的概率分布。输入的词经过词嵌入后，被传给一个拥有一个或多个隐层的多层感知机（MLP）\n训练、内存与计算效率、大规模输出空间（层次化softmax--构建huffman树、自归一化方法--没搞懂=_=）、期望特性、局限\n\n9. 5 使用语言模型进行生成\n\n9. 6 副产品：词的表示\n\n十、预训练的词表示\n\n词嵌入一一将每个特征表示为低维空间中的向量。这些向量来自哪里？本章对常见方法进行了调研\n\n10. 1 随机初始化\n\n当有足够的有监督训练数据可用时－，可以将特征嵌入看作与其他模型参数相同 ： 将词嵌入向量初始化为随机值，使用网络训练过程将它们调整为“好”的 向量 。\n\n10. 2 有监督的特定任务的预训练\n\n10. 3 无监督的预训练\n\n训练词向量的技术本质上是有监督学习的技术，不是对我们关心的任务进行监督，而是从原始文本创建几乎无限数量的有监督训练实例，并希望我们创建的任务将匹配（或足够接近）我们关心的最终任务。\n\n使用与训练的词嵌入，第一个选择是关于预处理，第二个选择是在这个任务上对预训练的向量进行微调 。\n\n10. 4 词嵌入算法（这章建议看英文原版参考）\n\n神经网络社区倾向于从分布式表示 distributed representations的角度思考 。自然语言处理社区倾向于从分布语义 distributional semantics的角度思考\n\n10. 4. 1 分布假设和词表示 Distributional hypothesis and word prepesentations\n\nexplore the distributional approach to word representation 词的分布表示\n\n关于语言和词义的分布式假设表明，在相同上下文中出现的词倾向于具有相似的含义。\n\n词－上下文矩阵 -- i行j列，表示 i 个单词 * j 维度。每列表示词出现的语言学上下文。\n相似性度量，词被表示为向量就可以通过计算向量相似度来计算词的相似度。\n\n余弦相似度(向量之间角度的余弦)、广义 Jaccard 相似度\n\n词——上下文权重和点互信息(PMI)\n\n在求得词上下文矩阵时，其通常基于来自大规模语料库的计数。\n\nPMI (w, c）通过计算词和上下文的联合概率（它们在一起的频率）与它们的边界概率（它们单独出现的频率）之间的比率的对数来测量词 w 和上下文 c 之间的关联 。减少过高的权重带来的不好的影响。（例如：the cat 和 a cat 可 以获得高于 cute cat 和 small cat 的分数，即使后者的信息量更多）\n\n通过矩阵因式分解进行降维\n\n将词表示为其出现的上下文的显式集合的潜在障碍是数据稀疏性。显式词向量具有非常高的维度。通过使用诸如奇异值分解(SVD)的降维技术来考虑数据的低阶表示，可以缓解这两个问题。\n\n10. 4. 2 从神经语言模型到分布式表示 From neural language models to distributed\n\nexplore the distributed approaches. 词的分布式表示\n\n与词分布表示——基于计数的方法相比，神经网络社区主张使用分布式来表示词义。\n\n考虑语言建模网络：通过词嵌入矩阵和上下文矩阵确定给定上下文的不同词的概率，为上下文的k元组生成一个概率，上下文矩阵和词嵌入矩阵就是分布式的词表示：训练过程决定了词嵌入的理想值。\nCollobert 和 Weston\nword2vec：CBOW、Skip-gram(觉得这章讲的有点过于细了，有点乱)\n\nword2Vec 模型训练带来了两个词嵌入矩阵 ，分别代表同和上下文矩阵 。 上下文嵌入会在训练后被丢弃，但保留了词嵌入。\n\n10.4.3 词语联系\n\n分布式“基于计数”的方法和分布式“神经”方法都是基于分布假设，尝试基于它们出现的上下文之间的相似性来捕获词之间的相似性。这两个方法之间的关系 比乍看之下更深。\n\n10. 4. 4 其他算法 NCE Glove\n\n10. 5 上下文的选择\n\n窗口方法(CBOW)、句子段落或文档(Skip-gram)、句法窗口（使用依存句法解析器自动解析文本，并将词的上下文视为解析树中邻近的词以及与之相关的句法关系 ）、多语种（使用多语种、基于翻译的上下文，例如与其对齐的外语单词）、基于字符级别和子词的表示（从一个词的组成字符中生成向量表示）\n\n10. 6 处理多字单元和字变形\n\n问题：1. 对多字分配单一变量、2. 形态学变形使有相同潜在概念的词不同。\n可以通过对文本进行确定性预处理从而达到合理的程度，以至于更好地适应所想要的词语定义。可以生成多符号串词条列表，并用文本替换单个实体（即用 New_ York 替换 New York 的出现）\n在变形的情况下，对语料预处理，包括对部分或全部词汇抽取词干，对词干嵌入而不是对其变形形式嵌入。\n\n10. 7 分布式方法的限制\n\n相似性的定义、害群之马（词的琐碎属性）、反义词（反而会出现在相似的情境）、语料库偏好、语境缺乏\n\n\n\n\n\n\n\n十一、使用词嵌入\n\n本章讨论一部分词向量的用途。\n\n11. 1 词向量的获取\n\nword2Vec 可获取的单独的二进制文件、GenSim的python包、允许使用任意上下文信息的改进版二进制 Word2Vec、斯坦福发布的GloVe 模型的有效实现等等……\n\n11. 2 词的相似度（利用向量之间的相似度函数计算两个词的相似度：余弦相似度）、11. 3 词聚类、11 .4 寻找相似词、11. 5 同中选异、11. 6 短文档相似度、11. 7 词的类比（king - man - woman = queen）、11. 8 （对词向量的）改装和映射、11. 9 实用性和陷阱（当使用现成的词向量时，最好使用与源语料相同的切分词项的方法和文本规范化方法。仍然建议不要这样像黑盒方法一样盲目地下载和使用这些资源）\n\n\n\n\n十二、案例分析：一种用于句子意义推理的前馈结构\n\n12. 1 自然语言推理与 SNLI 数据集\n\n文本蕴含任务：两文本的关系有蕴含（前者推断出后者）、矛盾（不可同时为真）、中立\nSNLI 是包括 57 万人类手写的句子对，每对都由人工标注为蕴含、矛盾和中立。\n\n12. 2 文本相似网络\n\n计算句子对a、b的相似度\n依次计算a中某词与句子b中所有词的相似度，得到该词的对齐向量，softmax处理\n每个对齐向量都有对应的权重\n向量结果加和，传递到一个MLP分类器中，用于预测句子关系。\n然后训练\n网络的目标是为了找到有助于蕴含的关键词。最终，决策网络从词对中聚合数据，并且据此提出决策 。 推断分为三个阶段：第一阶段根据相似度对齐找到较弱的局部证据，第二阶段查看带权重的多个词单元并加入方向性，第三阶段将所有局部证据整合成全局决策 。\n第三部分、特殊的结构（这个介绍不错，建议详细看）\n十三、n 元语法探测器：卷积神经网络\n\n13. 1 基础卷积＋池化\n\n13. 1. 1 文本上的一维卷积\n卷积操作：滑动窗口向量与滤波器的内积，其后通常会使用一个非线性激活函数。\n宽卷积与窄卷积：窄卷积：窗口大小k，句子长度n，共有n-k+1个序列开始位置； 宽卷积：对句子每端填充k-1个填充词，n+k-1个序列开始位置(书写错了？)\n两种卷积方式：实质上等价，不同的是卷积核矩阵维度为 k*d*l，和 l 个k*d维的卷积核\n信道：多信道(图像数据)，通常对每个信道使用不同的滤波器集合，文本也可能多信道\n13. 1. 2 向量池化\n最大池化：获取整个窗口位置中最显著的信息\n平均池化：一种理解是对句子中连续词袋 (CBOW) 而不是词进行卷积得到的表示。\nk-max：每一维度保留前k个，同时保留文本中的顺序。保留了特征间的序关系，但对具 体位置不敏感\n动态池化：卷积后得到的向量进行分组，每组分别池化，结果拼接。即分区域池化(例如关系抽取中两个词分割开的三块文本区域）\n13. 1. 3 变体\n平行的使用多个卷积层（窗口大小不等，捕获序列中不同长度的 n 元语法）\n\n13. 2 其他选择：特征哈希\n\n用于文本的CNN计算开销大。直接使用 n元语法的词嵌入，然后池化得到连续词袋 n 元语法表示。使用特征哈希，n元语法通过哈希函数指派给N行词嵌入矩阵的一行，映射到[1，N]，使用对应行作为词嵌入。\n\n13. 3 层次化卷积\n\n一个窗口大小为k的卷积层学习识别输入中具有指示性的k元语法。这种方法可以扩展成层次化卷积层，卷积序列逐层相连。得到的向量捕获了句子中更有效的窗口(“感受野”)\n步长、膨胀和池化\n\n膨胀的方法：步长为k-1；步长为1但是每层间使用局部池化缩短序列长度\n\n参数捆绑和跨层连接\n\n层次化卷积结构的一种变形是进行参数捆绑，对于所有参数层使用相同的参数集合 U, b 。\n\n\n\n\n十四、循环神经网络：序列和栈建模\n\n处理序列：前馈网络(CBOW忽略序关系)、CNN(局限于局部)、RNN(序列输入翻译成定长向量)\n\n14. 1 RNN 抽象描述：R、O决定网络类型\n\n14. 2 RNN 的训练\n\n展开形式的RNN就是一个深度神经网络、不同部分在计算过程中 参数共享\n\n为了训练一个RNN，需要对输入序列构建一个展开的计算图，为展开的图添加损失节点，反向传播更新参数\n\n14. 3 RNN 常见使用模式\n\n接收器：监督信号仅置于最后的输出向量 y_n 上。观测最后一个状态，然后决策一个输出。\n编码器：仅使用最后的输出向量y_n，把 y_n 与 输入相关的其他特征 进行后续任务。\n传感器：对于每一个读取的输入产生一个输出（序列标注任务）\n\n14. 4 双向 RNN\n\n\n\n\n动机：计算第i个单词，计算过程基于历史信息，然而后继的单词对于预测同样有效。\n输出变动：第i个位置的输出基于前向后向两个输出向量的拼接，即同时考虑历史和未来的信息。\n输出之后：拼接得到的输出向量，在接下来可以直接用来进行预测，或作为更复杂网络输入的一部分\nBi-RNN 在一个输人向量对应一个输出向量的标注任务中非常有效 。\n\n14. 5 堆叠 RNN\n\nDeep RNN:RNN逐层堆叠成网格，第n个RNN的输入是其下方RNN的输出。\n在某些任务的观测经验中看， deep RNN 的确比浅层的表现更好 。\n\n14. 6 用于表示梭的 RNN\n\n一些语言处理算法，需要对栈进行特征提取，RNN可以用来对整个栈的固定大小的向量编码。\n\n14. 7 文献阅读的注意事项\n\n从学术论文的描述中推测出准确的模型形式往往是很有挑战性的 。\n\nRNN输入是独热向量还是词嵌入\n输入序列有没有对开始字符和结束字符填充处理\n一些论文假定RNN输出送入的softmax层是RNN自身的一部分\n多层RNN中，状态向量可以是顶层输出，也可以是所有层状态向量的拼接。\n在编码器－解码器框架下，作为解码器条件输入的编码器的输出可以有不同的诠释？\n十五、实际的循环神经网络结构\n\n15. 1 作为 RNN 的 CBOW\n\n选择加法函数：RNN内部是一个简单的加法：\n\n本质上是一个连续的词袋模型，输出是输入之和。\n\n15. 2 简单 RNN —— S-RNN\n\n简单RNN是对前一个状态s_(i-1)和输入x_i 分别线性变换，结果相加，连同同一个偏置项，加一个激活函数tanh或ReLU。输出与隐藏状态相同。\n\nS-RNN仅仅比 CBOW 稍微复杂了一点，主要不同之处在于非线性的激活函数 g 。然而，这个不同之处却至关重要，因为加入线性变换后跟随非线性变换的机制使得网络结构对于序列顺序敏感 。\n\n15. 3 门结构\n\nLSTM要解决的问题：梯度消失，使得 S-RNN 很难有效地训练 。误差信号（梯度）在反向传播过程中到达序列的后面部分时迅速减少，以至于无法到达先前的输入信号的位置，这导致 S-RNN 难以捕捉到长距离依赖信息。\n\nLSTM的考虑：考虑S-RNN 其中的状态代表一个有限的记忆 。每一个单元都会读人一个输入x_i以及当前的记忆s_(i-1) ，对它们进行某种操作，并将结果写人记忆得到新的记忆状态 s_(i+1) 。从这种方式看来，S-RNN 的一个明显的问题在于记忆的获取是不受控制的。在每一步的计算过程中，整个记忆状态都被读入，并且整个记忆状态也被改写。\n\n改进：提出一种更加受控的记忆读写方式。由当前记忆状态和输入共同控制的门向量，来控制记忆状态的读写。\n\n15. 3. 1 长短期记忆网络（下面有PPT做的图）\n时刻 j 的状态由两个向量组成：记忆组件c_ j 和 隐藏状态组件h_ j\n输入门 i、遗忘门 f、输出门 o: 门的值由当前输入x_ j 和前一个状态 h_(j-1) 加一个sigmoid决定\n遗忘门控制先前的记忆c_(j-1)，记忆c_ j 更新，\n产生更新候选项z： 由当前输入x_j 和前一个状态h_(j-1) 加一个tanh得到\n输入门控制更新候选项，记忆c_ j 更新\n记忆h_ j (y_j的输出) 生成，c_j 通过tanh非线性激活函数，并受输出门控制\n\n\n\n\n使用PPT画了一个，嘿嘿我觉得很好看\n实践的考虑：在训练 LSTM 网络的时候，强烈建议将遗忘门的偏置项设置为接近 1 的值\n\n\n\n\n15.3.2 门限循环单元\n\nGRU是一种LSTM的替代方案。GRU 也基于门机制，但是总体上使用了更少的门并且网络不再额外给出记忆状态。\n\n门 r 合并遗忘们和输入门，控制前一个状态s_(j-1)并计算一个新提出的 s_j~\n更新的状态s_j 由前一个状态和s_j~ 插值决定，比例通过门控z控制。\n\n15. 4 其他变体\n\n非门结构的改进\n在可微门结构之外\n\n15. 5 应用到 RNN 的丢弃(dropout)机制\n\n在 RNN 中应用丢弃（ dropout）机制需要一定的技巧，因为在不同的时间点丢弃不同的维度会损害 RNN 有效携带信息的能力。\n\nGal 的变分 RNN 丢弃方法是目前应用于 RNN 中效果最好的丢弃机制。\n\n十六、通过循环网络建模\n\n16. 1 接收器（14. 3 有RNN 常见使用模式）\n\n接收器：监督信号仅置于最后的输出向量 y_n 上。观测最后一个状态，然后决策一个输出。读入一个序列，最后产生一个二值或者多分类的结果。\n\n16. 1. 1 情感分类器\n句子级情感分类任务中，给定一个句子，将这个句子分成两类中的一个 ： 积极的或消极的。这个任务通过使用 RNN 接收器能够很直接地进行建模： RNN 读人序列化后的词语 。RNN 的最终状态送人一个 MLP ，这个 MLP 的输出层是一个二输出的 softmax 层 。\n文本级的情感分类。层次化结构的方法：每个句子通过门结构的RNN编码得到一个向量，然后将向量集合送入第二个门结构的RNN中，得到最终的向量，套上MLP和softmax用来预测。\n16. 1. 2 主谓一致语法检查\n英语句子必须要遵守“现在时态谓语动词的单复数必须与动词的主语一致”的规则\n模型直接作为一种接收器被训练。这是一项困难的任务，只有非常间接的监督：监督信号不包括任何找到语法信息的线索 。\nRNN 处理学习任务表现非常好，成功解决了测试集中的绝大多数句子\n\n16.2 作为特征提取器的 RNN\n\nRNN 的一个最主要的应用场景就是作为灵活可训练的特征提取器，在处理序列问题时能够替代传统的特征提取通道 。 特别地， RNN 是基于窗口的特征提取器的良好替代者 。\n\n16. 2. 1 词性标注\nn个词语的句子，使用特征提取函数转换为输入向量，输入到双层RNN中，产生的输出向量被送入MLP中，用于从可能的 h 个标签中预测这个词语的标签 。\n通过训练程序，双向 RNN 将着重于学习序列中 预测词语标签 所需要的那些信息 ，并将其编码在输出向量中\n词语转换成输入向量：可以通过使用一个词嵌入矩阵，也可以通过字符级的 RNN 将词语转化为输入，使用字符级的卷积和池化神经网络来表示词语，\n16. 2. 2 RNN-CNN 文本分类\n与标注任务相同的方式，将向量送入逐个读入单词的字符级RNN 或逐个读入单词的卷积一池化层中得到结果\n或在字符上应用一个层次化卷积一池化网络，得到更短的向量序列，把结果的向量序列送入RNN 及分类层中\n16. 2. 3 弧分解依存句法分析\n输入词语、词性标签和对应的特征向量，投入到RNN中，得到每个词语的编码。将这些编码进行两两拼接送入MLP中，得到一个核心词-修饰词 候选对的打分。\n如果一个任务对词语顺序或者句子结构敏感，并且这个任务使用词语作为特征，那么这个任务中的词语就能够被使用词语自身训练的双向 LSTM输出的词向量代替 。\n十七、条件生成\n\n17. 1 RNN 生成器\n\n使用 RNN 转换器结构进行语言建模的一个特殊例子：序列生成。i 时刻的输出作为i+1时刻输入。\n\n生成器的训练：将其当做转换器训练。长度为n的句子，生成具有n+1个输入和n+1个输出的RNN转换器，其中第一个输入是句首符，最后一个输出是句尾符。\n\n局限性：不能更好的处理与黄金序列（观测序列）之间的偏差。在训练时，生成器使用实际词作为每一时刻的输入，而不是前一时刻的预测结果。\n\n17.2 条件生成（编码器－解码器）\n\nRNN 转换器的能力直到应用于条件生成的框架中才真正地显现出来 。\n\n条件生成的框架中，下一个词项的生成依赖于己生成的词项以及一个额外的条件上下文 c，几乎任何我们能够获得并且认为有用的数据都可以被编码至上下文c\n\n17. 2. 1 序列到序列模型\n\n上下文 c 可以有很多种形式。一种方法是c本身就是一个序列，最常见的是一个文本片段。这种方式下产生了序列到序列（ sequence to sequence）条件生成框架，也被称为编码器一解码器框架。\n\n给定一个长度n的源序列，生成一个长度m的输出序列。通过一个编码函数(通常是RNN)将源句子编码，再使用一个条件生成器（解码器）生成输出序列。\n\n编码器将源句子抽象表示为向量 c，作为解码器的 RNN 则根据当前已预测出的词以及编码后的源句子 c 来预测目标词序列。\n\n用于编码器与解码器的 RNN 是联合训练的 。 监督信息只出现在解码器 RNN 端，但是梯度能够沿着网络连接反向传播至编码器 RNN 中\n\n17.2.2 应用\n机器翻译\n邮件自动回复\n形态屈折 -- 输入基本词和期望的形态变化需求，输出该词的曲折形式\n几乎所有任务都可以用编码-生成的方法建模，但也许存在更适合此任务的结构\n17. 2.3 其他条件上下文\n\n条件上下文向量可以是基于单个词，或一种连续词袋 CCBOW）的编码，也可以由 一个卷积网络生成，或基于一些其他的复杂计算 。甚至不一定基于文本(对话任务用户的信息)\n\n17.3 无监督的句子相似性\n\n为句子学习向量表示，将相似的句子编码为相近的向量。\n大部分方法是基于序列到序列框架的：首先训练一个 RNN 编码器来产生上下文向量表示 c，该向量将用于一个 RNN 解码器来完成某个任务 。\n作为解码器的 RNN 将被丢弃，而编码器则用来生成句子表示 c，最终得到的句子间相似度函数将严重依赖于训练解码器所完成的任务 。\n这些任务可以是：自动编码、机器翻译、skip-thought、句法相似度\n\n\n\n\n17.4 结合注意力机制的条件生成\n\n编码器-解码器结构强制编码器中包含生成时所需要的全部信息，要求生成器中从该定长向量中提取出所有信息。 增加一个注意力机制，可以充分改进。\n结合注意力机制的编码器-解码器结构预测过程：\n编码器对长度为n的输入序列编码，产生n个向量。\n预测第j+1个词项时，注意力由前 j 个编码器输出的向量和前 j 个词项决定\n解码器第j+1个状态， 由注意力、前 j 个词项、第 j 个状态决定\n由解码器的最终状态，得到第j+1个词项\n注意力函数是一个可训练、参数化的函数。\n注意力权重向量由解码器的第 j 个输出、编码器的每个向量，+MLP，决定\n再使用 softmax 函数将权重归一化至一个概率分布\n最终权重与编码器的输出，结合得到最终的注意力\n为何不省去编码器，把注意力机制直接作用于源序列？编码过程有重要的收益。\n计算的复杂性：\n不含注意力的编码O(n)解码O(m)，整体时间复杂度是O(m+n)，\n含注意力，编码O(n)，解码每一步需要计算注意力O(n)，整体O(m*n)\n可解释性：生成的注意力权重可以用来观察在产生当前输出时解码器认为源序列中哪些区域是相关的 。\n\n17. 5 自然语言处理中基于注意力机制的模型\n\n机器翻译 子词单元 融合单语数据 语言学标注\n形态屈折 -- 输入基本词和期望的形态变化需求，输出该词的曲折形式\n句法分析\n编辑于 2019-08-19\n自然语言处理\n深度学习（Deep Learning）\n机器学习\n​赞同 81​\n​1 条评论\n​分享\n​收藏\n​\n文章被以下专栏收录\nhtfhxx学习笔记分享\n进入专栏\n推荐阅读\n[CS224n笔记] L1 Introduction and Word Vectors\n何妨吟啸且...\n发表于自然语言处...\n[CS224n笔记] L6 Language Models, RNN, GRU and LSTM\n何妨吟啸且...\n发表于自然语言处...\nNLP深度学习最新趋势\n\n文章链接：https://arxiv.org/pdf/1708.02709.pdfAbstract深度学习方法利用多层处理结构来学习数据中的层次化表示，在很多领域都得到了SOTA的结果。最近几年，NLP领域涌现了大量的深度学习…\n\nSimpl...\n发表于自然语言理...\nCS224N NLP with Deep Learning（二）：词向量之Word2Vec\nTJH\n1 条评论\n​切换为时间排序\n写下你的评论...\n\n\n发布\ncookie\n2019-05-30\nmaek~\n​1\n​回复\n​踩\n​举报", "images": ["https://pic1.zhimg.com/v2-04a6f40abbef0053f37cee71fff5935a_1440w.jpg", "https://pic3.zhimg.com/v2-ef6873dd5eb90bc61242005f50c7859b_xs.jpg", "data:image/svg+xml;utf8,<svg xmlns='http://www.w3.org/2000/svg' width='328' height='60'></svg>", "data:image/svg+xml;utf8,<svg xmlns='http://www.w3.org/2000/svg' width='204' height='37'></svg>", "data:image/svg+xml;utf8,<svg xmlns='http://www.w3.org/2000/svg' width='121' height='81'></svg>", "data:image/svg+xml;utf8,<svg xmlns='http://www.w3.org/2000/svg' width='111' height='84'></svg>", "data:image/svg+xml;utf8,<svg xmlns='http://www.w3.org/2000/svg' width='553' height='229'></svg>", "data:image/svg+xml;utf8,<svg xmlns='http://www.w3.org/2000/svg' width='183' height='104'></svg>", "data:image/svg+xml;utf8,<svg xmlns='http://www.w3.org/2000/svg' width='153' height='179'></svg>", "data:image/svg+xml;utf8,<svg xmlns='http://www.w3.org/2000/svg' width='205' height='50'></svg>", "data:image/svg+xml;utf8,<svg xmlns='http://www.w3.org/2000/svg' width='347' height='63'></svg>", "data:image/svg+xml;utf8,<svg xmlns='http://www.w3.org/2000/svg' width='261' height='212'></svg>", "data:image/svg+xml;utf8,<svg xmlns='http://www.w3.org/2000/svg' width='553' height='301'></svg>", "data:image/svg+xml;utf8,<svg xmlns='http://www.w3.org/2000/svg' width='381' height='187'></svg>", "https://pic1.zhimg.com/v2-2b4578432bfe55ddfafaaa4d715fd212_xs.jpg", "https://pic3.zhimg.com/v2-82597c2ab7a25caf76d3faf3bc70ca19_250x0.jpg", "https://pic2.zhimg.com/v2-454e36d5866823f18a2c907d9343e557_250x0.jpg", "https://pic2.zhimg.com/v2-6bf9b1af941ceec82152a6fac0d1cc2c_250x0.jpg", "https://pic4.zhimg.com/da8e974dc_s.jpg"], "url": "https://zhuanlan.zhihu.com/p/67438204", "title": {"url": "https://zhuanlan.zhihu.com/p/67438204", "title": "《Neural Network Methods in NLP》 笔记 - 知乎"}}, {"is_can_visited": true, "text": "百度首页登录\n问答：Gmail中的智能撰写是什么？如何开启？\n\n泡泡网\n\n发布时间：18-05-0918:28百家榜创作者，北京盛佳广告有限公司官方帐号\n\n提问：\n\nGmail中的智能撰写是什么？如何开启？\n\n回答：\n\n谷歌在I/O大会Keynote上公布了不少AI相关功能，其中Gmail的智能撰写(Smart Compose)备受瞩目。该功能会在用户发邮件时智能地预测即将输入的内容从而加快写邮件速度，减少拼写错误和语病。智能撰写会根据收件人和发件时间等因素预测。比如智能撰写会在周五发的邮件结尾建议用户输入“周末愉快!”。\n\n下面这张动图内智能撰写根据收件人的名字预测出了第一句打招呼用语，这时按Tab就能瞬间完成这句话。\n\n那么怎样才能开启这项功能呢?下面是步骤：\n\n浏览器登陆Gmail→点击设置（右上角齿轮图标）→点击试用新版Gmail→等待新版Gmail加载完毕→点击新版Gmail右上角的设置→选择常规→下拉找到并勾上“启用实验室功能访问权限”。\n\n但要注意的是简体中文版的Gmail不支持该功能。本人测试了英语和简体中文两种语言，其中英文支持智能撰写，而且输入的文字也不能是中文。\n\n不久的将来该功能就会被正式推出，届时用户不需要勾选“实验室功能”也将可以使用智能撰写。发布会上没有提安卓和iOS的Gmail客户端，但将来它们肯定也会有这个功能。\n\n本文编辑：张哲\n\n关注泡泡网，畅享科技生活。\n\n作者最新文章\n129元畅享真无线 雷柏i100蓝牙TWS耳机上市\n6月安卓手机性价比排行出炉：小米揽4冠\n荣耀30青春版明日开售，1699元开启你的5G大门\n相关文章\niPad端Gmail支持分屏 允许同时运行两个Gmail\n用好Smart Reply/Compose功能 大幅提升Gmail工作效率\nGmail终于开放iPad多任务处理功能！G Suite和Google帐户皆可使用\n智能手机毁了你的什么？\n智能车企争奇斗艳\n设为首页© Baidu 使用百度前必读 意见反馈 京ICP证030173号 \n京公网安备11000002000001号", "images": ["https://ss0.bdstatic.com/5aV1bjqh_Q23odCf/static/superlanding/img/logo_top.png", "https://pic.rmb.bdstatic.com/ebdfd3c2f8c30263246eb00c02264f2f.png", "https://hiphotos.baidu.com/feed/pic/item/bba1cd11728b47105a18107acfcec3fdfc032355.jpg", "https://ss2.baidu.com/6ONYsjip0QIZ8tyhnq/it/u=3067371638,2210100317&fm=173&app=25&f=JPEG?w=640&h=480&s=2DAE74324B2B55201A55B1CA0000C0B1", "https://ss1.baidu.com/6ONXsjip0QIZ8tyhnq/it/u=351606901,3648491692&fm=173&app=25&f=JPEG?w=640&h=480&s=14186033530F454B10D0E4DA000070B2", "https://ss1.baidu.com/6ONXsjip0QIZ8tyhnq/it/u=2319054922,3188127602&fm=173&app=25&f=JPEG?w=640&h=480&s=10087C330B8F4449507144DA0000C0B1", "https://ss1.baidu.com/6ONXsjip0QIZ8tyhnq/it/u=1402279528,3536209984&fm=173&app=49&f=JPEG?w=312&h=208&s=7F904F8E5A7C1E8A54F51DDC0300C050", "https://ss1.baidu.com/6ONXsjip0QIZ8tyhnq/it/u=115987213,4108641013&fm=173&app=49&f=JPEG?w=312&h=208&s=5B148B446605A90F53350CFA0300C012", "https://ss2.baidu.com/6ONYsjip0QIZ8tyhnq/it/u=3991927523,2631759452&fm=173&app=49&f=JPEG?w=312&h=208&s=01B2EC321766670B44D895CB0000A0B1", "https://ss1.baidu.com/6ONXsjip0QIZ8tyhnq/it/u=981622786,3012129061&fm=173&app=25&f=JPEG?w=218&h=146&s=0673473402C073490B403D4503005060", "https://ss2.baidu.com/6ONYsjip0QIZ8tyhnq/it/u=2712847109,2631023272&fm=173&app=25&f=JPG?w=218&h=146&s=3CB0D8B040E250BFD1B59DB503001021", "https://ss0.bdstatic.com/5aV1bjqh_Q23odCf/static/superman/img/copy_rignt_24.png"], "url": "https://baijiahao.baidu.com/s?id=1599981856279998936&wfr=spider&for=pc", "title": {"url": "https://baijiahao.baidu.com/s?id=1599981856279998936&wfr=spider&for=pc", "title": "问答：Gmail中的智能撰写是什么？如何开启？"}}, {"is_can_visited": true, "text": "百度首页登录\n谷歌套件喜提新功能：Gmail智能撰写\n\nIT之家\n\n发布时间：18-07-2522:02青岛软媒网络科技有限公司\n\nIT之家7月25日消息 据Android Police报道，谷歌刚刚为使用G Suite组织业务的客户展示了一系列新功能。这些内容涉及范围广泛，涵盖了诸如云端硬盘，Gmail和环聊等产品的安全性和生产力等方面。\n\nG Suite企业早期采用者计划（EAP）的成员可以立即获得一些增强功能，而其中一些增强功能将在今年晚些时候推出给所有用户。我们来看看Google宣布的所有内容。\n\n安全\n\nG Suite安全中心于今年早些时候推出，现在它正在获得一种新的调查工具，它将使管理员能够在感染事件时进一步审查潜在的违规行为并清理电子邮件或文件。早期采用者现在可以尝试使用该工具。\n\n数据区域\n\n到目前为止，G Suite客户的数据已经存储在世界各地的中心，这使得访问更加容易和快捷。这对许多跨国公司来说很重要，但对于那些有特定数据控制要求的人来说也可能存在问题。出于这个原因，Google正在为业务所有者提供存储G Suite应用主要数据的选择。G Suite Business和Enterprise客户的数据区域已经上线，无需额外费用。\n\nGmail和环聊\n\nGmail中的 Smart Compose已经作为实验性功能发布，它将在未来几周内向G Suite用户提供，这表明它已经准备好摆脱这个“实验性”标签，并逐渐成为一个成熟的功能。\n\n与此类似，AI已被用于Google产品（如Inbox和Gmail）中的智能回复。应用程序甚至可以对来自Android上各种其他应用程序的通知进行智能回复。现在，环聊聊天（这实际上是谷歌的Slack竞争对手）也有同样的功能。\n\nGoogle文档和表格\n\n继续使用AI主题，Google Docs中的语法建议现在可供早期采用者使用。谷歌正在使用基于机器学习翻译的方法来提供类似于Grammarly的服务（顺便说一句，它在Google Docs中不起作用）。它会随着时间的推移而发展和改进，所以看看它是否真的有用会很有趣。\n\n在另一篇文章中，已宣布Google表格正在进行一些新的集成，以便更轻松地进行数据分析。首先，可以通过新的beta程序在Sheets中动态访问BigQuery的数据 。其次，使用SAP ERP的公司现在可以直接将数据导入到Sheets中进行进一步分析-不再需要手动导出到CSV。\n\n作者最新文章\n起诉国家知识产权局？“优酷”商标复审再次被驳回\n苹果官网 iOS 14 中文介绍上线：这种新感觉，一点不陌生\n技巧：如何卸载Win10基于Chromium的新版Edge浏览器\n相关文章\n谷歌下一代亲儿子Pixel 5曝光，后背方形摄像头矩阵设计\n我一个普通程序员，光靠GitHub打赏就年入70万，要不你也试试\n美国全面制裁中国App，苹果、谷歌下架59款中国应用，效仿印度\n美媒：脸书推特谷歌涉入港版国安法政治 暂停向港府提供用户数据\n如何创建谷歌GMC(Google Merchant center)并同步Shopify\n设为首页© Baidu 使用百度前必读 意见反馈 京ICP证030173号 \n京公网安备11000002000001号", "images": ["https://ss0.bdstatic.com/5aV1bjqh_Q23odCf/static/superlanding/img/logo_top.png", "https://pic.rmb.bdstatic.com/f618c83dd191cbdf0acc8bdcdfa84b74.png", "https://ss1.baidu.com/6ONXsjip0QIZ8tyhnq/it/u=3433850194,1398489018&fm=173&app=25&f=JPEG?w=600&h=337&s=800A55320D3A4609385DE0CB0000E0B3", "https://ss0.baidu.com/6ONWsjip0QIZ8tyhnq/it/u=362163663,2904186028&fm=173&app=25&f=JPEG?w=600&h=337&s=80BA5D320B6B400950F570D70000C0B2", "https://ss0.baidu.com/6ONWsjip0QIZ8tyhnq/it/u=2574028053,2106008701&fm=173&app=25&f=JPEG?w=600&h=337&s=082A743213CF454910D9E4DA0000D0B3", "https://ss0.baidu.com/6ONWsjip0QIZ8tyhnq/it/u=4108084101,3987153190&fm=173&app=49&f=JPEG?w=312&h=208&s=0614E52346DEAB9A7795508A0100A0A1", "https://ss0.baidu.com/6ONWsjip0QIZ8tyhnq/it/u=4291071708,1743249875&fm=173&app=49&f=JPEG?w=312&h=208&s=B293E520B3EE1F0D2CE80D960100C0E0", "https://ss0.baidu.com/6ONWsjip0QIZ8tyhnq/it/u=916221495,963129459&fm=173&app=49&f=JPEG?w=312&h=208&s=F5B1A9736A72479694AC6CE90300A022", "https://ss0.baidu.com/6ONWsjip0QIZ8tyhnq/it/u=2183748405,978924698&fm=173&app=49&f=JPEG?w=312&h=208&s=AA32418647B03D9EC36BC19E0300409B", "https://ss1.baidu.com/6ONXsjip0QIZ8tyhnq/it/u=2439947584,3310739838&fm=173&app=49&f=JPEG?w=312&h=208&s=C85146966A624E8A484C78FB0300B071", "https://ss0.bdstatic.com/5aV1bjqh_Q23odCf/static/superman/img/copy_rignt_24.png"], "url": "https://baijiahao.baidu.com/s?id=1606979437323514537&wfr=spider&for=pc", "title": {"url": "https://baijiahao.baidu.com/s?id=1606979437323514537&wfr=spider&for=pc", "title": "谷歌套件喜提新功能：Gmail智能撰写"}}, {"is_can_visited": true, "text": "百度首页登录\n谷歌Gmail新功能究竟有多“新”？“智能回复”？\n\n洪哥搞笑段子\n\n发布时间：18-05-1018:00\n\n5月9日上午，一年一度的谷歌开发者大会正式开幕，在这场属于极客们的庆典之中，由谷歌首席执行官Sundar Pichai登台讲述Gmail运用AI技术生成自动回复的功能Smart Compose，引起了人们的关注。然而，当全球媒体都在旧金山鼓掌欢呼的时候，许多使用搜狗输入法的用户却有一种似曾相识的感觉。因为在今天谷歌宣布Gmail的AI 技术可以实现自动回复之前，搜狗输入法早在2016年就推出了类似的功能——“智能回复”。\n\n这里面唯一的区别就是因为用户使用习惯的差异，谷歌与搜狗给出了不同的解决方案。\n\n众所周知，欧美地区的人们普遍爱用电子邮件来交流信息，谷歌在Gmail上推出的智能回复技术，显然能够大幅度的提高用户效率，确实值得称赞。而与谷歌不同，更早推出这一技术的搜狗，则把重点放在了另外的应用场景之中。针对国内高频率的聊天对话需求，搜狗将其运用在了输入法场景，以AI技术来帮助用户提升沟通效率，获得更优秀的交流沟通体验，显然是更加接地气的一种表现。\n\n简单的说，“智能回复”一方面能够基于我们日常聊天时出现的类似“吃了吗”、“在不在？”、“几点下班？”的对话场景进行分析总结，归纳出一些类似的回复“套路”。当用户再遇到这类场景时，直接就能匹配对应的回复话术，让用户免去一个字一个字重复输入的烦恼，从而提升输入效率。\n\n而另一方面，在“能聊”的基础上，“智能回复”还能解决“会聊”的问题。通过语义理解技术，“智能回复”还可以判断对话内容的核心，理解对话内涵，进而模拟用户的思维，在沟通交流的过程中，成为用户的聊天助手，为用户提供更准确更有趣的对话建议，让用户在聊天过程中可以更好的表达。\n\n而在“能聊”和“会聊”的基础上，“智能分享”还能通过知识图谱和问题技术，理解并满足用户潜在的、深层次对话需求，为用户提供丰富的知识和智能服务，让用户可以轻松应对各种聊天挑战。\n\n恐怕搜狗也没想到，今年谷歌开发者大会最大的惊喜之一竟然是自己在2016年就已实现的技术。当然，这里面不存在谁抄袭谁的问题，只能说明两家公司在将产品中融入人工智能的远大抱负中，英雄所见略同。\n\n如果你想使用“智能回复”，可以直接打开安卓版的搜狗输入法，在输入设置界面的“智能回复”功能，勾选后，就可以实现与Gmail类似的“生成自动回复”的智能效果。\n\n作者最新文章\n搞笑段子：「为什么男人都喜欢去健身！」\n英雄联盟：天使姐妹重做出炉「正义天使凯尔」技能详解加高清皮肤\n吴京真厉害！《战狼2》《流浪地球》独揽中国内地电影票房冠亚军\n相关文章\n谷歌下一代亲儿子Pixel 5曝光，后背方形摄像头矩阵设计\n美媒：脸书推特谷歌涉入港版国安法政治 暂停向港府提供用户数据\n如何创建谷歌GMC(Google Merchant center)并同步Shopify\n帝国理工联手谷歌提出抽象文本摘要最佳模型｜ICML 2020\n不是新版Edge不好用！没有这5款插件，你的Edge怎么可能好用？\n设为首页© Baidu 使用百度前必读 意见反馈 京ICP证030173号 \n京公网安备11000002000001号", "images": ["https://ss0.bdstatic.com/5aV1bjqh_Q23odCf/static/superlanding/img/logo_top.png", "https://pic.rmb.bdstatic.com/21916c5fe7a2b03508d52ea552050532.jpeg", "https://ss2.baidu.com/6ONYsjip0QIZ8tyhnq/it/u=1845437858,790688562&fm=173&app=25&f=JPEG?w=500&h=206&s=1D2A7C330F6245204E55E1DA0000C0B3", "https://ss0.baidu.com/6ONWsjip0QIZ8tyhnq/it/u=632140008,1861317572&fm=173&app=25&f=JPEG?w=495&h=500&s=C0104E323F0E45490A45E9CA0000E0B1", "https://ss1.baidu.com/6ONXsjip0QIZ8tyhnq/it/u=790159930,2193394821&fm=173&app=25&f=JPEG?w=241&h=429&s=C800EE1A4F4264415E5980D80300F0B1", "https://ss0.baidu.com/6ONWsjip0QIZ8tyhnq/it/u=3998653605,3916467816&fm=173&app=25&f=JPEG?w=238&h=426&s=C800EE1205427149565180C80300E0B1", "https://ss0.baidu.com/6ONWsjip0QIZ8tyhnq/it/u=4108084101,3987153190&fm=173&app=49&f=JPEG?w=312&h=208&s=0614E52346DEAB9A7795508A0100A0A1", "https://ss0.baidu.com/6ONWsjip0QIZ8tyhnq/it/u=2183748405,978924698&fm=173&app=49&f=JPEG?w=312&h=208&s=AA32418647B03D9EC36BC19E0300409B", "https://ss1.baidu.com/6ONXsjip0QIZ8tyhnq/it/u=2439947584,3310739838&fm=173&app=49&f=JPEG?w=312&h=208&s=C85146966A624E8A484C78FB0300B071", "https://ss0.baidu.com/6ONWsjip0QIZ8tyhnq/it/u=3060161529,1691269782&fm=173&app=49&f=JPEG?w=312&h=208&s=E9A221D54C992CC81A1CDD01030030D1", "https://ss0.baidu.com/6ONWsjip0QIZ8tyhnq/it/u=1522918434,1612933628&fm=173&app=49&f=JPEG?w=312&h=208&s=BB0BB04E546101050D1A36D903001098", "https://ss0.bdstatic.com/5aV1bjqh_Q23odCf/static/superman/img/copy_rignt_24.png"], "url": "https://baijiahao.baidu.com/s?id=1600068507254895433&wfr=spider&for=pc", "title": {"url": "https://baijiahao.baidu.com/s?id=1600068507254895433&wfr=spider&for=pc", "title": "谷歌Gmail新功能究竟有多“新”？“智能回复”？"}}]}, {"img": "https://images.deepai.org/news-links/5b2b22a6ea794ac69d049543c492d967/the-biggest-robot-companies-and-their-most-scary-inv.jpg", "title": "The Biggest Robot Companies And Their Most Scary Inventions", "url": "https://www.forbes.com/sites/bernardmarr/2020/07/06/the-biggest-robot-companies-and-their-most-scary-inventions/", "domain": "www.forbes.com", "zh": "最大的机器人公司和他们最可怕的发明", "is_can_visited": true, "id": "d8117747d5ebc42071a730790ca6b49c", "day": "2020-07-06", "more": [{"is_can_visited": true, "url": "https://zhuanlan.zhihu.com/p/96485139?utm_source=wechat_session", "domain": "zhuanlan.zhihu.com", "title": {"url": "https://zhuanlan.zhihu.com/p/96485139?utm_source=wechat_session", "title": "细思恐极!前五名人工智能机器人自主说出的最恐怖的话 - 知乎"}}, {"is_can_visited": true, "url": "https://baijiahao.baidu.com/s?id=1623605591526255522&wfr=spider&for=pc", "domain": "baijiahao.baidu.com", "title": {"url": "https://baijiahao.baidu.com/s?id=1623605591526255522&wfr=spider&for=pc", "title": "2019年最值得关注的十大机器人初创公司：成立时间均不超过5年"}}]}, {"img": "https://images.deepai.org/publication-preview/joint-frequency-and-image-space-learning-for-fourier-imaging-page-7-thumb.jpg", "title": "Joint Frequency- and Image-Space Learning for Fourier Imaging", "url": "https://api.deepai.org/publication-download-pdf/joint-frequency-and-image-space-learning-for-fourier-imaging", "domain": "api.deepai.org", "zh": "傅里叶成像中的联合频率和图像空间学习", "is_can_visited": false, "id": "8674f3ef7cae88c569b01b64a4bba080", "day": "2020-07-06", "more": [{"is_can_visited": true, "url": "https://zhuanlan.zhihu.com/p/96485139?utm_source=wechat_session", "domain": "zhuanlan.zhihu.com", "title": {"url": "https://zhuanlan.zhihu.com/p/96485139?utm_source=wechat_session", "title": "细思恐极!前五名人工智能机器人自主说出的最恐怖的话 - 知乎"}}, {"is_can_visited": true, "url": "https://baijiahao.baidu.com/s?id=1623605591526255522&wfr=spider&for=pc", "domain": "baijiahao.baidu.com", "title": {"url": "https://baijiahao.baidu.com/s?id=1623605591526255522&wfr=spider&for=pc", "title": "2019年最值得关注的十大机器人初创公司：成立时间均不超过5年"}}]}, {"img": "https://images.deepai.org/news-links/fc0eb250ed67463a93154c9ea59448af/global-artificial-intelligence-ai-market-to-2024-tec.jpg", "title": "Global Artificial Intelligence (AI) Market to 2024 - Technology Landscape, Trends and Opportunities ...", "url": "https://finance.yahoo.com/news/global-artificial-intelligence-ai-market-155000020.html", "domain": "finance.yahoo.com", "zh": "全球人工智能（AI）市场到2024年-技术前景，趋势和机会。。。", "is_can_visited": false, "id": "d38e5a5622e9564d2da3eb97d4007bae", "day": "2020-07-06", "more": [{"is_can_visited": true, "url": "https://zhuanlan.zhihu.com/p/96485139?utm_source=wechat_session", "domain": "zhuanlan.zhihu.com", "title": {"url": "https://zhuanlan.zhihu.com/p/96485139?utm_source=wechat_session", "title": "细思恐极!前五名人工智能机器人自主说出的最恐怖的话 - 知乎"}}, {"is_can_visited": true, "url": "https://baijiahao.baidu.com/s?id=1623605591526255522&wfr=spider&for=pc", "domain": "baijiahao.baidu.com", "title": {"url": "https://baijiahao.baidu.com/s?id=1623605591526255522&wfr=spider&for=pc", "title": "2019年最值得关注的十大机器人初创公司：成立时间均不超过5年"}}]}, {"img": "https://images.deepai.org/publication-preview/meta-learning-symmetries-by-reparameterization-page-6-thumb.jpg", "title": "Meta-Learning Symmetries by Reparameterization", "url": "https://deepai.org/publication/meta-learning-symmetries-by-reparameterization", "domain": "deepai.org", "zh": "重新参数化的元学习对称性", "is_can_visited": true, "id": "8ca3df534fc6beaae9daa81f212169bf", "day": "2020-07-06", "more": [{"is_can_visited": true, "url": "https://zhuanlan.zhihu.com/p/96485139?utm_source=wechat_session", "domain": "zhuanlan.zhihu.com", "title": {"url": "https://zhuanlan.zhihu.com/p/96485139?utm_source=wechat_session", "title": "细思恐极!前五名人工智能机器人自主说出的最恐怖的话 - 知乎"}}, {"is_can_visited": true, "url": "https://baijiahao.baidu.com/s?id=1623605591526255522&wfr=spider&for=pc", "domain": "baijiahao.baidu.com", "title": {"url": "https://baijiahao.baidu.com/s?id=1623605591526255522&wfr=spider&for=pc", "title": "2019年最值得关注的十大机器人初创公司：成立时间均不超过5年"}}]}, {"img": "/static/images/publication-placeholder-icon.png", "title": "Adaptive Risk Minimization: A Meta-Learning Approach for Tackling Group Shift", "url": "https://deepai.org/", "domain": "deepai.org", "zh": "适应风险最小化：一种应对群体转移的元学习方法", "is_can_visited": true, "id": "7e7bd1bf312d3eef3c7f271615260ec7", "day": "2020-07-06", "more": [{"is_can_visited": true, "url": "https://zhuanlan.zhihu.com/p/96485139?utm_source=wechat_session", "domain": "zhuanlan.zhihu.com", "title": {"url": "https://zhuanlan.zhihu.com/p/96485139?utm_source=wechat_session", "title": "细思恐极!前五名人工智能机器人自主说出的最恐怖的话 - 知乎"}}, {"is_can_visited": true, "url": "https://baijiahao.baidu.com/s?id=1623605591526255522&wfr=spider&for=pc", "domain": "baijiahao.baidu.com", "title": {"url": "https://baijiahao.baidu.com/s?id=1623605591526255522&wfr=spider&for=pc", "title": "2019年最值得关注的十大机器人初创公司：成立时间均不超过5年"}}]}, {"img": "/static/images/publication-placeholder-icon.png", "title": "Preintegrated IMU Features For Efficient Deep Inertial Odometry", "url": "https://deepai.org/", "domain": "deepai.org", "zh": "有效深惯性里程计的预集成IMU特性", "is_can_visited": true, "id": "d833e16113b424f60fde50d99a7337a1", "day": "2020-07-06", "more": [{"is_can_visited": true, "url": "https://zhuanlan.zhihu.com/p/96485139?utm_source=wechat_session", "domain": "zhuanlan.zhihu.com", "title": {"url": "https://zhuanlan.zhihu.com/p/96485139?utm_source=wechat_session", "title": "细思恐极!前五名人工智能机器人自主说出的最恐怖的话 - 知乎"}}, {"is_can_visited": true, "url": "https://baijiahao.baidu.com/s?id=1623605591526255522&wfr=spider&for=pc", "domain": "baijiahao.baidu.com", "title": {"url": "https://baijiahao.baidu.com/s?id=1623605591526255522&wfr=spider&for=pc", "title": "2019年最值得关注的十大机器人初创公司：成立时间均不超过5年"}}]}, {"img": "/static/images/publication-placeholder-icon.png", "title": "A Family of Denominator Bounds for First Order Linear Recurrence Systems", "url": "https://deepai.org/", "domain": "deepai.org", "zh": "一阶线性递归系统的分母界族", "is_can_visited": true, "id": "9797c6e0440cb4bbdb53e75c443395a1", "day": "2020-07-06", "more": [{"is_can_visited": true, "url": "https://zhuanlan.zhihu.com/p/96485139?utm_source=wechat_session", "domain": "zhuanlan.zhihu.com", "title": {"url": "https://zhuanlan.zhihu.com/p/96485139?utm_source=wechat_session", "title": "细思恐极!前五名人工智能机器人自主说出的最恐怖的话 - 知乎"}}, {"is_can_visited": true, "url": "https://baijiahao.baidu.com/s?id=1623605591526255522&wfr=spider&for=pc", "domain": "baijiahao.baidu.com", "title": {"url": "https://baijiahao.baidu.com/s?id=1623605591526255522&wfr=spider&for=pc", "title": "2019年最值得关注的十大机器人初创公司：成立时间均不超过5年"}}]}, {"img": "/static/images/publication-placeholder-icon.png", "title": "INT: An Inequality Benchmark for Evaluating Generalization in Theorem Proving", "url": "https://deepai.org/", "domain": "deepai.org", "zh": "INT：定理证明中评价推广性的一个不等式基准", "is_can_visited": true, "id": "ad585349010aafdb379795e69a2cf0ee", "day": "2020-07-06", "more": [{"is_can_visited": true, "url": "https://zhuanlan.zhihu.com/p/96485139?utm_source=wechat_session", "domain": "zhuanlan.zhihu.com", "title": {"url": "https://zhuanlan.zhihu.com/p/96485139?utm_source=wechat_session", "title": "细思恐极!前五名人工智能机器人自主说出的最恐怖的话 - 知乎"}}, {"is_can_visited": true, "url": "https://baijiahao.baidu.com/s?id=1623605591526255522&wfr=spider&for=pc", "domain": "baijiahao.baidu.com", "title": {"url": "https://baijiahao.baidu.com/s?id=1623605591526255522&wfr=spider&for=pc", "title": "2019年最值得关注的十大机器人初创公司：成立时间均不超过5年"}}]}, {"img": "/static/images/publication-placeholder-icon.png", "title": "Descent-to-Delete: Gradient-Based Methods for Machine Unlearning", "url": "https://deepai.org/", "domain": "deepai.org", "zh": "下降删除：基于梯度的机器去学习方法", "is_can_visited": true, "id": "7c19a28c6c0ea0be2ad5bd8dcefdbfe9", "day": "2020-07-06", "more": [{"is_can_visited": true, "url": "https://zhuanlan.zhihu.com/p/96485139?utm_source=wechat_session", "domain": "zhuanlan.zhihu.com", "title": {"url": "https://zhuanlan.zhihu.com/p/96485139?utm_source=wechat_session", "title": "细思恐极!前五名人工智能机器人自主说出的最恐怖的话 - 知乎"}}, {"is_can_visited": true, "url": "https://baijiahao.baidu.com/s?id=1623605591526255522&wfr=spider&for=pc", "domain": "baijiahao.baidu.com", "title": {"url": "https://baijiahao.baidu.com/s?id=1623605591526255522&wfr=spider&for=pc", "title": "2019年最值得关注的十大机器人初创公司：成立时间均不超过5年"}}, {"is_can_visited": true, "url": "https://zhuanlan.zhihu.com/p/77253076", "domain": "zhuanlan.zhihu.com", "title": {"url": "https://zhuanlan.zhihu.com/p/77253076", "title": "机器学习理论（四）线性回归中的梯度下降法 - 知乎"}}]}, {"img": "/static/images/publication-placeholder-icon.png", "title": "MCMI: Multi-Cycle Image Translation with Mutual Information Constraints", "url": "https://deepai.org/", "domain": "deepai.org", "zh": "MCMI：具有互信息约束的多周期图像翻译", "is_can_visited": true, "id": "41be06acb35a6b312d0c4834e5b2cea6", "day": "2020-07-06", "more": [{"is_can_visited": true, "url": "https://zhuanlan.zhihu.com/p/96485139?utm_source=wechat_session", "domain": "zhuanlan.zhihu.com", "title": {"url": "https://zhuanlan.zhihu.com/p/96485139?utm_source=wechat_session", "title": "细思恐极!前五名人工智能机器人自主说出的最恐怖的话 - 知乎"}}, {"is_can_visited": true, "url": "https://baijiahao.baidu.com/s?id=1623605591526255522&wfr=spider&for=pc", "domain": "baijiahao.baidu.com", "title": {"url": "https://baijiahao.baidu.com/s?id=1623605591526255522&wfr=spider&for=pc", "title": "2019年最值得关注的十大机器人初创公司：成立时间均不超过5年"}}, {"is_can_visited": true, "url": "https://zhuanlan.zhihu.com/p/77253076", "domain": "zhuanlan.zhihu.com", "title": {"url": "https://zhuanlan.zhihu.com/p/77253076", "title": "机器学习理论（四）线性回归中的梯度下降法 - 知乎"}}]}, {"img": "/static/images/publication-placeholder-icon.png", "title": "Quantifying the asymptotic linear convergence speed of Anderson Acceleration applied to ADMM", "url": "https://deepai.org/", "domain": "deepai.org", "zh": "ADMM中Anderson加速度的渐近线性收敛速度的量化", "is_can_visited": true, "id": "e36fc550d8c770dcecf202cfc8b285c6", "day": "2020-07-06", "more": [{"is_can_visited": true, "url": "https://zhuanlan.zhihu.com/p/96485139?utm_source=wechat_session", "domain": "zhuanlan.zhihu.com", "title": {"url": "https://zhuanlan.zhihu.com/p/96485139?utm_source=wechat_session", "title": "细思恐极!前五名人工智能机器人自主说出的最恐怖的话 - 知乎"}}, {"is_can_visited": true, "url": "https://baijiahao.baidu.com/s?id=1623605591526255522&wfr=spider&for=pc", "domain": "baijiahao.baidu.com", "title": {"url": "https://baijiahao.baidu.com/s?id=1623605591526255522&wfr=spider&for=pc", "title": "2019年最值得关注的十大机器人初创公司：成立时间均不超过5年"}}, {"is_can_visited": true, "url": "https://zhuanlan.zhihu.com/p/77253076", "domain": "zhuanlan.zhihu.com", "title": {"url": "https://zhuanlan.zhihu.com/p/77253076", "title": "机器学习理论（四）线性回归中的梯度下降法 - 知乎"}}]}, {"img": "/static/images/publication-placeholder-icon.png", "title": "Are Labels Necessary for Classifier Accuracy Evaluation?", "url": "https://deepai.org/", "domain": "deepai.org", "zh": "分类器准确度评估需要标签吗？", "is_can_visited": true, "id": "857b5110a14de80fdf82d486e30b406f", "day": "2020-07-06", "more": [{"is_can_visited": true, "url": "https://zhuanlan.zhihu.com/p/96485139?utm_source=wechat_session", "domain": "zhuanlan.zhihu.com", "title": {"url": "https://zhuanlan.zhihu.com/p/96485139?utm_source=wechat_session", "title": "细思恐极!前五名人工智能机器人自主说出的最恐怖的话 - 知乎"}}, {"is_can_visited": true, "url": "https://baijiahao.baidu.com/s?id=1623605591526255522&wfr=spider&for=pc", "domain": "baijiahao.baidu.com", "title": {"url": "https://baijiahao.baidu.com/s?id=1623605591526255522&wfr=spider&for=pc", "title": "2019年最值得关注的十大机器人初创公司：成立时间均不超过5年"}}, {"is_can_visited": true, "url": "https://zhuanlan.zhihu.com/p/77253076", "domain": "zhuanlan.zhihu.com", "title": {"url": "https://zhuanlan.zhihu.com/p/77253076", "title": "机器学习理论（四）线性回归中的梯度下降法 - 知乎"}}, {"is_can_visited": true, "url": "https://zhuanlan.zhihu.com/p/69897718?from_voters_page=true", "domain": "zhuanlan.zhihu.com", "title": {"url": "https://zhuanlan.zhihu.com/p/69897718?from_voters_page=true", "title": "关于在Keras中多标签分类器训练准确率问题 - 知乎"}}]}, {"img": "/static/images/publication-placeholder-icon.png", "title": "Node Classification on Graphs with Few-Shot Novel Labels via Meta Transformed Network Embedding", "url": "https://deepai.org/", "domain": "deepai.org", "zh": "基于元变换网络嵌入的少镜头新标签图的节点分类", "is_can_visited": true, "id": "255938f0396f3c9a07bf959dbe0d867d", "day": "2020-07-06", "more": [{"is_can_visited": true, "url": "https://zhuanlan.zhihu.com/p/96485139?utm_source=wechat_session", "domain": "zhuanlan.zhihu.com", "title": {"url": "https://zhuanlan.zhihu.com/p/96485139?utm_source=wechat_session", "title": "细思恐极!前五名人工智能机器人自主说出的最恐怖的话 - 知乎"}}, {"is_can_visited": true, "url": "https://baijiahao.baidu.com/s?id=1623605591526255522&wfr=spider&for=pc", "domain": "baijiahao.baidu.com", "title": {"url": "https://baijiahao.baidu.com/s?id=1623605591526255522&wfr=spider&for=pc", "title": "2019年最值得关注的十大机器人初创公司：成立时间均不超过5年"}}, {"is_can_visited": true, "url": "https://zhuanlan.zhihu.com/p/77253076", "domain": "zhuanlan.zhihu.com", "title": {"url": "https://zhuanlan.zhihu.com/p/77253076", "title": "机器学习理论（四）线性回归中的梯度下降法 - 知乎"}}, {"is_can_visited": true, "url": "https://zhuanlan.zhihu.com/p/69897718?from_voters_page=true", "domain": "zhuanlan.zhihu.com", "title": {"url": "https://zhuanlan.zhihu.com/p/69897718?from_voters_page=true", "title": "关于在Keras中多标签分类器训练准确率问题 - 知乎"}}, {"is_can_visited": true, "url": "https://zhuanlan.zhihu.com/p/67438204", "domain": "zhuanlan.zhihu.com", "title": {"url": "https://zhuanlan.zhihu.com/p/67438204", "title": "《Neural Network Methods in NLP》 笔记 - 知乎"}}]}, {"img": "https://images.deepai.org/news-links/1f51771811c84b97925920ab95959e75/how-to-enable-and-use-gmail-s-ai-powered-smart-reply.jpg", "title": "How to enable and use Gmail's AI-powered Smart Reply and Smart Compose tools", "url": "https://deepai.org/posts/how-to-enable-and-use-gmail-s-ai-powered-smart-reply-and-smart-compose-tools", "domain": "deepai.org", "zh": "如何启用和使用Gmail的智能回复和智能撰写工具", "is_can_visited": true, "id": "8f54c49b11ddf8ed230887b474defa88", "day": "2020-07-06", "more": [{"is_can_visited": true, "url": "https://zhuanlan.zhihu.com/p/96485139?utm_source=wechat_session", "domain": "zhuanlan.zhihu.com", "title": {"url": "https://zhuanlan.zhihu.com/p/96485139?utm_source=wechat_session", "title": "细思恐极!前五名人工智能机器人自主说出的最恐怖的话 - 知乎"}}, {"is_can_visited": true, "url": "https://baijiahao.baidu.com/s?id=1623605591526255522&wfr=spider&for=pc", "domain": "baijiahao.baidu.com", "title": {"url": "https://baijiahao.baidu.com/s?id=1623605591526255522&wfr=spider&for=pc", "title": "2019年最值得关注的十大机器人初创公司：成立时间均不超过5年"}}, {"is_can_visited": true, "url": "https://zhuanlan.zhihu.com/p/77253076", "domain": "zhuanlan.zhihu.com", "title": {"url": "https://zhuanlan.zhihu.com/p/77253076", "title": "机器学习理论（四）线性回归中的梯度下降法 - 知乎"}}, {"is_can_visited": true, "url": "https://zhuanlan.zhihu.com/p/69897718?from_voters_page=true", "domain": "zhuanlan.zhihu.com", "title": {"url": "https://zhuanlan.zhihu.com/p/69897718?from_voters_page=true", "title": "关于在Keras中多标签分类器训练准确率问题 - 知乎"}}, {"is_can_visited": true, "url": "https://zhuanlan.zhihu.com/p/67438204", "domain": "zhuanlan.zhihu.com", "title": {"url": "https://zhuanlan.zhihu.com/p/67438204", "title": "《Neural Network Methods in NLP》 笔记 - 知乎"}}, {"is_can_visited": true, "url": "https://baijiahao.baidu.com/s?id=1599981856279998936&wfr=spider&for=pc", "domain": "baijiahao.baidu.com", "title": {"url": "https://baijiahao.baidu.com/s?id=1599981856279998936&wfr=spider&for=pc", "title": "问答：Gmail中的智能撰写是什么？如何开启？"}}, {"is_can_visited": true, "url": "https://baijiahao.baidu.com/s?id=1606979437323514537&wfr=spider&for=pc", "domain": "baijiahao.baidu.com", "title": {"url": "https://baijiahao.baidu.com/s?id=1606979437323514537&wfr=spider&for=pc", "title": "谷歌套件喜提新功能：Gmail智能撰写"}}, {"is_can_visited": true, "url": "https://baijiahao.baidu.com/s?id=1600068507254895433&wfr=spider&for=pc", "domain": "baijiahao.baidu.com", "title": {"url": "https://baijiahao.baidu.com/s?id=1600068507254895433&wfr=spider&for=pc", "title": "谷歌Gmail新功能究竟有多“新”？“智能回复”？"}}]}]